Repository: muudry/colobot-data
Catalog: levels/exercises/chapter002/level007/po/*.po
Languages: hu

source: Wasp Hunter 2
hu: Darázs vadászat 2

source: Get better at shooting down the wasps.
hu: Légy ügyesebb a darazsírtásban.

source: Wasp2
hu: Darázs2

source: Objective
hu: Feladat

source: Bring down the flying wasps in a more efficient way than with the previous program.
hu: Lődd le a darazsakat az előző programnál hatékonyabb módon.

source: Here is again the program of the previous exercise that shoots down all the wasps after many, many unsuccessful attempts:
hu: Ez volt az előző gyakorlat programja, ami csak sok sikertelen próbálkozás árán tudta lelőni az összes darazsat:

source: extern void object::Wasp1() { <a cbot|type>object</a> item; <a cbot|aim>aim</a>(0); <a cbot|while>while</a> (true) { <a cbot|while>while</a> (<a cbot|radar>radar</a>(AlienWasp, 0, 360, 0, 20) == null) { item = <a cbot|radar>radar</a>(AlienWasp); <a cbot|turn>turn</a>(<a cbot|direct>direction</a>(item.position)); <a cbot|motor>motor</a>(1,1); <a cbot|jet>jet</a>(0); <a cbot|if>if</a> (position.z > item.position.z) { <a cbot|jet>jet</a>(-0.3); } <a cbot|if>if</a> (position.z < item.position.z - 1) { <a cbot|jet>jet</a>(0.3); } <a cbot|wait>wait</a>(0.2); } item = <a cbot|radar>radar</a>(AlienWasp); <a cbot|turn>turn</a>(<a cbot|direct>direction</a>(item.position)); <a cbot|fire>fire</a>(1); } }
hu: extern void object::Darázs1() { <a cbot|type>object</a> item; <a cbot|aim>aim</a>(0); <a cbot|while>while</a> (true) { <a cbot|while>while</a> (<a cbot|radar>radar</a>(AlienWasp, 0, 360, 0, 20) == null) { item = <a cbot|radar>radar</a>(AlienWasp); <a cbot|turn>turn</a>(<a cbot|direct>direction</a>(item.position)); <a cbot|motor>motor</a>(1,1); <a cbot|jet>jet</a>(0); <a cbot|if>if</a> (position.z > item.position.z) { <a cbot|jet>jet</a>(-0.3); } <a cbot|if>if</a> (position.z < item.position.z - 1) { <a cbot|jet>jet</a>(0.3); } <a cbot|wait>wait</a>(0.2); } item = <a cbot|radar>radar</a>(AlienWasp); <a cbot|turn>turn</a>(<a cbot|direct>direction</a>(item.position)); <a cbot|fire>fire</a>(1); } }

source: The many failures are due to the fact that the wasp is already gone before the bullets can reach it. The only way to improve the program consists in setting the power of the two motors and of the jet in such a way that the bot follows the movement of the target during the burst.
hu: A sok mellélövés oka az volt, hogy a darázs már arrább ment mire a lövedék odaért. Úgy tudunk javítani a programon, hogy a két motor és sugárhajtómű erejét úgy állítjuk be, hogy a bot kövesse célpont mozgását a sorozatlövés során.

source: Just before the shot, the program adjusts a last time the direction with <c/>turn(direction(item.position));<n/>. In order to follow the wasp during the burst, you have to "remember" the angle of this last rotation: if the angle was positive (rotation to the left), the bot must continue to turn left during the burst; if the angle was negative, the bot must continue to turn right.
hu: Közvetlenül a lövés előtt, a program irányba áll a <c/>turn(direction(item.position));<n/> utasítással. Ahhoz, hogy követhessük a darazsat a sorozat alatt, "emlékeznünk" kell ennek az utolsó fordulatnak a szögére: Ha a szög pozitív volt (bal fordulat), akkor a bot tovább kell forduljon balra a sorozat alatt; ha szög negatív volt, akkor a botnak jobbra kell folytatnia a fordulatot.

source: In order to "remember" the angle of the last rotation, we need a variable that can contain just one number. If we choose to call it <code>angle</code>, we must define the variable with the following line at the beginning of the program:
hu: Ahhoz hogy "emlékezzünk" az utolsó fordulat szögére, szükségünk lesz egy olyan változóra ami egy számot tárol. Ha ezt <code>szög</code>-nek nevezzük el, akkor definiálnunk kell egy változót az alábbi sor segítségével a program elején:

source: <a cbot|type>float</a> angle;
hu: <a cbot|type>float</a> szög;

source: The variable type <a cbot|type>float</a> is the variable type that can contain any number, i.e. whole numbers or real numbers. Please refer to the <a cbot|type>text about variable types</a> if you want to know more about the different types of variables and what they can contain.
hu: A változó típusa <a cbot|type>float</a>, ami egy olyan változó típus amely tetszőleges számot tud tárolni, tehát egész és valós számot egyaránt. Ha többet szeretnél tudni arról, hogy milyen változó típusok vannak, és azok mit tartalmazhatnak, akkor kérlek lásd <a cbot|type>a változó típusokról</a> szóló oldalt.

source: Just before the instruction <c/>fire(1);<n/>, instead of writing <c/><a cbot|turn>turn</a>(<a cbot|direct>direction</a>(item.position));<n/>, we will put the rotation angle into the variable <code>angle</code>:
hu: Közvetlenül a <c/>fire(1);<n/> utasítás előtt, ahelyett hogy azt írjuk, hogy <c/><a cbot|turn>turn</a>(<a cbot|direct>direction</a>(item.position));<n/>, be kell tennünk a fordulat szögét a <code>szög</code> változóba:

source: angle = direction(item.position);
hu: szög = direction(item.position);

source: Then we perform the rotation, and we set the power of the motors so that the bot continues the movement:
hu: Ezután végrehajtjuk a fordulatot, és úgy állítjuk be a motorok tolóerejét, hogy a bot folytassa a megkezdett mozdulatot:

source: turn(angle); if (angle < 0) { motor(1,0.5); } else { motor(0.5,1); }
hu: turn(szög); if (szög < 0) { motor(1,0.5); } else { motor(0.5,1); }

source: The instruction <code>else</code> determines what instructions the program should execute if the condition stated in the <code>if</code> instruction is false.
hu: Az <code>else</code> kulcsszó utáni blokk határozza meg milyen utasításokat kell a programnak végrehajtania abban az esetben, ha az <code>if</code> utáni kifejezés értéke hamis.

source: Then we must set the power of the jet so that the bot follows the wasp also in the vertical direction:
hu: Ezek után a sugárhajtómű tolóerejét is be kell állítanunk, méghozzá úgy, hogy a bot függőleges irányban is kövesse a darazsat:

source: As you will see, this program is much more efficient than the previous one!
hu: Meglátod, ez a program sokkal hatékonyabb mint az előző!

source: See also
hu: Lásd még:

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
hu: <a cbot>Programozás</a>, <a cbot|type>típusok</a> és <a cbot|category>kategóriák</a>.
