Repository: muudry/colobot-data
Catalog: colobot/*.po
Languages: hu

source: Opening brace missing
hu: Nyitó kapocs hiányzik

source: Opening bracket missing
hu: Nyitó zárójel hiányzik

source: Operation impossible with value "nan"
hu: "nan" értékkel nem lehet műveletet végezni

source: Options
hu: Beállítások

source: Options\Preferences
hu: Beállítások\Beállítások

source: Organic matter
hu: Szerves anyag

source: Origin of last message\Shows where the last message was sent from
hu: Üzenet forrása\Mutatja honnan jött a legutóbbi üzenet

source: Original game developed by:
hu: Az eredeti játék fejlesztője:

source: Overwrite existing file?
hu: Felülírjam a már létező fájlt?

source: Parameters missing
hu: Hányzó paraméterek

source: Particles in the interface\Steam clouds and sparks in the interface
hu: Részecskék a kezelőfelületen\Gőzfelhők és szikrák a kezelőfelületen

source: Paste (Ctrl+V)
hu: Beillesztés (Ctrl+V)

source: Pause blur\Blur the background on the pause screen
hu: Szüneti homály\A szünet képernyőn homályosítsa el a hátteret

source: Pause in background\Pause the game when the window is unfocused
hu: Szünet háttérben\Szüneteltesse a játékot amikor az ablak nincs fókuszban

source: Pause/continue
hu: Szünet/folytatás

source: Pause\Pause the game without opening menu
hu: Szünet\Szüneteltesse a játékot a menü megnyitása nélkül

source: Phazer shooter
hu: Pfézervető

source: Photography
hu: Fényképészet

source: Place occupied
hu: A hely foglalt

source: Planets:
hu: Bolygók:

source: Plans for builder available
hu: Új terv: építő

source: Plans for defense tower available
hu: Új terv: Lövegtorony

source: Plans for nuclear power plant available
hu: Új terv: Nukleáris erőmű

source: Plans for phazer shooter available
hu: Új terv: Pfázervető

source: Plans for shielder available
hu: Új terv: Pajzshordozó

source: Plans for shooter available
hu: Új terv: Löveg

source: Plans for thumper available
hu: Új terv: Dobbantó

source: Plans for tracked robots available
hu: Új terv: Lánctalpas robotok

source: Plant a flag
hu: Zászló leszúrása

source: Play\Start mission!
hu: Játék\Küldetés megkezdése!

source: Player
hu: Játékos

source: Player name
hu: Játékos neve

source: Player's name
hu: Játékos neve

source: Power cell
hu: Energiacella

source: Power cell available
hu: Energiacella elérhető

source: Power cell factory
hu: Energiacella gyár

source: Power station
hu: Töltőállomás

source: Practice bot
hu: Gyakorló robot

source: Press \key help; to read instructions on your SatCom
hu: A \key help; gomb lenyomásával előhozhatod a útmutatót a SatCom-odon

source: Previous
hu: Előző

source: Previous object\Selects the previous object
hu: Előző tárgy\Kiválasztja az előző tárgyat

source: Previous selection (\key desel;)
hu: Előző kiválasztás (\key desel;)

source: Private element
hu: Privát elem

source: Private\Private folder
hu: Privát\Privát mappa

source: Processing level file
hu: Pálya fájl feldolgozása

source: Program cloned
hu: Program klónozva

source: Program editor
hu: Program szerkesztő

source: Program finished
hu: Program lefutott

source: Program infected by a virus
hu: A programot vírus fertőzte meg

source: Programming exercises
hu: Programozási feladatok

source: Programming help
hu: Programozási segédlet

source: Programming help (\key prog;)
hu: Programozási segédlet (\key prog;)

source: Programming help\Gives more detailed help with programming
hu: Programozási segédlet\Részletesebb segítséget nyújt a programozáshoz

source: Programs dispatched by Houston
hu: Houston által küldött programok

source: Public required
hu: Nyivánosnak kell lennie

source: Public\Common folder
hu: Nyilvános\Közös mappa

source: Quake at explosions\The screen shakes at explosions
hu: Földrengés robbanáskor\A képernyő beleremeg a robbanásokba

source: Quick load\Immediately load game
hu: Gyorstöltés\Azonnal betölti a játékot

source: Quick save\Immediately save game
hu: Gyorsmentés\Azonnal lementi a játékot

source: Quicksave slot not found
hu: Gyorsmentés helye nem található

source: Quit\Quit Colobot: Gold Edition
hu: Kilépés\Kilépés a Colobot: Gold Edition -ből

source: Quit\Quit the current mission or exercise
hu: Kilépés\Kilép a jelenlegi küldetésből vagy feladatból

source: Radar station
hu: Radarállomás

source: Read error
hu: Olvasási hiba

source: Recorder
hu: Rögzítő

source: Recycle (\key action;)
hu: Újrahasznosítás (\key action;)

source: Recycler
hu: Újrahasznosító

source: Red
hu: Vörös

source: Red flag
hu: Vörös zászló

source: Reflections on the buttons \Shiny buttons
hu: Tükröződés a gombokon\Csillogó gombok

source: Refresh\Refresh the list of currently installed mods
hu: Frissítés\Frissíti a jelenleg telepített mod-ok listáját

source: Remains of Apollo mission
hu: Az Apollo küldetések maradványai

source: Remove a flag
hu: Zászló eltávolítása

source: Remove selected program
hu: Kiválasztott program eltávolítása

source: Render distance\Maximum visibility
hu: Megjelenítési távolság\Milyen messzire lehet ellátni

source: Repair center
hu: Javító állomás

source: Research center
hu: Kutató állomás

source: Research program already performed
hu: Ez a kutatás már lefutott

source: Research program completed
hu: A kutás elkészült

source: Reserved keyword of CBOT language
hu: Ez a szo a CBOT nyelv egyik lefoglalt kulcsszava

source: Resolution
hu: Felbontás

source: Resolution:
hu: Felbontás:

source: Resources
hu: Erőforrások

source: Restart\Restart the mission from the beginning
hu: Újraindítás\Újrakezdi a küldetést az elejétől

source: Restoring CBot execution state
hu: A CBot végrehajtási állapotának visszaállítása

source: Restoring saved objects
hu: Mentett objektumok visszaállítása

source: Results
hu: Eredmények

source: Return to start
hu: Visszatérés a kiindulópontra

source: Robbie
hu: Robbi

source: Ruin
hu: Rom

source: Run research program for builder
hu: Építő kifejlesztése

source: Run research program for defense tower
hu: Lövegtorony kifejlesztése

source: Run research program for legged bots
hu: Lábas botok kifejlesztése

source: Run research program for nuclear power
hu: Nukleáris energia kifejlesztése

source: Run research program for orga shooter
hu: Orgavető kifejlesztése

source: Run research program for phazer shooter
hu: Pfézervető kifejlesztése

source: Run research program for shielder
hu: Pajzshordozó kifejlesztése

source: Run research program for shooter
hu: Löveg kifejlesztése

source: Run research program for target bot
hu: Célpont bot kifejlesztése

source: Run research program for thumper
hu: Dobbantó kifejlesztése

source: Run research program for tracked bots
hu: Lánctalpas meghajtás kifejlesztése

source: Run research program for winged bots
hu: Szárnyas botok kifejlesztése

source: Satellite report
hu: Műholdas jelentés

source: Save
hu: Mentés

source: Save (Ctrl+S)
hu: Mentés (Ctrl+S)

source: Save the current mission
hu: A jelenlegi küldetés mentése

source: Save\Save the current mission
hu: Mentés\A jelenlegi küldetés mentése

source: Save\Saves the current mission
hu: Mentés\A jelenlegi küldetés mentése

source: Select Folder
hu: Mappa kiválasztása

source: Select the astronaut\Selects the astronaut
hu: Az asztronauta kiválasztása\Kiválasztja az asztronoutát

source: Semicolon terminator missing
hu: Hiányzik a lezáró pontosvessző

source: Shadow resolution\Higher means better range and quality, but slower
hu: Árnyék felbontás\A nagyobb jobb távolságot és minéséget jelent, de lassít

source: Shield level
hu: Pajzs szintje

source: Shield radius
hu: Pajzs sugara

source: Shielder
hu: Pajzshordozó

source: Shoot (\key action;)
hu: Lövés (\key action;)

source: Show if the ground is flat
hu: Mutatja mennyire lapos a talaj

source: Show the place
hu: Mutatja a helyet

source: Show the range
hu: Mutatja a távot

source: Show the solution
hu: Mutatja a megoldást

source: Sign " : " missing
hu: Hiányzik a " : " jel

source: Simple shadows\Shadows spots on the ground
hu: Szimpla árnéykolás\Az árnyék egy folt a földön

source: Size 1
hu: 1-es méret

source: Size 2
hu: 2-es méret

source: Size 3
hu: 3-as méret

source: Size 4
hu: 4-es méret

source: Size 5
hu: 5-ős méret

source: Sniff (\key action;)
hu: Szimat (\key action;)

source: Solution
hu: Megoldás

source: Sound effects:\Volume of engines, voice, shooting, etc.
hu: Hanghatások:\Motorok, hangok, lövés, stb. hangereje.

source: Sound\Music and game sound volume
hu: Hang\Zene és a játékhangok hangereje

source: Space Explorer\Disables astronaut abilities
hu: Űr felderítő\Letiltja az asztronauta képességeit

source: Space Programmer\Disables radio-control
hu: Űrprogramozó\Letiltja a rádió-távirányítást

source: Space Researcher\Disables using all previously researched technologies
hu: Űrkutató\Letilt minden korábban kikutatott technológiát

source: Spaceship
hu: Űrhajó

source: Spaceship ruin
hu: Űrhajó roncs

source: Spider
hu: Pók

source: Spider fatally wounded
hu: A pók halálosan megsebesült

source: Stack overflow
hu: Verem túlcsordulás

source: Standard action\Standard action of the bot (take/grab, shoot, sniff, etc)
hu: Alapértelmezett tevékenység\A botok alap tevékenysége (elvétel/megragadás, lövés, szimatolás, stb.)

source: Standard controls\Standard key functions
hu: Alapértelmezett irányítás\Alapértelmezet gomb funkciók

source: Standard speed\Reset speed to normal
hu: Alapértelmezett sebesség\Visszaállítja a normál sebességet

source: Standard\Standard appearance settings
hu: Alapértelmezett\Alapértelmezés szerinti megjelenési beállítások

source: Start
hu: Rajt

source: Starting...
hu: Indítás...

source: Still working ...
hu: Még mindíg dolgozok ...

source: String missing
hu: Hinyzó string

source: Strip color:
hu: Csík szine:

source: Subber
hu: Tengeralattjáró

source: Suit color:
hu: Ruha szine:

source: Suit\Astronaut suit
hu: Ruha\Űrruha

source: Summary:
hu: Összegzés:

source: Survival kit
hu: Túlélőcsomag

source: Switch bots <-> buildings
hu: Váltás botok <-> épületek

source: Take off to finish the mission
hu: Szállj fel a küldetés befejezéséhez

source: Target
hu: Célpont

source: Target bot
hu: Célpont bot

source: Terrain relief
hu: Terep kiemelkedése

source: Texture filtering\Texture filtering
hu: Textura simítás\Texture filtering

source: Textures
hu: Texturák

source: The address %s could not be opened in a web browser.
hu: A %s cím nem nyitható meg a böngészőben.

source: The battle has ended
hu: A csatának vége

source: The expression must return a boolean value
hu: A kifejezés boolean értéket kell adjon

source: The function returned no value
hu: A függvény nem adott vissza értéket

source: The mission is not accomplished yet (press \key help; for more details)
hu: A küldetés még nincs teljesítve (a \key help; gomb további segítséget ad)

source: The path %s could not be opened in a file explorer.
hu: A %s elérési út nem nyitható meg a fájlkezelőben.

source: The types of the two operands are incompatible
hu: A két operandus típusa nem összegyeztethető

source: There are unsaved changes. Do you want to save them before leaving?
hu: Vannak nem mentett módosítások. Akarsz menteni még az indulás előtt?

source: This class already exists
hu: Már létezik ez az osztály

source: This class does not exist
hu: Ez az osztály nem létezik

source: This is example code that cannot be run directly
hu: Ez egy példa kód amit nem lehet közvetlenül futtatni

source: This is not a member of this class
hu: Ennek az osztálynak nincs ilyen tagja

source: This label does not exist
hu: Ez a cimke nem létezik

source: This menu is for userlevels from mods, but you didn't install any
hu: Ez a menu a modok felhasználói pályákhoz van, de neked nincs ilyen telepítve

source: This object is currently busy
hu: Ez a tárgy jelenleg foglalt

source: This object is not a member of a class
hu: Ez a tárgy nem tagja egy osztálynak sem

source: This parameter needs a default value
hu: Ennek a paramtérnek alapértelmezett érték kell

source: This program is read-only, clone it to edit
hu: Ez a program irásvédett, klónozd ha szerkeszteni szeretnéd

source: Thump (\key action;)
hu: Dobbantás (\key action;)

source: Thumper
hu: Dobbantó

source: Time: %s
hu: Idő: %s

source: Titanium
hu: Titánium

source: Titanium available
hu: Titánium elérhető

source: Titanium deposit (site for derrick)
hu: Titánium lelőhely (fúrótorony számára alkalmas hely)

source: Titanium ore
hu: Titánium érc

source: Titanium too close
hu: Túl közel van a titánium

source: Titanium too far away
hu: Túl messze van a titánium

source: Too close to a building
hu: Túl közel van az épület

source: Too close to an existing flag
hu: Túl közel van egy már létező zászló

source: Too close to space ship
hu: Túl közel van az űrhajó

source: Too many flags of this color (maximum 5)
hu: Túl sok ilyen színű zászló van (legfeljebb 5 lehet)

source: Too many parameters
hu: Túl sok paraméter

source: Tracked builder
hu: Lánctalpas építő

source: Tracked grabber
hu: Lánctalpas marok

source: Tracked orga shooter
hu: Lánctalpas orgavető

source: Tracked shooter
hu: Lánctalpas löveg

source: Tracked sniffer
hu: Lánctalpas szimat

source: Transforms only titanium
hu: Csak titániumot tud átalakítani

source: Transforms only uranium
hu: Csak urániumot tud átalakítani

source: Transmitted information
hu: Továbbított információ

source: Turn left (\key left;)
hu: Balra fordulás (\key left;)

source: Turn left\turns the bot to the left
hu: Balra fordul\A botot balra fordítja

source: Turn right (\key right;)
hu: Jobbra fordulás (\key right;)

source: Turn right\turns the bot to the right
hu: JObbra fordul\A botot jobbra fordítja

source: Type declaration missing
hu: Hiányzó típus deklaráció

source: Unable to control enemy objects
hu: Ellenséges célpontokat nem lehet irányítani

source: Undo (Ctrl+Z)
hu: Visszavonás (Ctrl+Z)

source: Unit
hu: Egység

source: Unknown Object
hu: Ismeretlen tárgy

source: Unknown author
hu: Ismeretlen szerző

source: Unknown command
hu: Ismeretlen parancs

source: Unknown escape sequence
hu: Ismeretlen feloldó szekvencia

source: Unknown function
hu: Ismeretlen függvény

source: Up (\key gup;)
hu: Fel (\key gup;)

source: Up\Move the selected mod up so it's loaded sooner (mods may overwrite files from the mods above them)
hu: Fel\Fefelé Mozgatja a kiválasztott mod-ot, így az hamarabb töltődik be (a mod-ok felülírhatják a felettük lévő mod-ok fájljait)

source: Uranium deposit (site for derrick)
hu: Uránium lelőhely (fúrótorony számára alkalmas hely)

source: Uranium ore
hu: Uránium érc

source: User levels
hu: Felhasználói pályák

source: Variable name missing
hu: Hiányzó változó név

source: Variable not declared
hu: A változó nincs deklarálva

source: Variable not initialized
hu: A változó nem kapott kezdőértéket

source: Vault
hu: Páncélterem

source: Version
hu: Verzió

source: Vertical Synchronization\Limits the number of frames per second to display frequency
hu: Függőleges szinkronizáció\Korlátozza hány képkocka jelhet meg másodpercenként

source: Violet flag
hu: Ibolya zászló

source: Void parameter
hu: Void paraméter

source: Wasp
hu: Darázs

source: Wasp fatally wounded
hu: Darázs halálosan megsebesült

source: Waste
hu: Hulladék

source: Website
hu: Webhely

source: Wheeled builder
hu: Kerekes építő

source: Wheeled grabber
hu: Kerekes marok

source: Wheeled orga shooter
hu: Kerekes orgavető

source: Wheeled shooter
hu: Keres löveg

source: Wheeled sniffer
hu: Kerekes szimat

source: Winged builder
hu: Szárnyas építő

source: Winged grabber
hu: Szárnyas marok

source: Winged orga shooter
hu: Szárnyas orgavető

source: Winged shooter
hu: Szárnyas löveg

source: Winged sniffer
hu: Szárnyas szimat

source: Withdraw shield (\key action;)
hu: Pajzs bevonása (\key action;)

source: Workshop\Open the workshop to search for mods
hu: Műhely\Nyissa meg a műhelyt, hogy mod-okat keressen

source: Worm
hu: Féreg

source: Worm fatally wounded
hu: Féreg haláosan megsebesült

source: Wreckage
hu: Hajóroncs

source: Write error
hu: Írási hiba

source: Wrong type for the assignment
hu: Nem megfelelő típus az értékadásban

source: Yellow flag
hu: Sárga zászló

source: Yes
hu: Igen

source: You can fly with the keys (\key gup;) and (\key gdown;)
hu: A (\key gup;) és (\key gdown;) gombokkal tudsz repülni

source: You can not carry a radioactive object
hu: Radiokatív tágyat nem tudsz cipelni

source: You can not carry an object under water
hu: Víz alat nem tudsz tárgyakat cipelni

source: You cannot use "%s" in this exercise (used: %d)
hu: Nem használhatod ebben a küldetésben: "%s" (ennyiszer használva: %d)

source: You found a usable object
hu: Egy használató tárgyat találtál

source: You have to use "%1$s" at least once in this exercise (used: %2$d)
hu: Ezt legalább egyszer használnod kell ebben a gyakorlatban: "%1$s" (ennyiszer használva: %2$d)

source: You have to use "%1$s" at most once in this exercise (used: %2$d)
hu: Ezt legfeljebb egyszer használhatod ebben a gyakorlatban: "%1$s" (ennyiszer használva: %2$d)

source: You must get on the spaceship to take off
hu: Be kell szállnod az űrhajóba hogy felszállhass

source: Zoom mini-map
hu: Mini-térkép zoom

source: \Blue flags
hu: \Kék zászlók

source: \Eyeglasses 1
hu: \1-es szemüveg

source: \Eyeglasses 2
hu: \2-es szemüveg

source: \Eyeglasses 3
hu: \3-as szemüveg

source: \Eyeglasses 4
hu: \4-es szemüveg

source: \Eyeglasses 5
hu: \5-ös szemüveg

source: \Face 1
hu: \1-es arc

source: \Face 2
hu: \2-es arc

source: \Face 3
hu: \3-as arc

source: \Face 4
hu: \4-es arc

source: \Green flags
hu: \Zöld zászlók

source: \New player name
hu: \Új játékos neve

source: \No eyeglasses
hu: \Szemüveg nélkül

source: \Raise the pencil
hu: \Ceruza felemelése

source: \Red flags
hu: \Vörös zászlók

source: \Return to Colobot: Gold Edition
hu: \Visszatérés a Colobot: Gold Edition -höz

source: \SatCom on standby
hu: \SatCom készenlétben

source: \Start recording
hu: \Rögzítés megkezdése

source: \Stop recording
hu: \Rögzítés befejezése

source: \Turn left
hu: \Balra fordulás

source: \Turn right
hu: \Jobbra fordulás

source: \Use the black pencil
hu: \A fekete ceruza használata

source: \Use the blue pencil
hu: \A kék ceruza használata

source: \Use the brown pencil
hu: \A barna ceruza használata

source: \Use the green pencil
hu: \A zöld ceruza használata

source: \Use the orange pencil
hu: \A narancs ceruza használata

source: \Use the purple pencil
hu: \A lila ceruza használata

source: \Use the red pencil
hu: \A vörös ceruza használata

source: \Use the yellow pencil
hu: \A sárga ceruza használata

source: \Violet flags
hu: \Ibolya zászlók

source: \Yellow flags
hu: \Sárga zászlók
