Repository: muudry/colobot-data
Catalog: colobot/*.po
Languages: hu

source: or
hu: vagy

source: " [ " expected
hu: " [ " kellene ide

source: " ] " missing
hu: Lemaradt a " ] "

source: %s: %d pts
hu: %s: %d pont

source: +\Missions with bonus content and optional challenges
hu: +\Küldetések bónusztartalommal és választható kihívásokkal

source: ..behind
hu: ..mögött

source: ..in front
hu: ..előtt

source: ..power cell
hu: ..energiacella

source: 1) First click on the key you want to redefine.
hu: 1) Először kattints a gombra amit át szeretnél állítani.

source: 2) Then press the key you want to use instead.
hu: 2) Ezután nyomd meg a gombot amit e helyett használni szeretnél.

source: << Back \Back to the previous screen
hu: << Vissza \ Vissza az előző képernyőre

source: <<< Sorry; mission failed >>>
hu: <<< Sajnos ezt a küldetést elbuktad >>>

source: <<< Team %s finished! >>>
hu: <<< A %s csapat végzett! >>>

source: <<< Team %s lost! >>>
hu: <<< A %s csapat vesztett! >>>

source: <<< Team %s recieved %d points >>>
hu: <<< A %s csapat %d pontott kapott >>>

source: <<< Well done; mission accomplished >>>
hu: <<< Ügyes vagy, teljesítetted a küldetést >>>

source: A label must be followed by "for"; "while"; "do" or "switch"
hu: Cimke után "for"; "while"; "do" vagy "switch" következik

source: A variable can not be declared twice
hu: Nem szabad ugyanazt a változót kétszer deklarálni

source: Abort\Abort the current mission
hu: Megszakítás\A jelenlegi küldetés félbehagyása

source: Access beyond array limit
hu: A tömb méretét meghaladó hozzáférés

source: Access to solution\Shows the solution (detailed instructions for missions)
hu: Mutasd a megoldást\Megjeleníti a megoldást (részletes útmutató a küldetésekhez)

source: Access to solutions\Show program "4: Solution" in the exercises
hu: Mutasd a megoldást\Megjeleníti a programot "4: Megoldás" a feladatok közt

source: Add new program
hu: Új program felvitele

source: Alien Queen
hu: Alien királynő

source: Alien Queen killed
hu: Az Alien királynő meghalt

source: Already carrying something
hu: Már viszel valamit

source: Alternative camera mode\Move sideways instead of rotating (in free camera)
hu: Alternatív kamera mód\Oldalra mozog forgás helyett (szabad kamera módban)

source: Ambiguous call to overloaded function
hu: Nem egyértelmű a felülbírált függvényre vonatkozó hívás

source: Analysis already performed
hu: Már kész van az elemzés

source: Analysis performed
hu: Elkészült az elemzés

source: Anisotropy level\Anisotropy level
hu: Anizotrópia szint\Anizotrópia szint

source: Ant
hu: Hangya

source: Ant fatally wounded
hu: A hangya halálosan megsebesült

source: Appearance\Choose your appearance
hu: Megjelenés\Állítsd be hogyan nézel ki

source: Apply changes\Activates the changed settings
hu: Véglegesít\Rögzíti a beállítások változásait

source: Apply\Apply the current mod configuration
hu: Alkalmaz\A jelenlegi mod beállítások alkalmazása

source: Appropriate constructor missing
hu: Hiányzik a megfelelő építő

source: Assignment impossible
hu: Ilyen hozzárendelés/értékadás nem lehetséges

source: Automatic indent\When program editing
hu: Automata behúzás\Program szerkeztéskor

source: Autosave interval\How often your game will autosave
hu: Autosave intervallum\Milyen gyakran legyen automatikus mentés

source: Autosave slots\How many autosave slots you'll have
hu: Autosave helyek\Hány darab autosave helyed legyen

source: Autosave\Enables autosave
hu: Autosave\Automatikus mentés engedélyezése

source: Back
hu: Vissza

source: Background sound:\Volume of audio tracks
hu: Háttér hangok:\A hangsávok hangereje

source: Backward (\key down;)
hu: Hátrálás (\key down;)

source: Backward\Moves backward
hu: Hátrálás\Hátrafelé mozog

source: Bad argument for "new"
hu: Helytelen változó a "new"-nak

source: Big indent\Indent 2 or 4 spaces per level defined by braces
hu: Nagy behúzás\A kapcsok szintjétől függő 2 vagy 4 helynyi behúzás

source: Black box
hu: Fekete doboz

source: Blood\Display blood when the astronaut is hit
hu: Vér\Megjelenjen-e a vér amikor az asztronauta megsebesül

source: Blue
hu: Kék

source: Blue flag
hu: Kék zászló

source: Bot destroyed
hu: Bot megsemmisült

source: Bot factory
hu: Bot gyár

source: Build (\key action;)
hu: Építés (\key action;)

source: Build a bot factory
hu: Bot gyár építés

source: Build a converter
hu: Konverter építés

source: Build a defense tower
hu: Lövegtorony építés

source: Build a derrick
hu: Fúrótorony építés

source: Build a exchange post
hu: Csereállomás építés

source: Build a legged builder
hu: Lábas építő építés

source: Build a legged grabber
hu: Lábas marok építés

source: Build a legged orga shooter
hu: Lábas orgavető építés

source: Build a legged shooter
hu: Lábas löveg építés

source: Build a legged sniffer
hu: Lábas szimat építés

source: Build a lightning conductor
hu: Villámhárító építés

source: Build a nuclear power plant
hu: Atomerőmű építés

source: Build a phazer shooter
hu: Pfézervető építés

source: Build a power cell factory
hu: Energiacella gyár építés

source: Build a power station
hu: Töltőállomás építés

source: Build a radar station
hu: Radarállomás építés

source: Build a recycler
hu: Újrahasznosító építés

source: Build a repair center
hu: Javító állomás építés

source: Build a research center
hu: Kutató állomás építés

source: Build a shielder
hu: Pajzshordozó építés

source: Build a subber
hu: Tengerallatjáró építés

source: Build a target bot
hu: Célpont bot építés

source: Build a thumper
hu: Dobbantó építés

source: Build a tracked builder
hu: Lánctalpas építő építés

source: Build a tracked grabber
hu: Lánctalpas marok építés

source: Build a tracked orga shooter
hu: Lánctalpas orgavető építés

source: Build a tracked shooter
hu: Lánctalpas löveg építés

source: Build a tracked sniffer
hu: Lánctalpas szimat építés

source: Build a vault
hu: Pince építés

source: Build a wheeled builder
hu: Kerekes építő építés

source: Build a wheeled grabber
hu: Kerekes marok építés

source: Build a wheeled orga shooter
hu: Kerekes orgavető építés

source: Build a wheeled shooter
hu: Kerekes löveg építés

source: Build a wheeled sniffer
hu: Kerekes szimat építés

source: Build a winged builder
hu: Szárnyas építő építés

source: Build a winged grabber
hu: Szárnyas marok építés

source: Build a winged orga shooter
hu: Szárnyas orgavető építés

source: Build a winged shooter
hu: Szárnyas löveg építés

source: Build a winged sniffer
hu: Szárnyas szimat építés

source: Build an autolab
hu: Autolab építés

source: Building completed
hu: Épület elkészült

source: Building destroyed
hu: Epület megsemmisült

source: Button %1
hu: %1 gomb

source: Calling an unknown function
hu: Ismeretlen függvény hívása

source: Camera (\key camera;)
hu: Kamera (\key camera;)

source: Camera back\Moves the camera backward
hu: Kamera hátra\Hátrafelé mozgatja a kamerát

source: Camera border scrolling\Scrolling when the mouse touches right or left border
hu: Kamera keret görgetés\Görgetés amikor az egér a képernyő széléhez ér

source: Camera closer\Moves the camera forward
hu: Kamera közelítés\Közelebb mozgatja a kamerát

source: Camera down\Turns the camera down
hu: Kamera le\Lefelé fordítja a kamerát

source: Camera left\Turns the camera left
hu: Kamera balra\Balra fordítja a kamerát

source: Camera right\Turns the camera right
hu: Kamera jobbra\Jobbra fordítja a kamerát

source: Camera up\Turns the camera up
hu: Kamera fel\Felfelé fordítja a kamerát

source: Can not produce not researched object
hu: A még ki nem kutatott tárgyat nem lehet gyártani

source: Can not produce this object in this mission
hu: Ebben a küldetésben nem lehet ezt a tárgyat gyártani

source: Can't open file
hu: A fájlt nem lehet megnyitni

source: Cancel
hu: Mégsem

source: Cancel\Cancel all changes
hu: Mégsem\Minden változtatás visszavonása

source: Challenges
hu: Kihívások

source: Challenges in the chapter:
hu: Kihívások ebben a fejezetben:

source: Challenges\Programming challenges
hu: Kihívások\Programozási kihívások

source: Change camera\Switches between onboard camera and following camera
hu: Kamera váltás\Vált a fedélzeti és követő kamera között

source: Change player\Change player
hu: Játékos beállítása\Játékos beállítása

source: Changes
hu: Változások

source: Chapters:
hu: Fejezetek:

source: Cheat console\Show cheat console
hu: Csalás konzol\Mutasd a csalás konzolt

source: Checkpoint
hu: Ellenörző pont

source: Class name expected
hu: Osztálynévnek kellene itt szerepelnie

source: Climb\Increases the power of the jet
hu: Emelkedés\Növeli a sugárhajtómű tolóerejét

source: Clone program
hu: Program klónozása

source: Clone selected program
hu: Kiválasztott program klónozása

source: Close
hu: Bezár

source: Closing bracket missing
hu: Záró kapocs hiányzik

source: Code battle
hu: Kódcsata

source: Code battles
hu: Kódcsaták

source: Code battles\Program your robot to be the best of them all!
hu: Kódcsaták\Te robotod programja legyen a legjobb mindközül!

source: Colobot rules!
hu: A colobot menő!

source: Command line
hu: Parancssor

source: Compilation ok (0 errors)
hu: Fordítás OK (0 hiba)

source: Compile
hu: Fordítás

source: Continue
hu: Folytatás

source: Continue\Continue the current mission
hu: Folytatás\A jelenlegi küldetés folytatása

source: Controls\Keyboard, joystick and mouse settings
hu: Irányítás\Billentyűzet, botkormány és egér beállítások

source: Converts ore to titanium
hu: Titániummá alakítja az ércet

source: Copy
hu: Másolás

source: Copy (Ctrl+C)
hu: Másolás (Ctrl+C)

source: Could not open the file explorer!
hu: Nem sikerült megnyitni a fájlkezelőt!

source: Could not open the web browser!
hu: Nem sikerült megnyitni a böngészőt!

source: Current mission saved
hu: Jelenlegi küldetés elmentve

source: Custom levels:
hu: Egyedi pályák:

source: Custom levels\Levels from mods created by the users
hu: Egyedi pályák\A felhasználók által alkotott modokból származó pályák

source: Customize your appearance
hu: A kinézeted testreszabása

source: Cut (Ctrl+X)
hu: Kivágás (Ctrl+X)

source: Defense tower
hu: Lövegtorony

source: Delete mark
hu: Jelző törlése

source: Delete player\Deletes the player from the list
hu: Játékos törlése\Törli a jatékost a listából

source: Delete\Deletes the selected file
hu: Törlés\A kiválasztott fájl törlése

source: Derrick
hu: Fúrótorony

source: Descend\Reduces the power of the jet
hu: Süllyedés\Csökkenti a sugárhajtómű tolóerejét

source: Description:
hu: Leírás:

source: Destroy
hu: Rombol

source: Destroy the building
hu: Lerombolja az épületet

source: Destroyer
hu: Romboló

source: Device\Driver and resolution settings
hu: Eszköz\Meghajtó és felbontás beállítások

source: Disable\Disable the selected mod
hu: Letiltás\A kiválasztott mod letíltása

source: Dividing by zero
hu: Nullával való osztás

source: Do you really want to destroy the selected building?
hu: Valóban le akarod rombolni a kiválsztott épületet?

source: Do you want to delete %s's saved games?
hu: Le akarod törölni %s mentett játékállásait?

source: Doors blocked by a robot or another object
hu: Az ajtókat elállja egy robot vagy más tárgy

source: Down (\key gdown;)
hu: Le (\key gdown;)

source: Down\Move the selected mod down so it's loaded later (mods may overwrite files from the mods above them)
hu: Le\Lefelé Mozgatja a kiválasztott mod-ot, így az később töltődik be (a mod-ok felülírhatják a felettük lévő mod-ok fájljait)

source: Drawer bot
hu: Rajzoló bot

source: Duplicate label in switch
hu: Duplikálja a címkét a switch-ben

source: Dust\Dust and dirt on bots and buildings
hu: Por\Por és szenny a botokon és az épületeken

source: Dynamic lighting\Mobile light sources
hu: Dinamikus világítás\Mozgó fényforrások

source: Dynamic shadows ++\Dynamic shadows + self shadowing
hu: Dinamikus árnyékok ++\Dinamikus árnyékok + önárnyékolás

source: Dynamic shadows\Beautiful shadows!
hu: Dinamikus árnyékok\Gyönyörű árnyékok!

source: Edit the selected program
hu: A kiválasztott program szerkesztése

source: Egg
hu: Pete

source: Empty character constant
hu: Üres karakter konstans

source: Enable\Enable the selected mod
hu: Engedélyezés\A kiválasztott mod engedélyezése

source: End of block missing
hu: Hiányzik a blokk vége

source: Energy deposit (site for power station)
hu: Energia lelőhely (töltőállomás számára alkalmas hely)

source: Energy level
hu: Energia szint

source: Engineer
hu: Mérnök

source: Error in instruction move
hu: Hiba a move utasításban

source: Execute the selected program
hu: A kiválasztott program futtatása

source: Execute/stop
hu: Végrehajtás/állj

source: Exercises in the chapter:
hu: Feladatok a fejezetben:

source: Exercises\Programming exercises
hu: Feladatok\Programozási feladatok

source: Explode (\key action;)
hu: Robbantás (\key action;)

source: Explosive
hu: Robbanószer

source: Expression expected after =
hu: Az = után kifejezés következik

source: Extend shield (\key action;)
hu: Pajzs kinyitása (\key action;)

source: Eyeglasses:
hu: Szemüvegek:

source: Face type:
hu: Arc típus:

source: File not open
hu: A fájl nincs megnyitva

source: Filename:
hu: Fájlnév:

source: Film sequences\Films before and after the missions
hu: Film szekvenciák\Filmek a küldetések elején és végén

source: Finish
hu: Cél

source: Fixed mine
hu: Rögzített akna

source: Flat ground not large enough
hu: A lapos terület nem elég nagy

source: Fog\Fog
hu: Köd\Köd

source: Folder:
hu: Mappa:

source: Folder: %s
hu: Mappa: %s

source: Font size
hu: Betűméret

source: Forward
hu: Előre

source: Forward (\key up;)
hu: Előre (\key up;)

source: Forward\Moves forward
hu: Előre\Előre mozog

source: Found a site for a derrick
hu: Megvan a fúrótorony helye

source: Found a site for power station
hu: Megvan a töltőállomás helye

source: Found key A (site for derrick)
hu: Megvan az A pont (a fúrótorony helye)

source: Found key B (site for derrick)
hu: Megvan a B pont (fúrótorony helye)

source: Found key C (site for derrick)
hu: Megvan a C pont (fúrótorony helye)

source: Found key D (site for derrick)
hu: Megvan a D pont (fúrótorony helye)

source: Free game
hu: Korlátlan játék

source: Free game on this planet:
hu: Korlátlan játék ezen a bolygón:

source: Free game\Free game without a specific goal
hu: Korlátlan játék\Szabad játék megadott cél nélkül

source: Full screen\Full screen or window mode
hu: Teljes képernyő\Teljesképernyős vagy ablakos mód

source: Function already exists
hu: Már van ilyen függvény

source: Function name missing
hu: Hiányzik a függvény neve

source: Function needs return type "void"
hu: A függvénynek "void" visszatérési tipusúnak kell lennie

source: Game speed
hu: Játék sebessége

source: Game\Game settings
hu: Játék\A játék beállításai

source: Gantry crane
hu: Portáldaru

source: Generating
hu: Generálás

source: Gold Edition development by:
hu: A Gold Edition fejlesztője:

source: Goto: destination occupied
hu: Goto: A célhely foglalt

source: Goto: inaccessible destination
hu: Goto: A célhely nem hozzáférhető

source: Grab or drop (\key action;)
hu: Megragad vagy elenged (\key action;)

source: Graphics\Graphics settings
hu: Grafika\Grafika beállításai

source: Green
hu: Zöld

source: Green flag
hu: Zöld zászló

source: Ground not flat enough
hu: A felszín nem elég sima

source: Hair color:
hu: Hajszín:

source: Head\Face and hair
hu: Fej\Arc és haj

source: Help about selected object
hu: A kiválsztott tárgyhoz kapcsolódó segítség

source: Help balloons\Explain the function of the buttons
hu: Sugó buborékok\Magyarázat a gomb használatához

source: Hex value out of range
hu: A Hex érték kilóg az engedélyezett tartományból

source: Higher speed\Doubles speed
hu: Gyorsabb sebesség\Megduplázza a sebességet

source: Highest\Highest graphic quality (lowest frame rate)
hu: Legjobb\Legjobb minőségű grafika (leglassabb képfrissítés)

source: Home
hu: Otthon

source: Houston Mission Control
hu: Houstoni irányító központ

source: Illegal object
hu: Érvénytelen tárgy

source: Impossible under water
hu: Víz alatt nem lehet ilyet csinálni

source: Impossible when carrying an object
hu: Tárgy szállítása közben nem lehet ilyet csinálni

source: Impossible when flying
hu: Repülés közben nem lehet ilyet csinálni

source: Impossible when moving
hu: Mozgás közben nem lehet ilyet csinálni

source: Impossible when swimming
hu: Úszás közben nem lehet ilyet csinálni

source: Inappropriate bot
hu: Alkalmatlan bot

source: Inappropriate cell type
hu: Alkalmatlan cella típus

source: Inappropriate object
hu: Alkalmatlan tárgy

source: Inappropriate sample
hu: Alkalmatlan minta

source: Incorrect index type
hu: Nem megfelelő index típus

source: Infected by a virus; temporarily out of order
hu: Megfertőzte egy vírus; átmenetileg üzemen kívül

source: Information exchange post
hu: Információ csere oszlop

source: Information:
hu: Információ:

source: Instruction "break" outside a loop
hu: Hurkon kívül lévő "break" utasítás

source: Instruction "case" missing
hu: Hiányzik a "case" utasítás

source: Instruction "case" outside a block "switch"
hu: "switch" blokkon kívüli "case" utasítás

source: Instruction "else" without corresponding "if"
hu: A hozzátartozó "if" nélküli "else" utasítás

source: Instructions (\key help;)
hu: Útmutató \key help;)

source: Instructions after the final closing brace
hu: A végső záró kapocs utáni utasítások

source: Instructions for the mission (\key help;)
hu: Útmutató a küldetéshez (\key help;)

source: Instructions from Houston
hu: Utasítások Houston-tól

source: Instructions\Shows the instructions for the current mission
hu: Útmutató\Mutatja a jelenlegi küldetéshez tartozó utasításokat

source: Internal error - tell the developers
hu: Belső hiba - szólj a fejlesztőknek

source: Invalid universal character name
hu: Érvénytelen univerzális karakter név

source: Invert\Invert values on this axis
hu: Invertálás\Megfordítja az értkeket ezen a tengelyen

source: Jet temperature
hu: Sugárhajtómű hőmérséklet

source: Key A
hu: A gomb

source: Key B
hu: B gomb

source: Key C
hu: C gomb

source: Key D
hu: D gomb

source: Keyword "while" missing
hu: Hiányzik a "while" kulcsszó

source: Keyword help(\key cbot;)
hu: Kulcsszó alapú sugó (\key cbot;)

source: LOADING
hu: BETÖLTÉS

source: Legged builder
hu: Lábas építő

source: Legged grabber
hu: Lábas marok

source: Legged orga shooter
hu: Lábas orgavető

source: Legged shooter
hu: Lábas löveg

source: Legged sniffer
hu: Lábas szimat

source: Levels in this chapter:
hu: Pályák ebben a fejezetben:

source: Lightning conductor
hu: Villámhárító

source: List of objects
hu: Tárgyak listája

source: List of saved missions
hu: Mentett küldetések listája

source: Load a saved mission
hu: Mentett küldetés betöltése

source: Load\Load a saved mission
hu: Betöltés\Egy mentett küldetés betöltése

source: Load\Loads the selected mission
hu: Betöltés\A kiválasztott küldetés betöltése

source: Loading basic level settings
hu: Alap szint beállítások betöltése

source: Loading finished!
hu: A betöltés bejeződött!

source: Loading music
hu: Zene betöltése

source: Loading objects
hu: Tárgyak betöltése

source: Loading terrain
hu: Terep betöltése

source: Lower speed\Decrease speed by half
hu: Lassabb sebesség\Megfelezi a sebességet

source: Lowest\Minimum graphic quality (highest frame rate)
hu: Lerosszabb\A legalacsonyabb minőségű grafika (leggyorsabb képfrissítés)

source: Lunar Roving Vehicle
hu: Holdjáró

source: MSAA\Multisample anti-aliasing
hu: MSAA\Többmintás élsimítás

source: Maximize
hu: Kiterít

source: Minimize
hu: Elrejt

source: Mipmap level\Mipmap level
hu: Mipmap szint\Mipmap szint

source: Missing end quote
hu: Hiányzó záró idézőjel

source: Missing hex digits after escape sequence
hu: Hiányoznak a hex számjegyek a feloldó szekvencia után

source: Mission name
hu: Küldetés neve

source: Missions
hu: Küldetések

source: Missions on this planet:
hu: Küldetések ezen a bolygón:

source: Missions+
hu: Küldetések+

source: Missions\Select mission
hu: Küldetések\Válaszd ki a küldetést

source: Mods
hu: Modok

source: Mods:
hu: Modok:

source: Mods\Mod manager
hu: Modok\Mod kezelő

source: Mouse inversion X\Inversion of the scrolling direction on the X axis
hu: Egér fordított X\Megfordítja az X tengely mentén történő görgetés irányát

source: Mouse inversion Y\Inversion of the scrolling direction on the Y axis
hu: Egér fordított Y\Megfordítja az Y tengely mentén történő görgetés irányát

source: Move selected program down
hu: A kiválasztott programot lefelé mozgatja

source: Move selected program up
hu: A kiválaszottt programot felfelé mozgatja

source: Mute sounds in background\Mute all game sounds when the window is unfocused
hu: Némítsa a hangokat a háttérben\Minden játékhangot lenémít, amikor az ablak nincs fókuszban

source: Mute\No sound
hu: Némítás\Ne legyen hang

source: Name:
hu: Név:

source: Negative value rejected by "throw"
hu: A "throw" visszautasítja a negatív értéket

source: Nest
hu: Fészek

source: New
hu: Új

source: New ...
hu: Új ...

source: New Folder
hu: Új Mappa

source: New bot available
hu: Új bot elérhető

source: Next
hu: Következő

source: Next object\Selects the next object
hu: Következő tárgy\Kiválasztja a következő tárgyat

source: No
hu: Nem

source: No changes.
hu: Nincs változás.

source: No description.
hu: Nincs leírás.

source: No energy in the subsoil
hu: Nincs energia az altalajban

source: No flag nearby
hu: Nincs a közelben zászló

source: No function running
hu: Nem fut függvény

source: No function with this name accepts this kind of parameter
hu: Nincs ilyen nevű függvény ami ilyen jellegű paramétert fogad el

source: No function with this name accepts this number of parameters
hu: Nincs ilyen nevű függvény ami ennyi paramétert fogad el

source: No information exchange post within range
hu: Nincs a közelben informácó csere oszlop

source: No more energy
hu: Kifogyott az energia

source: No ore in the subsoil
hu: Nincs érc az altalajban

source: No power cell
hu: Nincs benne energiacella

source: No titanium
hu: Nincs titánium

source: No titanium around
hu: Nincs a közelben titánium

source: No titanium ore to convert
hu: Nincs konvertálható titánium érc

source: No titanium to transform
hu: Nincs átalakítható titánum

source: No uranium to transform
hu: Nincs átalakíható uránium

source: No userlevels installed!
hu: Nincs felhasználói pálya telepítve!

source: Non-void function needs "return;"
hu: Nem void függvénybe kell "return;"

source: Normal size
hu: Normál méret

source: Normal\Normal graphic quality
hu: Normál\Normál grafikus minőség

source: Normal\Normal sound volume
hu: Normál\Normál hangerő

source: Not enough energy
hu: Nincs elég energia

source: Not enough energy yet
hu: Még nincs elég energia

source: Not found anything to destroy
hu: Nem találtam semmi elpuszthatót

source: Nothing to analyze
hu: Nincs mit elemezni

source: Nothing to drop
hu: Nincs mit ledobni

source: Nothing to grab
hu: Nincs mit megragadni

source: Nothing to recycle
hu: Nincs mint újrahasznosítani

source: Nuclear power cell
hu: Nukláris energiacella

source: Nuclear power cell available
hu: Nukleáris energiacella elérhető

source: Nuclear power station
hu: Nukleáris töltőállomás

source: Number missing
hu: Hiányzó szám

source: Number of insects detected
hu: Több rovart észleltünk

source: Number of particles\Explosions, dust, reflections, etc.
hu: Részecskék száma\Robbanások, por, tükröződések, stb.

source: OK\Choose the selected player
hu: OK\A kijelölt játékos kiválasztása

source: OK\Close program editor and return to game
hu: OK\A program szerkesztő bezárása és visszatérés a játékhoz

source: Object too close
hu: A tárgy túl közel van

source: Octal value out of range
hu: Az oktális érték kilág az engedélyezett tartományból

source: One step
hu: Egy lépés

source: Open
hu: Megnyitás

source: Open (Ctrl+O)
hu: Megnyitás (Ctrl+O)

source: Open Directory\Open the mods directory
hu: Mappa megnyitása\Megnyitja a modok mappát
