Repository: muudry/colobot-data
Catalog: */levels/plus/chapter001/level001/po/*.po
Languages: hu

source: Equip your spaceship and get ready for takeoff.
hu: Szereld fel űrhajódat, és készülj fel a felszállásra.

source: Procedure
hu: Eljárás

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
hu: A <format key><key help/></format> segítségével ezeket az utasításokat bármikor visszanézheted a személyi SatCom-odon <button 63/>.

source: Plan B
hu: B-terv

source: From the NASA Training Center
hu: A NASA kiképzőközponjától

source: We are pleased to inform you that you have been selected for the space exploration mission Colobot.
hu: Örömmel értesítünk, hogy beválogattunk a Colobot űrfelderítő programba.

source: Your psychological profile has been established as more than 98.84% favorable, and your aptitude during the extensive testing period was undeniable. The detailed results are at your disposal in the central computer under the registration number that was assigned to you.
hu: A pszichológiai profilod több mint 98.84%-ban kedvező képet alakított ki rólad, és a rátermettséged a kiterjedt tesztelési időszak alatt tagadhatatlan volt. A részletes eredmények a központi számítógépben a regisztrációs számod alatt állnak a rendelkezésedre.

source: Please report to the <a object|Huston>Houston Mission Control</a> for further directives about your forthcoming mission.
hu: Kérjük jelentkezz a <a object|Huston>Houstoni Irányító központban</a> a közelgő küldetésedre vonatkozó további utasítások végett.

source: From Houston Mission Control
hu: A Houstoni irányító központtól

source: As you know, Earth is heading towards imminent disaster, due to increasing atmospheric pollution.
hu: Mint tudod, a föld a növekvő légszennyezés miatt küszöbön álló katasztrófa felé halad.

source: <a object|human>Your</a> mission consists of exploring neighboring galaxies with the hopes of finding a planet that will be suitable to human needs and possibly serve as a shelter for mankind. You will be on your own for the entire mission but your spaceship will be carrying a few bots along.
hu: A <a object|human>te</a> küldetésed a szomszédos galaxisok feltárása, annak reményében, hogy találunk egy, az emberiség igényeinek megfelelő bolygót, ami az emberiség menedékéül szolgálhat. A teljes küldetés alatt magadra leszel utalva, de az űrhajód magával visz néhány botot.

source: Seven months ago an expedition composed entirely of robots was sent across the cosmos with the same objective. It encountered a fair share of obstacles along the way, apparently landing on planets that were unsuitable for colonization, even possibly outright hostile. Very recently all communications were terminated.
hu: Hét hónappal ezelőtt egy kizárólag robotokból álló expedíció indult a kozmoszba ugyanezzel a feladattal. Útja során számos akadályba ütközött, és úgy tűnik olyan bolygókat talált amelyek alkalmatlanok voltak a gyarmatosításra, sőt néhol kifejezetten ellenségesek is. Nemrég minden kommunikáció megszakadt velük.

source: The reasons for the mission's failure are unclear at this date, mainly because of recurrent transmission problems. It is our hope that you will be able to use some of the data it gathered to your advantage.
hu: A küldetés kudarcának okai egyelőre tisztázatlanok, elsősorban a gyakori jelátviteli problémák miatt. Reméljük, hogy az összegyűjtött adatok egy részét majd hasznosítani tudod.

source: The last drill left for you to perform before embarking on your journey is to equip your spaceship with its <a object|bbox>black box</a>. A bot tasked with bringing it to the spaceship awaits your signal. You need to build an <a object|exchange>information exchange post</a> near a blue <a object|flag>flag</a> and <a cbot|send>send</a> an information, a <a object|botbc>tracked builder</a> may prove useful for this task.
hu: Az utolsó gyakorlat, amelyet az utazás megkezdése előtt végre kell hajtanod, az az, hogy felszerelje űrhajóját <a object|bbox>fekete doboz</a>ával. Egy bot, amelynek feladata annak az űrhajóhoz juttatása, várja a jeledet. Egy <a object|exchange>információcsere oszlopot</a> kell építened egy kék <a object|flag>zászló</a> közelében, és <a cbot|send>küldened</a> egy információt, egy <a object|botbc>lánctalpas építő</a> hasznosnak bizonyulhat ehhez a feladathoz.

source: Unfortunately your <a object|factory>bot factory</a> hasn't yet got the capacity to assemble this type of bot. You need to request your <a object|research>research center</a> to come up with a blueprint for this particular apparatus.
hu: Sajnos a <a object|factory>botgyárad</a> még nem rendelkezik az ilyen típusú botok összeállításához szükséges kapacitással. Ezért kérned kell a <a object|research>kutatóközpontot</a>, hogy dolgozzon ki egy tervrajzot ehhez a konkrét berendezéshez.

source: Perform the necessary <a cbot|researches>research programs</a>.
hu: Futtasd le a szükséges <a cbot|researches>kutatási programokat</a>.

source: Drop a <a object|titan>titanium cube</a> in the center of the <a object|factory>bot factory</a> and build a <a object|botbc>tracked builder</a>.
hu: Dobj egy <a object|titan>titánium kockát</a> a <a object|factory>botgyár</a> közepére, és gyárts egy <a object|botgc>lánctalpas marok</a> botot.

source: Reach the top of the southwest-oriented mountain and build an <a object|exchange>exchange post</a> near a blue <a object|flag>flag</a>.
hu: Juss fel a délnyugati fekvésű hegy csúcsára, és építs egy <a object|exchange>csereoszlopot</a> egy kék <a object|flag>zászló</a> közelében.

source: <a cbot|send>Send</a> an <a cbot|string>empty information</a> to instruct the carrier to bring the black box back aboard your spaceship.
hu: <a cbot|send>Küldj</a> egy <a cbot|string>üres információt</a>, hogy utasítsd a szállítót, hogy vigye vissza a fekete dobozt az űrhajó fedélzetére.

source: Don't forget to take your <a object|botgr>grabber</a> and <a object|botbc>builder</a> along.
hu: Ne felejtsd el magaddal vinni a <a object|botgr>markot</a> és az <a object|botbc>építőt</a>.

source: Climb aboard the <a object|base>spaceship</a> and take off <button 28/>.
hu: Mássz az <a object|base>űrhajó</a> fedélzetőre és szállj fel <button 28/>.

source: See also
hu: Lásd még

source: <a command>Controls</a>
hu: <a command>Irányítás</a>
