Repository: muudry/colobot-data
Catalog: */levels/missions/chapter001/level003/po/*.po
Languages: hu

source: Departure
hu: Indulás

source: Equip your spaceship and get ready for takeoff.
hu: Szereld fel űrhajódat, és készülj fel a felszállásra.

source: From Mission Control
hu: Az irányító központtól

source: Your <a object|base>spaceship</a> is now standing on the launching pad, ready for takeoff.
hu: Az <a object|base>űrhajód</a> már az indítóálláson áll, felszállásra készen.

source: The last drill left for <a object|human>you</a> to perform before embarking on your journey is to equip your spaceship with its <a object|bbox>black box</a>. The only way to reach the <a object|bbox>black box</a> is by a steep path that can only be climbed by a <a object|botgc>tracked grabber</a> which you need to build.
hu: Az utolsó gyakorlat, amelyet <a object|human>neked</a> végre kell hajtanod, mielőtt elindulsz az utazásra, az az, hogy felszereled az űrhajódat a <a object|bbox>fekete dobozával</a>. A <a object|bbox>fekete dobozhoz</a> csak egy meredek ösvényen lehet eljutni, amelyen csak egy <a object|botgc>lánctalpas marok</a> tud felmenni, amit meg kell építened.

source: Unfortunately your <a object|factory>bot factory</a> hasn't yet got the capacity to assemble this type of bot. You need to request your <a object|research>research center</a> to come up with a blueprint for this particular propeller.
hu: Sajnos a <a object|factory>botgyárad</a> még nem rendelkezik az ilyen típusú botok összeállításához szükséges kapacitással. Ezért kérned kell a <a object|research>kutatóközpontot</a>, hogy dolgozzon ki egy tervrajzot ehhez a fajta meghajtáshoz.

source: Procedure
hu: Eljárás

source: Power the research center with one of the green <a object|power>power cells</a>.
hu: Lásd el a kutatóközpont árammal az egyik zöld <a object|power>energiacella</a> segítségével.

source: Click on the <tracked bot research program> button <button 64/>.
hu: Kattints a <lánctalpas meghajtás kifejlesztése> gombra <button 64/>.

source: Drop a <a object|titan>titanium cube</a> in the center of the <a object|factory>bot factory</a> and build a <a object|botgc>tracked grabber</a>.
hu: Dobj egy <a object|titan>titán kockát</a> a <a object|factory>botgyár</a> közepére, és gyárts egy <a object|botgc>lánctalpas marok</a> botot.

source: Power and radio-control the <a object|botgc>tracked grabber</a> to the top of the southwest-oriented mountain.
hu: Lásd el árammal, és rádió-táviránítsd a <a object|botgc>lánctalpas marok botot</a> a délnyugati fekvésű hegy tetejére.

source: Bring the black box back aboard your spaceship.
hu: Vidd a fekete dobozt az úrhajód fedélzetére.

source: Don't forget to take the <a object|botgr>wheeled grabber</a> along. These bots may prove very useful in the future.
hu: Ne felejtsd felpakolni a <a object|botgr>kerekes marok</a> botot is. Ezek a botok hasznosnak lehetnek a jövőben.

source: Climb aboard the <a object|base>spaceship</a>.
hu: Mássz fel az <a object|base>űrhajó</a> fedélzetére.

source: Select the <a object|base>spaceship</a> and take off <button 28/>.
hu: Válaszd ki az <a object|base>űrhajót</a> és szállj fel <button 28/>.

source: Please note: To work more efficiently, you can use the <a object|botgr>wheeled grabber</a>.
hu: Megjegyzés: Hatékonyabb ha <a object|botgr>kerekes marok</a> botot használod.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
hu: <format key><key help/></format> megnyomásával bármikor visszanézheted ezeket az utasításokat a személyi SatCom-odon <button 63/>.

source: See also
hu: Lásd még

source: <a command>Controls</a>
hu: <a command>Irányítás</a>

source: Walkthrough
hu: Megoldás

source: Before taking off, you need to bring the following aboard your spaceship:
hu: Felszállás előtt a következőket kell az űrhajó fedélzetére vinned:

source: <a object|bbox>Black box</a>.
hu: <a object|bbox>Fekete doboz</a>.

source: <a object|botgr>Wheeled</a> and <a object|botgc>tracked</a> grabbers.
hu: <a object|botgr>Kerekes</a> és <a object|botgc>lánctalpas</a> marok.

source: <a object|human>Yourself</a>.
hu: <a object|human>Te magad</a>.

source: Power the <a object|research>research center</a> with one of the green <a object|power>power cells</a>.
hu: Lásd el árammal a <a object|research>kutató központot</a> az egyik zöld <a object|power>energia cella</a> felhasználásával.

source: Activate the <a object|research>research center</a> then click on the <button 64/> <tracked bot research program> button.
hu: Aktiváld a <a object|research>kutató központot</a> aztán kattints a <button 64/> <lánctalpas bot kutatás> gombra.

source: Place a <a object|titan>titanium cube</a> inside the <a object|factory>bot factory</a>.
hu: Tegyél egy <a object|titan>titánium kockát</a> a <a object|factory>bot gyár</a> belsejébe.

source: Step back out and activate the <a object|factory>bot factory</a>.
hu: Lépj hátra és aktiváld a <a object|factory>bot gyárat</a>.

source: Click on the <button 138/> <build a <a object|botgc>tracked grabber</a>> button.
hu: Kattints a <button 138/> <a object|botgc>lánctalpas marok</a> építése gombra.

source: Power the <a object|botgc>tracked grabber</a> with a brand new <a object|power>power cell</a>.
hu: Lásd el árammal a <a object|botgc>lánctalpas marok</a> botot egy vadi új <a object|power>energia cellával</a>.

source: Radio-control the <a object|botgc>tracked grabber</a> to the top of the mountain in the south-west.
hu: Távirányítsd a <a object|botgc>lánctalpas marok</a> botot a délnyugati hegy csúcsára.

source: Bring the <a object|bbox>black box</a> back aboard your <a object|base>spaceship</a>.
hu: Hozd vissza a <a object|bbox>fekete dobozt</a> az <a object|base>űrhajód</a> fedélzetére.

source: Radio-control both the <a object|botgc>tracked</a> and the <a object|botgr>wheeled</a> grabbers onto the platform.
hu: Távirányítsd mind a <a object|botgc>lánctalpas</a> és a <a object|botgr>kerekes</a> marok botot az emelvényre.

source: 10) Climb aboard the <a object|base>spaceship</a> yourself. 11) Take off!
hu: 10) Mássz fel te is az <a object|base>űrhajóra</a>. 11) Szállj fel!

source: In order to take off, select the <a object|base>spaceship</a>, provided that it is visible, by clicking on it. If it is not visible, you need to click one of the buttons in the upper left corner of your screen. The blue triangle <button 130/> allows you to alternate between symbols for bots and symbols for buildings. Click once to shift to the <buildings> list. A <button 171/> <spaceship> symbol will now appear. Click on the button to select it.
hu: A felszálláshoz válaszd ki <a object|base>űrhajót</a>, amikor az látható, úgy hogy rákattintasz. Ha nem látható, kattints a képernyő bal felső sarkában található gombok egyikére. A kék háromszög <button 130/> lehetővé teszi a robotok és az épületek szimbólumai közti váltogatását. Kattints egyszer az <épületek> listára való váltáshoz. Ekkor megjelenik egy <button 171/> <űrhajó> szimbólum. Kattints a gombra a kiválasztásához.

source: Once the spaceship is selected, click on the larger <button 28/> <takeoff> button in the lower center of your screen. If the objects mentioned above as well as yourself are indeed standing on deck, takeoff will take place.
hu: Miután kiválasztottad az űrhajót, kattints a nagyobb <button 28/> <felszállás> gombra a képernyő alsó közepén. Ha a fent említett tárgyak, valamint te magad is valóban a fedélzeten áll, a felszállás megtörténik.

source: No object or bot should hinder the closing of the eight large panel doors.
hu: Semmilyen tárgy vagy bot nem akadályozza meg a nyolc nagy panelajtó bezárását.

source: Here is a detailed breakdown of the operations:
hu: Íme a műveletek részletes leírása:
