Repository: muudry/colobot-data
Catalog: levels/exercises/chapter001/level002/po/*.po
Languages: hu

source: Power Cell 1
hu: Energiacella 1

source: Instruct a bot to change the power cell of a nearby winged shooter.
hu: Utasíts egy botot, hogy cserélje ki egy közeli szárnyas lövész energiacelláját.

source: Spider2
hu: Pók2

source: Objective
hu: Célkitűzés

source: Program the <a object|botgr>grabber bot</a> to change the <a object|power>power cell</a> of the <a object|botfj>winged shooter</a>. The winged shooter can then shoot the spiders.
hu: Programozd be <a object|botgr>marok bot</a>ot, hogy cserélje ki a <a object|botfj>szárnyas löveg</a> <a object|power>energia cellá</a>ját. A szárnyas löveg így már le tudja lőni a pókokat.

source: Procedure
hu: Eljárás

source: Program the <a object|botgr>grabber bot</a>.
hu: Programozd be a <a object|botgr>marok bot</a>ot.

source: Execute the program with the arrow button <button 21/>.
hu: Futtasd a programot a nyíl gombbal <button 21/>.

source: The <a object|botfj>winged shooter</a> is already programmed, it will do its job as soon as it has got a new power cell.
hu: A <a object|botfj>szárnyas löveg</a> már be van programozva, végre is hajtja a feladatát, mihelyst új energiacellát kap.

source: You will need the following instructions:
hu: A következő utasításokra lesz szükség:

source: <n/>Takes whatever there is in front of the bot.
hu: <n/>Megfogja ami a bot előtt van.

source: <n/>Drops whatever the bot is carrying in front.
hu: <n/>Leteszi azt amit a botnál van, maga elé.

source: <n/>We have seen this instruction already in the previous exercise: it performs a rotation of a certain angle, given in degrees.
hu: <n/>Ezt az utasítást már az előző gyakorlatban is láttuk: egy bizonyos szögű elfordulást hajt végre, fokban megadva.

source: pick up the empty power cell with <c/>grab();<n/>
hu: ragadd meg az energia cellát: <c/>grab();<n/>

source: turn left 90 degrees (quarter turn) with <code>turn(90)</code>
hu: fordulj balra 90 fogban (negyed fordulat): <code>turn(90)</code>

source: drop the empty cell with <c/>drop();<n/>
hu: Tedd le az üres cellát: <c/>drop();<n/>

source: etc.
hu: stb.

source: It is up to you now to write the rest of the program!
hu: A te feladatod megírni a program többi részét!

source: If you have got a problem, you can always look at the solution: select the <code>Solution</code> program, and click the braces button <button 22/>.
hu: Ha elakadsz, bármikor megnézheted a megoldást: válaszd ki a <code>Megoldás</code> programot, és kattints a kapcsos gombra <button 22/>.

source: Remarks
hu: Megjegyzések

source: Be careful to write the instructions precisely, respecting lower and upper case letters.
hu: Figyelj oda, hogy az utasításokat pontosan másold, megtartva a kis- és nagybetűket.

source: Always write one instruction per line, finishing each line with a semicolon.
hu: Egy sorba mindig egy utasítás kerül, minden sort egy pontosvesszővel zárunk.

source: In case your program does not do exactly what you wanted, you can put the bot back at the starting point with the button <button 59/>. You can also start over again from the beginning (hit the key "Esc", the click "Restart"). The program you have written will not be lost.
hu: Abban az esetben, ha a programod nem azt csinálja, amit akartál, a <button 59/> gombbal visszahelyezheted a botot a kiindulási pontra. Az egészet is elölről is kezdheted (nyomd meg az "Esc" billentyűt, majd kattints az "Újraindítás" gombra). Az általad írt program így sem vész el.

source: <format key><key help/></format> allows you to review these instructions at all times.
hu: A(z) <format key><key help/></format> gombbal bármikor visszanézheted ezeket az útmutatásokat.

source: Let us see the beginning of the program:
hu: Lássuk a program elejét:
