Repository: muudry/colobot-data
Catalog: */levels/exercises/chapter001/level007/po/*.po
Languages: hu

source: Spiders 3
hu: Pókok 3

source: Learn to move the bot so that no spider can escape.
hu: Tanuld meg hogyan kell mozgatni a botot, hogy egy pók se szökhessen el.

source: Spider3
hu: Pók3

source: Objective
hu: Célkitűzés

source: Move towards the spiders that are out of shooting range.
hu: A lőtávon kívüli pókokhoz oda kell menned.

source: The program will look like the previous one, but before you shoot, use the instruction <c/><a cbot|move>move</a>();<n/> in order to get close enough.
hu: Ez a program olyan lesz mint az előző, de mielőtt lősz, használd a <c/><a cbot|move>move</a>();<n/> utasítást, hogy kellő közelbe menj.

source: The question is just how many meters the bot must move. The instruction <code><a cbot|dist>distance</a>( , )</code> calculates the distance between two positions. In this case, we need to know the distance between the bot and the target. The position of the target is given by <code>item.position</code>, the position of the bot is given by <code>position</code>. The distance between the bot and the target is given by <code><a cbot|dist>distance</a>(position, item.position)</code>. The range of a fireball cannon is 40 meters. In order to get close enough, the bot must move forward <code><a cbot|dist>distance</a>(position, item.position)-40</code> meters. The following line will do this:
hu: A kérdés csak az, hogy hány métert kell megtennie a botnak. A <code><a cbot|dist>distance</a>( , )</code> utasítás kiszámítja a két pozíció közötti távolságot. Ebben az esetben a bot és a célpont közi távolságot kell megtudnunk. A célpont helyzetét a <code>item.position</code> adja meg, a bot helyzetét pedig a <code>position</code> adja meg. Tehát a bot és a cél közötti távolságot a <code><a cbot|dist>distance</a>(position, item.position)</code> állapítja meg. A tűzgolyó ágyú lőtávolsága 40 méter. Ahhoz hogy pont elég közel kerüljön, a botnak <code><a cbot|dist>distance</a>(position, item.position)-40</code> métert kell előre haladnia. A következő sor éppen ezt teszi:

source: <a cbot|move>move</a>(<a cbot|dist>distance</a>(position, item.position)-40);
hu: <code><a cbot|dist>distance</a>(position, item.position)-40</code>

source: Just insert this line into the program before the instruction <c/>fire(1);<n/>, and the bot will start to move.
hu: Nem kell más tenned, mint beszúrni ezt a sort a <c/>fire(1);<n/> utasítás elé, és bot máris mozogni fog.

source: See also
hu: Lásd még

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
hu: <a cbot>Programozás</a>, <a cbot|type>típusok</a> és <a cbot|category>kategóriák</a>.
