Repository: muudry/colobot-data
Catalog: levels/exercises/po/*.po
Languages: hu

source: Spiders and supply
hu: Pókok és ellátmány

source: Supply problems and fight against motionless targets
hu: Ellátási problémák és harc mozdulatlan célpontok ellen

source: Ants and wasps
hu: Hangyák és darazsak

source: Fight against moving targets
hu: Harc mozgó célpontok ellen

source: Fundamentals
hu: Alapok

source: Motors
hu: Motorok

source: Mover
hu: Mozgató

source: Move
hu: Mozgás

source: Functions
hu: Függvények

source: Classes
hu: Osztályok
