Repository: muudry/colobot-data
Catalog: levels/exercises/chapter001/level006/po/*.po
Languages: hu

source: Spiders 2
hu: Pókok 2

source: Use the radar to find and kill all spiders.
hu: Használd a radart: mérd be és lődd le az összes pókot.

source: Spider2
hu: Pók2

source: Objective
hu: Feladat

source: Kill several spiders whose exact location we do not know. Use the bot's radar to find them.
hu: Ölj meg több pókot, melyeknek pontos helyét nem tudjuk. Használd a bot radarját, hogy megtaláld őket.

source: Find the closest spider with the instruction <c/><a cbot|radar>radar</a>(AlienSpider);<n/>, as we did it in the previous exercises with titanium ore and power cells. But do not go to the position of the spider, the bot would be destroyed before arriving there. Just turn towards the spider. The instruction <code><a cbot|direct>direction</a>(item.position)</code> calculates the angle of the rotation that the robot must perform in order to aim at the spider. In order to actually aim at the spider, just write:
hu: Keresd meg a legközelebbi pókot a <c/><a cbot|radar>radar</a>(AlienSpider);<n/> utasítással, úgy ahogy az előző gyakorlatokban a titánium érc és az energia cellákkal tettük. De ne menj a pók pozíciójára, mert a bot megsemmisül, még mielőtt odaérne. Csak fordulj a pók felé. A <code><a cbot|direct>direction</a>(item.position)</code> utasítás kiszámítja a forgatás szögét, amelyet a robotnak végre kell hajtania, ahhoz hogy a pókra célozzon. Tehát ahhoz hogy ténylegesen becélozd a pókot, elég annyit írnod:

source: Notice the two closing brackets at the end of the line, before the semicolon. There are two open brackets, so there must be two closing brackets.
hu: Vedd észre, hogy két záró zárójel van a sor végén, a pontosvessző előtt. Mivel két nyitott zárójel van, ezért két záró zárójelnek is kell lennie.

source: Then shoot with the instruction <c/><a cbot|fire>fire</a>(1);<n/>.
hu: Ezután tüzelj a <c/><a cbot|fire>fire</a>(1);<n/> utasítással.

source: Here also, you can use a loop with <code><a cbot|while>while</a> (true)</code> in order not to have to execute the program again for every spider, as we did in the last exercise.
hu: Itt is használsz egy hurkot a <code><a cbot|while>while</a>(true)</code> segítsével, és akkor nem kell minden egyes pókra külön lefuttatni a programot, az előző gyakorlathoz hasonlóan.

source: See also
hu: Lásd még

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
hu: <a cbot>Programozás</a>, <a cbot|type>típusok</a> és <a cbot|category>kategóriák</a>.
