Repository: muudry/colobot-data
Catalog: help/object/po/*.po
Languages: hu

source: The growth of these large blue crystals signifies the presence of <a object|titanore>titanium ore</a> in the subsoil. Use a <a object|botsr>sniffer</a> in order to confirm that.
hu: Ezeknek a nagy kék kristályoknak az elszaporodása <a object|titanore>titánium érc</a> jelenlétére utal az altalajban. Használd <a object|botsr>szimat botot</a> ennek megerősítésére.

source: Gravi-plant
hu: Gravi-növény

source: Gravi-plants generate a 25-meter radius green energy field that pushes <a object|human>you</a> and your bots downwards, making flight impossible.
hu: A gravi-növények 25 méter sugarú zöld energiamezőt hoznak létre, amely lehúzza a robotjaidat és <a object|human>téged</a>, lehetetlenné téve ezáltal a repülést.

source: Green Mushroom
hu: Zöld Gomba

source: These poisonous green mushrooms spew tiny corrosive balls upon being approached. It is recommended not to get any closer than 12 meters unless protected by a <a object|botshld>shielder</a>.
hu: Ezek a mérgező zöld gombák apró maró golyókat lövellnek ki, amikor megközelítik őket. Javasoljuk, hogy ne menj 12 méternél közelebb, hacsak nem véd <a object|botshld>pajzs</a>.
