Repository: muudry/colobot-data
Catalog: help/object/po/*.po
Languages: hu

source: Ant
hu: Hangya

source: Ants shoot tiny corrosive balls that eventually gnaw into the protective shielding of bots and buildings, causing them to explode.
hu: A hangyák apró, maró hatású golyókat lövöldöznek, amelyek széteszik a botok és épületek védőburkolatát, így azok végül felrobbannak.

source: <a object|human>You</a> can resist their attack much longer than most buildings and bots, and your protective shield will be restored as your wounds heal. However, if you stay too long in their range or if there are too many of them, your life is in great danger.
hu: <a object|human>Te</a> sokkal tovább tudsz ellenállni a támadásuknak, mint a legtöbb épület és bot. A te védelmed helyreáll, ahogy a sebeid begyógyulnak. Ha azonban túl sokáig tartózkodsz a hatókörükben, vagy ha túl sokan vannak, az életed nagy veszélyben forog.

source: Object <a cbot|category>Category</a>
hu: Objektum <a cbot|category>Kategória</a>

source: See also
hu: Lásd még

source: <a cbot>CBOT Language</a>, <a cbot|type>Variables</a> and <a cbot|category>Categories</a>.
hu: <a cbot>CBOT Nyelv</a>, <a cbot|type>Változók</a> és <a cbot|category>Kategóriák</a>.

source: Nuclear Power Cell
hu: Nukleáris energia cella

source: A nuclear power cell supplies the bots and some buildings with energy. Its capacity is 100 times that of a <a object|power>regular power cell</a>.
hu: A nukleáris energia cella energiával látja el a robotokat és néhány épületet. Kapacitása 100-szor nagyobb, mint egy <a object|power>normál energiacelláé</a>.

source: Nuclear power cells cannot be recharged or recycled. A <a object|nuclear>nuclear plant</a> and some <a object|uranore>uranium ore</a> is needed to produce a new and fully charged nuclear power cell.
hu: Az nukleáris cellákat nem lehet újratölteni vagy újrahasznosítani. Egy <a object|atom>atomerőmű</a> és egy <a object|uranore>uránérc</a> szükséges egy új, teljesen feltöltött nukleáris cella előállításához.

source: Transport
hu: Szállíthatja

source: All <a object|botgr>grabbers</a> and the <a object|human>astronaut</a>.
hu: Bármelyik <a object|botgr>marok</a> valamint az <a object|human>asztronauta</a>.

source: Barrier
hu: Akadály

source: The barrier is nothing more than an obstacle used in the exercises.
hu: Az akadály nem több, mint egy korlát amit a gyakorlatokon használunk.

source: <button 171/> Spaceship
hu: <button 171/> Űrhajó

source: <a object|human>Your</a> means of transportation from one planet to the next, the only way to travel safely across the cosmos and accomplish your missions.
hu: Ez a <a object|human>te</a> közlekedési eszközöd egyik bolygóról a másikra, ez az egyetlen biztonságos módja annak, hogy bejárd kozmoszt és teljesítsd küldetéseid.

source: In addition to yourself, the spaceship can carry bots and raw materials. Whenever a mission is completed, you must select the spaceship, then click on the <takeoff> command <button 28/>.
hu: Az űrhajó rajtad kívül botokat és nyersanyagokat is szállíthat. Amikor egy küldetés befejeződött, ki kell választanod az űrhajót, majd kattints a <takeoff> parancsra <button 28/>.

source: Black Box
hu: Fekete Doboz

source: A black box is actually orange so as to be easier to identify and locate. Each <a object|base>spaceship</a> is equipped with a black box that records and stores information about the flight.
hu: A fekete doboz valójában narancssárga, így könnyebben észrevehető és azonosítható. Minden <a object|base>űrhajó</a> fel van szerelve egy fekete dobozzal, amely rögzíti és tárolja a repüléssel kapcsolatos információkat.

source: A black box can also be used to leave important information. On every planet the first expedition has left a black box containing the coordinates of the planet it was heading towards next.
hu: Egy fekete doboz fontos információk meghagyására is használható. Az első expedíció minden bolygón hagyott egy fekete dobozt, amely a következő bolygó koordinátáit tartalmazza.

source: Organic Matter
hu: Szerves anyag

source: The organic matter is the insects' secretion. <a object|wasp>Wasps</a> often use balls of organic matter to bombard you. You should perhaps try to get hold of some since it could allow you, given the necessary <a object|labo>analysis</a>, to discover new and strange technologies that will improve the efficiency of your bots.
hu: A szerves anyag a rovarok váladéka. A <a object|wasp>darazsak</a> többnyire szerves anyagból álló golyókkal bombáznak téged. Ha megpróbálnál szerezni belőle valamennyit, az lehetővé tenné, hogy a szükséges <a object|labo>elemzés</a> alapján új és furcsa technológiákat fejlesszünk ki, amik javítják a botjaid hatékonyságát.

source: <button 174/> Power Captor
hu: <button 174/> Energia elnyelő

source: The power captor acts as both a lightning conductor and a power converter. It offers protection within a radius of 50 meters against the perilous lightning bolts of magnetic storms. Additionally, when the captor is hit by lightning, all bots and <a object|power>power cells</a> placed underneath, with the exception of the <a object|atomic>nuclear power cells</a>, are recharged.
hu: Az energia elnyelő villámhárítóként és áramátalakítóként is szolgál. 50 méteres körzetben védelmet nyújt a mágneses viharok veszélyes villámai ellen. Ezenkívül, ha az elnyelőt villámcsapás éri, a <a object|atomi>nukleáris cellák</a> kivételével az alatta elhelyezett összes bot és <a object|power>energiacella</a> újratöltődik.

source: To visualize the zone shielded by a power captor, select it then hit the <range> button <button 41/>. Red dots outline the circular zone for 20 seconds.
hu: Az energia elnyelő által lefedett terület megjelenítéséhez válaszd ki azt, majd nyomd meg a <tartomány> gombot <gomb 41/>. 20 másodpercig piros pöttyök fogják körülvenni a kör alakú területet.

source: In the vastness of space, few planets suffer from magnetic storms. Among the ones you'll be visiting, only Orpheon is subject to this phenomenon.
hu: A hatalmas űrben néhány bolygót mágneses viharok gyötörnek. Azok közül, amelyeket meglátogatsz, csak az Orfeon van kitéve ennek a jelenségnek.

source: Note that your <a object|base>spaceship</a> can also act as a lightning conductor. However it will not recharge power cells.
hu: Vegye figyelembe, hogy az <a object|base>űrhajód</a> villámhárítóként is működhet. Azonban nem tölti újra a tápcellákat.

source: Requirements for building
hu: Az építéshez szükséges

source: Any flat surface of at least 10 meters wide.
hu: Bármilyen legalább 10 méter széles sík felület.

source: Power source
hu: Energia forrás

source: Lightning bolts.
hu: Villámcsapások.

source: Duration of operation
hu: A működés időtartama

source: 1 second.
hu: 1 másodperc.

source: <button 162/> Converter
hu: <button 162/> Konverter

source: This building was designed to convert chunks of <a object|titanore>titanium ore</a> into usable <a object|titan>titanium cubes</a>. All <a object|human>you</a> need to do is place a chunk at the center of the platform and step back. The converter takes care of the rest.
hu: Ezt az épületet arra tervezték, hogy <a object|titanore>titánérc</a> darabokat használható <a object|titan>titánium kockák</a>ká alakítsák. <a object|human>Neked</a> Mindössze annyit a dolgod, hogy egy darabot teszel az emelvény közepére, és hátralépsz. A többiről az átalakító gondoskodik.

source: Any flat surface of at least 6 meters wide.
hu: Bármilyen legalább 6 méter széles sík felület.

source: Input
hu: Bemenet

source: Titanium ore.
hu: Titánium érc.

source: Output
hu: Kimenet

source: Titanium.
hu: Titánium.

source: None.
hu: Nincs.

source: 15 seconds.
hu: 15 másodperc.

source: <button 161/> Derrick
hu: <button 161/> Fúrótorony

source: The derrick is intended for the extraction of raw materials.
hu: A fúrótorony nyersanyagok kitermelésére szolgál.

source: In order to determine the best site on which to erect a derrick, a <a object|botsr>sniffer</a> should be used to prospect the subsoil. The marks it lays down provide information about the specifics of what the derrick will be able to extract:
hu: A fúrótorony felállítására legmegfelelőbb felkutatása úgy történik, hogy egy <a object|botsr>szimat</a> segítségével meg kell szondázni az altalajt. A lefektetett jelek információt adnak arról, hogy mit tud kivonni a talajból a fúrótorony:

source: a <a object|stonspot>red cross</a> -> <a object|titanore>titanium ore</a>.
hu: a <a object|stonspot>vörös kereszt</a> -> <a object|titanore>titánium érc</a>.

source: a <a object|uranspot>yellow circle</a> -> <a object|uranore>uranium ore</a>.
hu: a <a object|uranspot>sárga karika</a> -> <a object|uranore>uránium érc</a>.

source: Any flat and geologically adequate surface of at least 2.5 meters wide.
hu: Bármilyen sík és földtanilag megfelelő, legalább 2,5 méter széles felület.

source: Titanium or uranium ore in the subsoil.
hu: Titánium- vagy uránérc az altalajban.

source: Chunks of titanium or uranium ore.
hu: Titán- vagy uránérc darabkák.

source: 10 seconds for titanium and 30 for uranium.
hu: 10 másodperc a titánium esetén, és 30 másodperc az uránnál.

source: Alien Egg
hu: Idegen tojás

source: The alien eggs are laid by the <a object|mother>Alien Queen</a>. After a short time, they will hatch and an <a object|ant>ant</a>, a <a object|wasp>wasp</a>, a <a object|spider>spider</a> or a <a object|worm>worm</a> will come out.
hu: Az idegen tojásokat az <a object|mother>Idegen Királynő</a> rakja le. Rövid idő múlva kikelnek, és egy <a object|ant>hangya</a>, egy <a object|wasp>darázs</a>, egy <a object|spider>pók</a> vagy egy <a object|worm>féreg tűnik elő</a>.

source: <button 167/> Power Plant
hu: <button 167/> Erőmű

source: The power plant is a <a object|power>power cell</a> factory. It transforms a <a object|titan>titanium cube</a> into a regular power cell fully charged and ready for use.
hu: Az erőmű egy <a object|power>energiacella</a> gyár. Egy <a object|titan>titán kockát</a> egy teljesen feltöltött és használatra kész normál energia cellává alakít át.

source: A power plant requires some energy in the subsoil. If the satellite report says that energy is available only at some places, you will need a <a object|botsr>sniffer bot</a> to prospect the subsoil. The marks it lays down provide information about the specifics of its findings: a <a object|enerspot>green cross</a> means that there is an energy deposit at this location beneath the surface, which is indispensable for the construction of a power plant or a <a object|station>power station</a>.
hu: Egy erőműnek némi energiára van szüksége az altalajból. Ha a műholdjelentés azt mutatja, hogy csak bizonyos helyeken áll rendelkezésre energia, akkor szükség lesz egy <a object|botsr>szimat</a> botra a megfelelő altalaj felkutatásához. A szimat által elhelyezett jelek tájékoztatást adnak a lelőhely sajátosságairól: a <a object|enerspot>zöld kereszt</a> azt jelzi, hogy a felszín alatt ezen a ponton energia lelőhely található, ami elengedhetetlen az erőmű vagy a <a object|station>töltőállomás</a> felépítéséhez.

source: If the large power cell at the base of the plant remains red after the construction is completed, this means that the site is not geologically adequate.
hu: Ha az erőmű alján lévő nagy teljesítménycella az építkezés befejezése után piros marad, az azt jelenti, hogy a helyszín geológiailag nem megfelelő.

source: Any flat and geologically adequate surface of at least 4 meters wide.
hu: Bármilyen sík és földtanilag megfelelő, legalább 4 méter széles felület.

source: Regular power cell.
hu: Hagyományos energia cella.

source: Subsoil energy.
hu: Energia az altalajban.

source: 12 seconds.
hu: 12 másodperc.

source: Underground Energy Deposit
hu: Földalatti Energia Lelőhely

source: Whenever a <a object|botsr>sniffer</a> uncovers a source of energy in the subsoil, it lays down a green cross. The following buildings can be erected nearby :
hu: Amikor egy <a object|botsr>szimat</a> energiaforrást tár fel az altalajban, zöld keresztet tesz le. A közelben a következő épületek építhetők fel:

source: <a object|station>Power station</a>
hu: <a object|station>Töltő állomás</a>

source: <a object|energy>Power plant</a>
hu: <a object|energy>Erőmű</a>

source: In order to prospect the subsoil you need a <a object|botsr>sniffer bot</a>, which can also discover <a object|titanore>titanium ore</a> deposits (indicated by a <a object|stonspot>red cross</a>) or <a object|uranore>uranium ore</a> deposits (indicated by a <a object|uranspot>yellow circle</a>).
hu: Az altalaj felderítéséhez szükség van egy <a object|botsr>szimat bot</a>ra, amely képes a <a object|titanore>titánium érc</a> (ezeket <a object|stonspot>piros kereszt</a>tel jelöli) vagy az <a object|uranore>uránérc</a> lelőhelyek (<a object|uranspot>sárga kör</a> jelzi) lelőhelyek felkutatására is.

source: Impossible.
hu: Lehetetlen.

source: <code>PowerSpot</code>
hu: enerspot

source: <button 172/> Information Exchange Post
hu: <button 172/> Információ Csere Oszlop

source: info
hu: infó

source: This building stores digital information. A post can contain up to 10 pieces of information, each one referenced by a name. For example, a post can contain 3 informations:<c/> \tab;"Position.x" 23.45 \tab;"Position.y" -102.70 \tab;"Quantity" 3.00
hu: Ez az épület digitális információkat tárol. Egy bejegyzés legfeljebb 10 információt tartalmazhat, mindegyikhez egy név tartozik. Például ez a bejegyzés 3 információt tartalmaz:<c/> \tab;"Position.x" 23.45 \tab;"Position.y" -102.70 \tab;"Quantity" 3.00

source: To put new information, you must execute the command <code><a cbot|send>send</a></code>. To read information from a post, you must execute the command <code><a cbot|receive>receive</a></code>.
hu: Új információ eltárolásához a <code><a cbot|send>send</a></code> parancsot kell végrehajtani. Egy bejegyzés információinak kiolvasásához a <code><a cbot|receive>receive</a></code> parancsot kell végrehajtani.

source: Any flat surface of at least 2.5 meters wide.
hu: Bármilyen legalább 2.5 méter széles sík felület.

source: Digital information.
hu: Digitális információ.

source: <button 160/> Bot Factory
hu: <button 160/> Bot Gyár

source: This building is intended for the manufacturing of bots using <a object|titan>titanium</a>.
hu: Ezt az épület botok <a object|titan>titánium</a> felhasználásával történő gyártására való.

source: Place the titanium cube inside the factory.
hu: Helyezd a titán kockát a gyár belsejébe.

source: Step back out.
hu: Hátrálj ki.

source: Select the factory.
hu: Jelöld ki a gyárat.

source: Click on the button showing the diagram of the bot you want the factory to assemble (e.g. <button 137/> for a <a object|botgr>wheeled grabber</a>).
hu: Kattints a gyár által összeszerelni kívánt bot ábráját mutató gombra (pl. a <button 137/> a <a object|botgr>kerekes marok</a> esetén).

source: The finished bot does not include an onboard <a object|power>power cell</a>. You'll need to supply it with one for it to be able to leave the factory.
hu: A kész bot nem tartalmaz beépített <a object|power>energia cellát</a>. Ezt neked kell biztosítanod ahhoz, hogy a bot el tudja hagyni a gyárat.

source: The list of feasible bots will depend upon the research your <a object|research>research center</a> has completed at this time.
hu: A gyártható botok listája a <a object|research>kutatóközpont</a> által eddig elvégzett kutatásoktól függ.

source: Any flat surface of at least 7.5 meters wide.
hu: Bármilyen legalább 7.5 méter széles sík felület.

source: Completed bot.
hu: Elkészült bot.

source: Colored Flag
hu: Színes Zászló

source: The colored flags are helpful to mark strategic locations or positions that <a object|human>you</a> will need to find again. Flags appear on the mini-map in the shape of a cross of the same color as the flag.
hu: A színes zászlók segítségével megjelölheted azokat fontos helyeket, amiket szeretnél újra megtalálni. A zászlók a minitérképen a zászlóval egyező színű kereszt formájában jelennek meg.

source: Use the buttons <button 118/> and <button 119/> to plant and remove flags, the colors of which you can choose with the buttons above.
hu: A zászlókat a <button 118/> és a <button 119/> gombokkal lehet elhelyezni és eltávolítani. Ezek színét a feljebb lévő gombokkal választhatod ki.

source: When your mini-map is out of order, the fact that flags follow the direction of the wind can help you to find your way and not to walk around in circles.
hu: Ha a mini-térkép nem működik, akkor segíthet a tájékozódásban (és a körben járás elkerülésében) az az a tény, hogy a zászlók a szél irányát követik.

source: When programming, you can use flags to give a bot a reference to a certain position: the instruction <code><a cbot|radar>radar</a></code> allows bots to know the exact position of a flag of a given color.
hu: A programozás során a botok a zászlókat viszonyítási pontként használhatják: a <code><a cbot|radar>radar</a></code> utasítással a botok bemérhetik az adott színű zászlók pontos helyét.

source: Finishing Pad
hu: Cél Állomás

source: The finishing pad is an objective to be reached in some exercises.
hu: A célállomás egy olyan célpont ahová egyes gyakorlatokban el kell jutni.

source: <button 136/> Astronaut
hu: <button 136/> Asztronauta

source: The astronaut is you within the game.
hu: Az űrhajós te vagy a játékban.

source: If you die, the mission immediately fails.
hu: Ha meghalsz, a küldetés azonnal meghiúsul.

source: You can construct buildings with the help of the neutron gun holstered to your survival kit. The survival kit allows you, in most missions, to fly, thanks to the reactor placed underneath, or to swim with no time limit. You can carry most objects but the weight will slow down your movements considerably. Flying, swimming and walking underwater are also made impossible if you are carrying an object. The use of a <a object|botgr>grabber</a> or a <a object|botsub>subber</a> is advised for tasks such as these.
hu: A túlélőkészlethez kötött neutronpisztoly segítségével épületeket tudsz felhúzni. A túlélő készlet az alatta elhelyezett reaktornak köszönhetően a legtöbb küldetésben lehetővé teszi a repülést, és az időkorlát nélküli úszást. A legtöbb tárgyat képes vinni, de a súly jelentősen lelassítja a mozgásod. A repülés és az úszás sem lehetséges, amikor egy tárgyat viszel. Az ilyen feladatokra a <a object|botgr>marok</a> vagy a <a object|botsub>tengeralattjáró</a> bot használata javasolt.

source: You cannot carry <a object|uranore>uranium ore</a> because of the risks attached to radioactivity.
hu: Az <a object|uranore>uránium ércet</a> nem viheted, a sugárveszély miatt.

source: A special button <button 111/> allows you to ensure that the ground around you is flat. This is important since building is only possible on a flat surface. A flat surface is designated green while a sloping one is red.
hu: Egy speciális gomb <button 111/> segítségével meggyőződhetsz róla, hogy körülötted lévő talaj kellően sík-e. Ez azért fontos, mert csak sík felületen lehet építeni. A sík felület zöld, míg a lejtős felület piros színben jelenik meg.

source: A button <button 118/> allows you to mark a location with <a object|flag>flags</a> of various colors. This can help you not to get lost, to find important positions again, or to indicate a position to a bot. 5 flags of 5 different colors are at your disposal. You can remove a flag by using the next button <button 119/> and store it for further use.
hu: A <button 118/> gomb segítségével megjelölheted a helyeket különböző színű <objektum|zászló>zászlókkal</a>. Ez segíthet abban, hogy ne tévedj el, hogy újra megtaláld a fontos helyszíneket, vagy hogy jelezd a pozíciót egy botnak. 5 db 5 különböző színű zászló áll a rendelkezésedre. Az eltávolítás <button 119/> gomb megnyomásával felveheted a zászlót, és elteheted későbbre.

source: <button 176/> Mission Control
hu: <button 176/> Küldetés Irányítás

source: Earth control center for all <a object|human>your</a> space missions. Though still named after the well-known mission control of the old days, "Houston" is actually located in the middle of the Nevada Desert, the new center for space exploration activities.
hu: A földi irányítóközpont felügyeli a <a tárgy|ember>te</a> összes űrbéli küldetésed. Bár még mindig a régi idők jól ismert küldetésirányításának nevét viseli, "Houston" valójában a Nevada-sivatag közepén található, ami az űrkutatási tevékenységek új központja.

source: The Mission Control Center watches over you day and night, and a whole team of scientists and engineers are working hard trying to find a solution to all the problems that you encounter.
hu: A Küldetés Irányító Központ éjjel-nappal vigyáz rád, tudósok és mérnökök egész csapata pedig keményen dolgozik azon, hogy minden felmerülő problémára megoldást találjanak.

source: Keys A, B, C and D
hu: A, B, C és D gombok

source: The keys give <a object|human>you</a> access to the <a object|safe>vault</a>. You'll need 4 of them.
hu: A kulcsok hozzáférést biztosítanak <a object|human>számodra</a> az <a object|safe>páncélterem</a>-hez. 4 darabra lesz szükség.

source: Key A, blue and triangle-shaped
hu: "A" kulcs, kék és háromszög alakú

source: Key B, red and pentagon-shaped
hu: "B" kulcs, vörös és ötszög alakú

source: Key C, green and shaped like a 6-pointed star
hu: "C" kulcs, zöld és hatágú csillag alakú

source: Key D, yellow and circular
hu: "D" kulcs, sárga és kerek

source: Objects <a cbot|category>Category</a>
hu: Objektum <a cbot|category>Kategória</a>

source: <code>KeyA</code>, <code>KeyB</code>, <code>KeyC</code> and <code>KeyD</code>
hu: <code>A </code>, <code>KeyB</code>, <code>KeyC</code> and <code>KeyD</code>

source: The lab is intended for the analysis of <a object|bullet>organic matter</a>. It will help <a object|human>you</a> become familiar with the insects' very own technology and perhaps even use it to your advantage. Place a chunk of <a object|bullet>organic matter</a> on the platform, select the lab, and click the button corresponding to the desired research program.
hu: A labor <a object|bullet>szerves anyagok</a> elemzésére szolgál. Segít <a tárgy|ember>neked</a> megismerni a rovarok saját technológiáját, és talán még az előnyödre is fordítani. Helyezz egy darab <a object|bullet>szerves anyagot</a> az emelvényre, válaszd ki a laboratóriumot, és kattints a kívánt kutatási programnak megfelelő gombra.

source: Organic matter.
hu: Szerves anyag.

source: New and improved technologies.
hu: Új és továbbfejlesztett technológiák.

source: 20 seconds.
hu: 20 másodperc.

source: Apollo Lunar Roving Vehicle
hu: Apolló Holdjáró Eszköz

source: <code>< no archive picture available ></code>
hu: <code>< nincs kép az archivumban ></code>

source: The Lunar Jeep (LRV) was brought to the moon on July 30th 1971 by the astronauts David Scott and Jim Irwin from Apollo mission 15. Its batteries are still partly charged, which allows you to remote control it. But this old-fashioned technology will be of no use to you.
hu: A holdjárót (LRV) 1971. július 30-án David Scott és Jim Irwin űrhajósok hozták a Holdra az Apollo 15-ös küldetés során. Akkumulátorai részben még mindig fel vannak töltve, így távirányítható. De ez a régimódi technológia nem igazán lesz hasznodra.

source: Mine
hu: Akna
