Repository: muudry/colobot-data
Catalog: help/object/po/*.po
Languages: hu

source: Mines were a defensive weapons system used by the first expedition. Because of the dangers this system causes for the mission itself, they are no longer used in your expedition. In some exercises mines are used to learn how to avoid obstacles. There is no way to remove them or to create new ones.
hu: Az aknák az első expedíció által használt védelmi fegyverrendszerek voltak. Mivel ez a rendszer a magára a küldetésre is veszélyt jelent, a te expedíciódon már nem használjuk őket. Egyes gyakorlatok során az aknákat az akadályok kikerülésének megtanítására használják. Nem lehet őket eltávolítani, és újakat sem lehet létrehozni.

source: With a <a object|bottr>practice bot</a>, don't get any closer than 2 meters to the position given by the instruction <a cbot|radar>radar</a>.
hu: A <an object|bottr>gyakoroló bottal</a> ne menj 2 méternél közelebb a <a cbot|radar>radar</a> utasítás által megadott pozícióhoz.

source: Alien Queen
hu: Idegen Királynő

source: This huge insect is the mother of them all. It lays <a object|egg>eggs</a> and from these eggs will hatch all the various kinds of insects <a object|human>you</a>'re likely to encounter. All of them are extremely hazardous to yourself and your mission. The queen's protective shell is particularly resistant to attack.
hu: Ez a hatalmas rovar az összes többi anyja. <a object|egg>tojásokat</a> rak, és ezekből a tojásokból kel ki az összes féle-fajta rovar amivel az <a object|human>ember</a> találkozhat. Mindegyik rendkívül veszélyes rád és küldetésedre nézve. A királynő védőburka különösen ellenálló a támadásokkal szemben.

source: <a object|ant>ants</a>
hu: <a object|ant>hangyák</a>

source: <a object|spider>spiders</a>
hu: <a object|spider>pókok</a>

source: <a object|wasp>wasps</a>
hu: <a object|wasp>darazsak</a>

source: <a object|worm>worms</a>
hu: <a object|worm>férgek</a>

source: Nest
hu: Fészek

source: The alien nest is an odd structure out of which <a object|bullet>organic matter</a> erupts on a regular basis. <a object|wasp>Wasps</a> visit nests regularly to collect ammunition that they will use to bombard your bots, buildings and yourself.
hu: Az idegen fészek egy furcsa szerkezet, amelyből rendszeresen <a object|bullet>szerves anyag</a> tör elő. A <a object|wasp>darazsak</a> rendszeresen felkeresik a fészkeket, hogy lőszert gyűjtsenek, amivel aztán bombázni fogják a robotjait, épületeidet és téged is.

source: <button 170/> Nuclear Plant
hu: <button 170/> Nukleáris erőmű

source: The nuclear plant is a <a object|atomic>nuclear power cell</a> factory. It transforms a chunk of <a object|uranore>uranium ore</a> into a <a object|atomic>nuclear power cell</a> fully charged and ready for use.
hu: A nukleáris erőmű egy <a object|atomic>nukleáris energiacella</a> gyár. Egy <a object|uranore>uránércet</a> egy teljesen feltöltött és használatra kész <a object|atomic>atomcellává</a> alakít át.

source: Uranium ore.
hu: Uránium érc.

source: Nuclear power cell.
hu: Nukleáris energia cella.

source: 30 seconds.
hu: 30 másodperc.

source: Regular Power Cell
hu: Hagyományos Energia Cella

source: A power cell supplies the bots and a few buildings with energy.
hu: Az energiacella energiával látja el a robotokat és egyes épületeket.

source: An entirely red power cell is empty. The green section indicates the remaining capacity. A power cell can be recharged using a <a object|station>power station</a>. A <a object|energy>power plant</a> is needed to produce a new and fully charged power cell.
hu: Egy teljesen vörös tápelem üres. A zöld rész a fennmaradó kapacitást jelzi. Egy energiacella újratölthető a <a object|station>töltőállomáson</a>. Egy új, teljesen feltöltött energiacella előállításához egy <a object|energy>erőműre</a> van szükség.

source: The capacity of a regular power cell is 100 times smaller than that of a <a object|atomic>nuclear power cell</a> produced by a <a object|nuclear>nuclear plant</a> using <a object|uranore>uranium ore</a>.
hu: Egy normál energiacella kapacitása 100-szor kisebb, mint egy <a object|atomic>nukleáris energiacelláé</a>, amit egy <a object|nuclear>nukleáris erőmű</a> állít elő <a object|uranore>uránérc</a> felhasználásával.

source: The radar indicates the direction of the nearest <a object|mother>enemy</a>. Moreover, the information given by the radar allows the mini-map at the bottom right corner of your screen to show the position of all bots, buildings and enemies as small squares and triangles of different colors.
hu: A radar jelzi a legközelebbi <a object|mother>ellenség</a> irányát. Sőt, a radartól kapott információ lehetővé teszi, hogy a képernyő jobb alsó sarkában lévő mini-térkép az összes bot, épület és ellenség helyzetét különböző színű kis négyzetek és háromszögek formájában mutassa.

source: Radar stations also act as relays for communication with the Earth from distant planets.
hu: A radarállomások ezen kívül átjátszó állomásként is szolgálnak a föld és a távoli bolygók közi kommunikáció továbbítása során.

source: Information for the mini-map.
hu: Információ a minitérkép részére.

source: Constant.
hu: Konstans.

source: <button 169/> Repair Center
hu: <button 169/> Javító Központ

source: The repair center regenerates the shield on damaged bots. A bot's shield will absorb a certain amount of <a object|mother>enemy</a> hits. If there is no shield left, this means that the bot itself, when hit next, will be destroyed.
hu: A javító állomás helyreállítja a pajzsot a sérült botokon. A bot pajzsa elnyel bizonyos mennyiségű <a object|mother>ellenséges</a> találatot. Ha elfogyott a pajzs, akkor a következő találatkor maga a bot semmisül meg.

source: Damaged bot.
hu: Sérült bot.

source: Repaired bot with regenerated shield.
hu: Kijavított bot, helyreállított pajzzsal.

source: A few seconds depending on the repair job to be done.
hu: Pár másodperc, a szükséges javítástól függően.

source: <button 163/> Research Center
hu: <button 163/> Kutató központ

source: The research center is an enormous computer. Its most useful feature is its ability to come up with new technologies as well as improvements on existing ones regarding buildings and bots in particular.
hu: A kutatóközpont egy hatalmas számítógép. Leghasznosabb tulajdonsága, hogy képes új technológiákkal előállni, valamint javítani a meglévőket az épületek és a robotok tekintetében.

source: The 65'536 processors it contains use up a large amount of energy. Each research program necessitates a brand new and fully charged <a object|power>power cell</a>
hu: A benne található 65 536 darab processzor nagy mennyiségű energiát használ fel. Minden kutatási programhoz vadonatúj, teljesen feltöltött <a object|power>energia cella</a> szükséges

source: Any flat surface of at least 5 meters wide.
hu: Bármilyen legalább 5 méter széles sík felület.

source: Request for research.
hu: Kutatás indítása.

source: Regular or nuclear power cell.
hu: Hagyományos vagy nukleáris energiacella.

source: Between 9 seconds and 1 minute depending on the research.
hu: 1 és 9 másodperc között, a kutatástól függően.

source: Ruin
hu: Rom

source: A ruin is what's left of a building after it has been disabled by a <a object|spider>spider</a> or by friendly fire.
hu: A rom az, ami az épületből megmarad, miután egy <a object|spider>pók</a> vagy más sérülés megbénította.

source: It can't be converted back into a reusable <a object|titan>titanium cube</a>.
hu: Nem alakítható vissza újrafelhasználható <a object|titan>titánium kockává</a>.

source: <button 175/> Vault
hu: <button 175/> Páncélterem

source: This dome-shaped building was conceived by the first expedition. Its purpose was to offer protection to a new type of advanced bot. To protect it from insect attacks, the vault was locked by 4 <a object|key>keys</a>. Only after you find the 4 keys and place each one of them on their corresponding slots will you be given access to the bot.
hu: Ezt a kupola alakú épületet az első expedíció alkotta meg. A célja az volt, hogy védelmet nyújtson egy új típusú fejlett bot számára. A rovarok elleni védelem érdekében a páncéltermet 4 <a object|key>kulccsal</a> zárták le. Csak úgy nyerhetsz hozzáférést a bothoz, ha előbb felkutatod mind a négy kulcsot, majd a helyükre teszed őket.

source: Spider
hu: Pók

source: Spiders work like suicide commandoes: whenever a spider gets within a close enough range of its target, it inflates its abdomen and bursts into a multitude of tiny burning fragments. These fragments will set fire to everything they get in contact with. Luckily the spider won't survive.
hu: A pókok úgy működnek, mint valami öngyilkos kommandó: valahányszor egy pók elég közel kerül a célpontjához, felfújja a hasát, és apró, égő szilánkok sokaságára robban szét. Ezek a töredékek felgyújtanak mindent, amit elérnek. Szerencsére a pók ezt nem éli túl.

source: Starting Pad
hu: Induló állomás

source: The starting pad is a platform used in some exercises.
hu: Az induló állás egy emelvény amit egyes gyakorlatoknál használunk.

source: <button 164/> Power Station
hu: <button 164/> Töltő Állomás

source: The power station extracts energy from the underground and recharges <a object|power>regular power cells</a> through induction. To recharge a power cell loaded at the back of a bot, just move the bot to the center of the platform and wait a few seconds. A <a object|power>power cell</a> carried at arm's length can also be recharged. <a object|atomic>Nuclear power cells</a> are non-rechargeable.
hu: A töltő állomás az altalajból nyer energiát, és indukcióval tölti fel a <a object|power>hagyományos energia cellákat</a>. A bot hátulján lévő energia cella feltöltéséhez csak állítsd rá a botot az emelvény közepére, és várj néhány másodpercet. A kézben szállított <a object|power>energia cellák</a> is újratöltődnek. A <a object|atomic>nukleáris energiacellák</a> nem tölthetők.

source: A power plant needs some energy in the subsoil. If the satellite report says that energy is available only at some places, you will need a <a object|botsr>sniffer bot</a> to prospect the subsoil. The marks it lays down provide information about the specifics of its findings: a <a object|enerspot>green cross</a> means that there is an energy deposit at this location beneath the surface, which is indispensable to the construction of a power station or a <a object|energy>power plant</a>.
hu: Egy erőműnek némi energiára van szüksége az altalajból. Ha a műholdjelentés azt mutatja, hogy csak bizonyos helyeken áll rendelkezésre energia, akkor szükség lesz egy <a object|botsr>szimat</a> botra a megfelelő altalaj felkutatásához. A szimat által elhelyezett jelek tájékoztatást adnak a lelőhely sajátosságairól: a <a object|enerspot>zöld kereszt</a> azt jelzi, hogy a felszín alatt ezen a ponton energia lelőhely található, ami elengedhetetlen az erőmű vagy a <a object|station>töltőállomás</a> felépítéséhez.

source: The large power cell at the top of the station remaining red after the construction is completed can only mean that the site is not geologically adequate.
hu: Ha az építkezés befejezése után vörösen marad az állomás tetején található nagy energia cella, az csak azt jelentheti, hogy a helyszín geológiailag nem megfelelő.

source: Any flat and geologically adequate surface at least 6 meters wide.
hu: Bármilyen sík és földtanilag megfelelő, legalább 6 méter széles felület.

source: Empty power cell.
hu: Üres energia cella.

source: Recharged power cell.
hu: Feltöltött energia cella.

source: A few seconds, depending on the capacity to be recharged.
hu: Pár másodperc, a feltöltendő mennyiségtől függően.

source: Underground Titanium Deposit
hu: Földalatti Uránium Lelőhely

source: A red cross reveals the presence of a stratum of <a object|titanore>titanium ore</a> in the subsoil. It will be possible to extract it using a <a object|derrick>derrick</a>.
hu: A vörös kereszt jelzi a <a object|titanore>titánium érc</a> réteg jelenlétét az altalajban. Ez kinyerhető egy <a object|derrick>furótorony</a> segítségével.

source: A <a object|botsr>sniffer</a> will lay down a red cross each time it uncovers a deposit. <a object|botsr>Sniffer bots</a> can also detect the presence of <a object|uranore>uranium ore</a> as indicated by a <a object|uranspot>yellow circle</a> and of energy as indicated by a <a object|enerspot>green cross</a>.
hu: Egy <a object|botsr>szimat bot</a> piros keresztet tesz le minden alkalommal, amikor lerakódást talál. A <a object|botsr>szimat botok</a> képesek észlelni az <a object|uranore>uránérc</a> jelenlétét is, amit egy <a object|uranspot>sárga kör</a> jelez, valamint az energiát, amit <a object|enerspot>zöld kereszt</a> jelöl.

source: Titanium
hu: Titánium

source: Titanium is indispensable for the construction of buildings, <a object|factory>bots</a> and <a object|energy>regular power cells</a>. There is usually some left on the <a object|base>spaceship</a> when you embark on a new mission.
hu: A titánium nélkülözhetetlen épületek, <egy objektum|gyári>botok</a> és <a object|energy>hagyományos energiacellák</a> előállításához. Általában van még néhány az <a object|base>űrhajón</a>, amikor új küldetésre érkezel.

source: If more is needed, you'll have to <a object|convert>convert</a> chunks of <a object|titanore>titanium ore</a> into usable titanium cubes.
hu: Ha többre van szükség, akkor a <a object|titanore>titánérc</a> darabok <a object|convert>átalakíthatók</a> hasznosítható titánium kockákká.

source: Titanium Ore
hu: Titánium érc

source: <a object|titan>Titanium</a> is indispensable for the construction of buildings, <a object|factory>bots</a> and <a object|energy>regular power cells</a>. The titanium <a object|human>you</a> see in its usable, cube shaped form has been <a object|convert>converted</a> from raw chunks of titanium ore.
hu: A <a object|titan>titánium</a> nélkülözhetetlen épületek, <a object|factory>botok</a> és a <a object|energy>hagyományos energiacellák</a> építéséhez. A hasznosítható, kocka alakú titániumot a nyers titánium ércből lehet <a object|convert>alakítani</a>.

source: Titanium ore can be found either directly on the surface or in the subsoil. In the latter case, it needs to be first located and identified by a <a object|botsr>sniffer</a>, then extracted using a <a object|derrick>derrick</a>. If a sniffer identifies a titanium ore deposit, it lays down a <a object|stonspot>red cross</a>.
hu: A titánium érc közvetlenül a felszínen vagy az altalajban található. Az utóbbi esetben ezt előbb meg kell találnia és azonosítania kell egy <a object|botsr>szimat</a>nak, majd ki kell termelni egy <a object|derrick>fúrótorony</a> segítségével. Ha egy szimat titánium érc lelőhelyet azonosít, akkor egy <a object|stonspot>vörös keresztet</a> rak le.

source: Explosive (TNT)
hu: Robbanószer (TNT)

source: A TNT charge is extremely sensitive. You should approach it with caution so as not to hit it or give it any kind of shock. The risk is minimized once the explosive is within a <a object|botgr>grabber</a>'s grasp.
hu: A TNT töltet rendkívül érzékeny. Óvatosan kell megközelíteni, nehogy elüsd, vagy megüsd. A kockázat minimálisra csökken, ha a robbanóanyag egy <a object|botgr>marok</a> kezében van.

source: <button 165/> Defense Tower
hu: <button 165/> Védelmi Torony

source: The tower constitutes the best defense against <a object|mother>enemy</a> attacks, whether they originate on the ground or from the skies.
hu: A torony nyújtja a legjobb védelmet az <a object|mother>ellenség</a> támadásai ellen, legyen az akár a földi vagy légi eredetű.

source: The tower requires either a <a object|power>regular</a> or a <a object|atomic>nuclear</a> power cell. A regular power cell provides a capacity for 8 shots. A nuclear power cell is of course preferable. The tower starts blinking when it runs out of power.
hu: A toronynak vagy egy <a object|power>hagyományos</a> vagy egy <a object|atomc>nukleáris</a> energiacellára van szüksége. Egy hagyományos energia cella 8 lövésre elegendő. Természetesen a nukleáris cella az előnyösebb. A torony villogni kezd amikor kimerül.

source: The range is 40 meters. To visualize it, select the tower then hit the <range> button <button 41/>. Red dots outline the circular zone for 20 seconds.
hu: A hatósugár 40 méter. Ennek megjelenítéshez válaszd ki a tornyot, majd nyomja meg a <hatósugár> gombot <gomb 41/>. 20 másodpercre piros pöttyök fogják körbevenni hatóterületet.

source: Any flat surface of at least 3.5 meters wide.
hu: Bármilyen legalább 3.5 méter széles sík felület.

source: Uranium Ore
hu: Uránium Érc

source: Uranium ore is essential to the production of <a object|atomic>nuclear power cells</a>.
hu: Az uránérc nélkülözhetetlen az <a object|atomic>nukleáris energia cellák</a> előállításához.

source: It is to be found on the surface or in the subsoil. In the latter case, it needs to be first located and identified by a <a object|botsr>sniffer</a>, then extracted using a <a object|derrick>derrick</a>. If a sniffer identifies a deposit of uranium ore, it lays down a <a object|uranspot>yellow circle</a>.
hu: A felszínen vagy az altalajban található. Az utóbbi esetben először meg kell találnia és azonosítania kell egy <a object|botsr>szippantónak</a>, majd ki kell bontania egy <a object|derrick>derrick</a> segítségével. Ha egy szippantó uránérc lelőhelyet azonosít, egy <a object|uranspot>sárga kört</a> rak le.

source: A <a object|nuclear>nuclear plant</a> will then take care of converting the chunk into a new and fully charged <a object|atomic>nuclear power cell</a>.
hu: A <a object|nuclear>nukleáris erőmű</a> ezután gondoskodik arról, hogy a darabkát egy új, teljesen feltöltött <objektum|atomic>nukleáris energia cellává</a> alakítsa át.

source: All <a object|botgr>grabbers</a>. Due to its radioactivity, the <a object|human>astronaut</a> can not transport it.
hu: Minden <a object|botgr>marok</a>. Radioaktivitása miatt az <a object|human>asztronauta</a> nem szállíthatja.

source: Underground Uranium Deposit
hu: Földalatti Uránium Lelőhely

source: A yellow circle reveals the presence of a stratum of <a object|uranore>uranium ore</a> in the subsoil. It will be possible to extract it using a <a object|derrick>derrick</a>.
hu: A sárga kör egy <a object|uranore>uránérc</a> réteg jelenlétét jelzi az altalajban. Ezt egy <a object|derrick>fúrótorony</a> segítségével lehet kitermelni.

source: A <a object|botsr>sniffer</a> will lay down a yellow circle each time it uncovers a deposit. <a object|botsr>Sniffer bots</a> can also detect the presence of <a object|titanore>titanium ore</a> as indicated by a <a object|stonspot>red cross</a> and of energy as indicated by a <a object|enerspot>green cross</a>.
hu: Egy <a object|botsr>szimat</a> sárga kört helyez le minden alkalommal, amikor lerakódást talál. Az <a object|botsr>a szimat botok</a> képesek észlelni az <a object|titanore>titánérc</a> jelenlétét, amit egy <a object|stonspot>vörös kereszttel</a>, valamint az energiáét, amit <a object|enerspot>zöld kereszttel</a> jelölnek.

source: Wasp
hu: Darázs

source: The wasp is a formidable enemy, very hard to shoot down since its flying is particularly swift. Wasps carry balls of <a object|bullet>organic matter</a> that they will hurl at your bots and buildings and at yourself from above.
hu: A darázs félelmetes ellenség, nagyon nehéz lelőni, mivel különösen gyorsan a repte. A darazsak egy-egy <a object|bullet>szerves anyag</a> golyót visznek, amelyeket föntről ledobnak a botjaidra, épületeidre, de még rád is.

source: The <a object|tower>defense tower</a> is the easiest way to get rid of them.
hu: Az <a object|tower>védőtorony</a> a legegyszerűbb módja annak, hogy megszabaduljunk tőlük.

source: Checkpoint
hu: Ellenőrzőpont

source: In the exercises, blue crosses indicate positions that have to be crossed. They disappear as soon as a <a object|bottr>practice bot</a> crosses them.
hu: A gyakorlatokban kék keresztek jelzik azokat a pontokat, amelyeket érinteni kell. Amint egy <a object|bottr>gyakorlóbot</a> áthalad rajtuk, eltűnnek.

source: Worm
hu: Féreg

source: Worms transmit viruses to programmed bots. The virus alters the programming to such an extent that the bot either functions in a very erratic way or stops functioning altogether.
hu: A férgek vírusokat juttatnak a programozott botokba. A vírus olyan mértékben megváltoztatja a programozást, hogy a bot vagy nagyon hibásan működik, vagy teljesen működésképtelenné válik.

source: Worms live in the subsoil but sometimes emerge and crawl on the surface. When they are underground they are undetectable and indestructible.
hu: A férgek az altalajban élnek, de néha feljönnek és a felszínen kúsznak. Amikor a föld alatt vannak, észrevehetetlenek és elpusztíthatatlanok.

source: Derelict bot
hu: Elhagyott bot

source: A derelict bot is what's left of a bot after it has been disabled by a <a object|spider>spider</a> or by friendly fire.
hu: Az elhagyott bot az, ami egy botból megmarad, miután működésképtelenné tette egy <a object|spider>pók</a> vagy más sérülés.

source: A <a object|botrecy>recycler</a> can convert a derelict bot back into a reusable <a object|titan>titanium cube</a>.
hu: Egy <a object|botrecy>újrahasznosító</a> bot képes visszaalakítani egy elhagyott botot egy újra hasznosítható <a object|titan>titánium kockává</a>.

source: It gives birth to the following insects :
hu: Az alábbi rovaroknak ad életet:

source: <button 169/> Destroyer
hu: <button 169/> Romboló

source: destroy
hu: <code>Wreck</code>

source: This building was designed to destroy objects. The object just needs to be placed at the center of the platform and the button can be pressed. The destroyer takes care of the rest.
hu: Ezt az épületet tárgyak elpusztítására tervezték. Elég a tárgyat az emelvény közepére kell helyezni, és megnyomnia a gombot. A többiről a romboló gondoskodik.

source: Object that is no longer needed.
hu: Tárgy amire már nincs szükség.

source: Satisfaction.
hu: Elégedettség.

source: 5 seconds.
hu: 5 másodperc.

source: <a cbot>CBOT Language</a>, <a cbot|type>variables</a> and <a cbot|category>categories</a>.
hu: <a cbot>CBOT Nyelv</a>, <a cbot|type>Változók</a> és <a cbot|category>Kategóriák</a>.

source: Target2
hu: Célpont2

source: Target1
hu: Célpont1

source: These buildings appear in the flying exercise missions and their height can vary. In the center <a object|target2>Target2</a> is placed.
hu: Ezek az épületek a repülés gyakorló küldetésekben jelennek meg, és magasságuk változó. Középen egy <a object|target2>CélPont2</a> található.

source: In the flying exercise missions, brown crosses indicate positions that have to be crossed by a winged bot. They disappear as soon as a bot flies through them. They are placed in the center of the <a object|target1>Target1</a> building.
hu: A repülés gyakorló küldetéseken barna keresztek jelzik azokat a pozíciókat, amelyeken egy szárnyas botnak át kell haladnia. Amint egy bot átrepül rajtuk, eltűnnek. A <a object|target1>CélPont1</a> épület közepén helyezkednek el.

source: Brown Mushroom
hu: Barna gomba

source: The growth of these harmless brown mushrooms signifies the presence of <a object|uranore>uranium ore</a> in the subsoil. Use a <a object|botsr>sniffer</a> in order to confirm that.
hu: Ezeknek az ártalmatlan barna gombáknak a burjánzása <a tárgy|uranore>uránérc</a> jelenlétére utal az altalajban. Használd <a object|botsr>szimatot</a> ennek megerősítésére.

source: Bush
hu: Bozót

source: A bush is a type of greenery that can be flattened by <a object|botrecy>heavy tracked bots</a>, allowing other bots and <a object|human>you</a> to pass through it as well.
hu: A bozót olyan növényzet, amit a <a tárgy|botrecy>nehéz lánctalpas botok</a> lelapíthatnak, így más botok és <a object|human>te</a> is áthaladhatsz rajta.

source: Crystal
hu: Kristály
