Repository: muudry/colobot-data
Catalog: levels/exercises/chapter002/level005/po/*.po
Languages: hu

source: Fighter Jet 2
hu: Vadászgép 2

source: Adapt the program to a mountainous terrain.
hu: Igazítsd a programot a hegyes terephez.

source: Move
hu: Útvonal

source: Objective
hu: Célkitűzés

source: Adapt the flying height of the <a object|botfj>winged shooter</a> to the terrain.
hu: Igazodjon a <a object|botfj>szárnyas löveg</a> repülési magassága a terephez.

source: Here is one more time the program of the previous exercise that hunts ants:
hu: Íme még egyszer az előző, hangyákra vadászó gyakorlat programja:

source: extern void object::JetFighter1() { object item; aim(-20); jet(0.2); while (position.z < 10) { wait(0.2); } jet(0); while (true) { while (radar(AlienAnt, 0, 360, 0, 20) == null) { item = radar(AlienAnt); turn(direction(item.position)); motor(1,1); wait(0.2); } fire(1); } }
hu: extern void object::Vadasz1() { object item; aim(-20); jet(0.2); while (position.z < 10) { wait(0.2); } jet(0); while (true) { while (radar(AlienAnt, 0, 360, 0, 20) == null) { item = radar(AlienAnt); turn(direction(item.position)); motor(1,1); wait(0.2); } fire(1); } }

source: The bot always stays at an altitude of 10m above sea level. This is not adapted to the mountainous terrain of the present exercise, the bot has got to adapt to the terrain. The best way to do so is to insert just before the <c/>wait(0.2);<n/> a test to see if the height above ground is too low or too high, and to react accordingly.
hu: A bot mindig 10m tengerszint feletti magasságban marad. Ez nem igazodik a jelen gyakorlat hegyvidéki terepéhez, pedig most már a botnak alkalmazkodnia kell a terephez. Ennek legjobb módja, ha közvetlenül a <c/>wait(0.2);<n/> elé beillesztünk egy vizsgálatot, ami megnézi nem-e túl alacsony vagy túl magas a talaj szinttől mért magasság, és ennek megfelelően reagál.

source: We already saw that <code>position.z</code> gives the altitude above sea level. <code><a cbot|topo>topo</a>(position)</code> gives the altitude of the ground at the position of the bot. If we want the bot to stay at an altitude between 6 and 9m above ground, we must treat the following cases: if <code>position.z-topo(position)</code> is smaller than 6, the bot must climb with <c/>jet(1);<n/>. If <code>position.z-topo(position)</code> is greater than 9, the bot must go down with <c/>jet(-1);<n/>. In order to program these tests, use the instruction <code><a cbot|if>if</a></code>, that executes the instructions in braces only once if the condition is true:
hu: Már láttuk, hogy a <code>position.z</code> a tengerszint feletti magasságot adja meg. A <code><a cbot|topo>topo</a>(position)</code> megadja a talajszint magasságát a bot helyén. Ha azt szeretnénk, hogy a bot 6 és 9 m közötti magasságban maradjon a talaj felett, akkor a következő eseteket kell kezelnünk: ha a <code>position.z-topo(position)</code> kisebb, mint 6, akkor a botnak emelkednie kell <c/>jet(1);<n/> -el. Ha a <code>position.z-topo(position)</code> nagyobb, mint 9, akkor a botnak süllyednie kell mennie a <c/>jet(-1);<n/> -el. A feltételek programozásához használd az <code><a cbot|if>if</a></code> utasítást, amely csak egyszer hajtja végre a kapcsos zárójelben lévő utasításokat, akkor ha a feltétel igaz:

source: Before starting the testing, stabilize the altitude with <c/>jet(0);<n/>: in case the height above ground lies between 6 and 9m, the bot must neither climb nor go down. If afterwards either <c/>jet(1);<n/> or <c/>jet(-1);<n/> is executed, it will cancel the previous <c/>jet(0);<n/>.
hu: A tesztelés megkezdése előtt stabilizáld a magasságot a <c/>jet(0);<n/> segítségével: ha a talaj feletti magasság 6 és 9 m között van, a botnak nem szabad se emelkedni, se süllyedni. Ha ezt követően a <c/>jet(1);<n/> vagy a <c/>jet(-1);<n/> végrehajtásra kerül, akkor az törli (felülírja) az előző <c/>jet(0);<n/> -t.

source: Just insert these lines before the <code>wait(0.2)</code>, and the bot will adapt to the terrain. You can then delete the first lines of the program that set the initial altitude at 10m.
hu: Csak illesszed be ezeket a sorokat a <code>wait(0.2)</code> elé, és a bot alkalmazkodni fog a terephez. Ezután törölheted a program első sorait, amelyek a kezdeti magasságot 10 m-re állították be.

source: See also
hu: Lásd még

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
hu: <a cbot>Programozás</a>, <a cbot|type>típusok</a> és <a cbot|category>kategóriák</a>.
