Repository: muudry/colobot-data
Catalog: levels/exercises/chapter001/level005/po/*.po
Languages: hu

source: Power Cell 2
hu: Energia cella 2

source: Power all the winged shooters.
hu: Lásd el energiával az összes löveget.

source: Spider2
hu: Pók2

source: Objective
hu: Feladat

source: Power the <a object|botfj>winged shooters</a> with <a object|power>power cells</a>, so that they can kill the ants in the ant nest located in a hole north of your position.
hu: Lásd el <a object|power>energia cellával</a> a <a object|botfj>szárnyas löveg</a>eket, hogy kiirthassák a hangyákat a pozíciódtól északra lévő üregben található hangyafészekben.

source: The <a object|botgr>wheeled grabber</a> must go to a <a object|power>power cell</a>, grab it, go to a <a object|botfj>winged shooter</a>, and drop the cell. This task is very similar to the task performed in the previous exercise. Here is this program again:
hu: A <a object|botgr>kerekes marknak</a> oda kell mennie egy <a object|power>energia cellához</a>, meg kell ragadnia, oda kell vinnie egy <a object|botfj>szárnyas löveghez</a>, és le kell tennie a cellát. Ez a feladat nagyon hasonlít az előző gyakorlatban elvégzett feladathoz. Íme a program ismét:

source: The best way to solve the present exercise is to copy <button 61/> the program above into the clipboard (from <code>object</code> to <c/>drop();<n/>), and paste <button 62/> it into the program editor. Then you just have to make the necessary changes in order to adapt it to the new task.
hu: A feladat megoldásának legjobb módja az, ha a fenti programot vágólapra másolod <button 61/> (az <code>object</code>-ból a <c/>drop();<n/>-be), és beilleszted a <button 62/> a programszerkesztőbe. Ezután nincs más dolgod, mint az új feladathoz igazítani a programot a szükséges módosítások beiktatásával.

source: Instead of looking for titanium ore (<code>TitaniumOre</code>), look for a power cell (<code>PowerCell</code>). Instead of going to a converter (<code>Converter</code>), go to a winged shooter (<code>WingedShooter</code>). As soon as the winged shooter has got a new power cell, it will get down to work.
hu: A titánium érc (<code>TitaniumOre</code>) helyett keressen energia cellát (<code>PowerCell</code>). A konverter (<code>Converter</code>) helyett menjen egy szárnyas löveghez (<code>WingedShooter</code>). Amint a szárnyas löveg új energia cellát kapott, munkába áll.

source: If you want to know more about the "names" of the different objects in the programming language, please refer to the <a cbot|category>text about categories</a>.
hu: Ha többet szeretnél megtudni a különböző objektumok "neveiről" a programozási nyelvben, kérjük, olvasd el a <a cbot|category>kategóriákról szóló szöveget</a>.

source: Further improvement: loops
hu: További fejlesztés: hurkok

source: Once the program explained above works properly, you can improve it in order to repeat the task over and over again. Like this you will not have to execute the program several times in order to power several bots.
hu: Ha a fent ismertetett program már megfelelően működik, kibővítheted, hogy újra és újra megismételje a feladatot. Így nem kell többször futtatnod a programot ahhoz, hogy több botot is ellásson.

source: All programs written until now execute all instructions only once, one after another, from the beginning to the end of the program. You can also tell the bot to repeat some instructions: just write <code>while (true)</code>, an open brace, the instructions to be repeated, and a closing brace. Repeating some instructions several times in this way is called a loop. Here is an example of a program that repeats over and over the instructions that look for a power cell, grab it, and drop it on a winged shooter:
hu: Az összes eddig írt program az összes utasítást csak egyszer hajtja végre, egymás után, a program elejétől a végéig. Azt is megmondhatod a botnak, hogy az utasítások egy részét ismételjen hajtsa végre: csak írjd be a <code>while (true)</code>-t, egy nyitott kapcsos zárójelet, az ismétlendő utasításokat és egy záró kapcsos zárójelet. Az utasítások ilyen módon történő többszöri ismétlését huroknak nevezzük. Íme egy példa egy olyan programra, amely újra és újra megismétli azokat az utasításokat, amelyek egy energiacellát keresnek, megragadják, és ráteszik egy szárnyas lövegre:

source: Of course the variable declaration <c/>object item;<n/> must not be inside the loop, but just before: declare a variable only once.
hu: Természetesen az <c/>object item;<n/> változó deklaráció nem lehet a cikluson belül, hanem közvetlenül előtte, így a változó csak egyszer van deklarálva.

source: Remark
hu: Megjegyzés

source: A bot can execute a program perfectly well on his own. Meantime you can for example select the astronaut and take a look at what is happening at the nest, the show is worth it. But be careful not to get shot by your own bots...
hu: Egy bot képes teljesen önállóan végrehajtani egy programot. Ezalatt például kiválaszthatod az űrhajóst, és megnézheted, mi történik a fészekben, megéri látvány. Csak arra vigyázz, nehogy a saját botjaid lőjenek le...

source: See also
hu: Lásd még

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
hu: <a cbot>Programozás</a>, <a cbot|type>típusok</a> és <a cbot|category>kategóriák</a>.
