Repository: muudry/colobot-data
Catalog: help/generic/po/*.po
Languages: hu

source: Contributors on GitHub: https://github.com/colobot/colobot/graphs/contributors
hu: Közreműködők a GitHubon: https://github.com/colobot/colobot/graphs/contributors

source: Programming - the CBOT language
hu: Programozás - a CBOT nyelv

source: The CBOT language is very close in structure and syntax to C++ and Java. It has been adapted for the specific purposes of COLOBOT, and for an efficient pedagogical approach. This language is made up of instructions (see below), <a cbot|bloc>blocks</a>, <a cbot|function>functions</a>, <a cbot|class>classes</a>, <a cbot|var>variables</a>, <a cbot|array>arrays</a>, <a cbot|expr>expressions</a> and <a cbot|cond>conditions</a>.
hu: A CBOT nyelv szerkezetében és szintaxisában nagyon közel áll a C++-hoz és a Java-hoz, de a COLOBOT speciális céljaihoz és a hatékony pedagógiai megközelítéshez igazították. Ez a nyelv a következő elemekből épül fel: utasítások (lásd alább), <a cbot|bloc>blokkok</a>, <a cbot|function>függvények</a>, <a cbot|class>osztályok</a>, <a cbot|var>változók</a>, <a cbot|array>tömbök</a>, <a cbot|expr>kifejezések</a> és <a cbot|cond>feltételek</a>.

source: <code><format type>Type</format></code>
hu: <code><format type>Típus</format></code>

source: <code><format const>Constants</format></code>
hu: <code><format const>Konstansok</format></code>

source: Instructions in the CBOT language:
hu: Utasítások a CBOT nyelvben:

source: Specific instructions for bots:
hu: Botokra vonatkozó utasítások:

source: Instructions about topology:
hu: A felszínre vonatkozó utasítások:

source: Instructions specific to some bots:
hu: Csak bizonyos botokon elérhető utasítások:

source: Specific instructions for exchange posts:
hu: Információ továbbító oszlopok utasításai:

source: <code><a cbot|receive>receive</a> </code>Receives an information <code><a cbot|send>send</a> </code>Sends a new information <code><a cbot|testinfo>testinfo</a> </code>Tests if an information exists <code><a cbot|delinfo>deleteinfo</a> </code>Deletes an existing information
hu: <code><a cbot|receive>receive</a> </code>Egy információ fogadása <code><a cbot|send>send</a> </code>Egy új információ küldése <code><a cbot|testinfo>testinfo</a> </code>Megvizsgálja, hogy van-e információ <code><a cbot|delinfo>deleteinfo</a> </code>Töröl egy létező információt

source: Specific instructions for classes:
hu: Osztályokra vonatkozó utasítások:

source: Specific instructions for strings:
hu: Sztringekre vonatkozó utasítások:

source: <code><a cbot|strlen>strlen</a> </code>Gets string length <code><a cbot|strleft>strleft</a> </code>Extracts left part <code><a cbot|strright>strright</a> </code>Extracts right part <code><a cbot|strmid>strmid</a> </code>Extracts center part <code><a cbot|strfind>strfind</a> </code>Finds a substring. <code><a cbot|strval>strval</a> </code>Converts string to number <code><a cbot|strupper>strupper</a> </code>Converts to upper case <code><a cbot|strlower>strlower</a> </code>Converts to lower case
hu: <code><a cbot|strlen>strlen</a> </code>Megnézi a sztring hosszát <code><a cbot|strleft>strleft</a> </code>Kimásolja a baloldali részt <code><a cbot|strright>strright</a> </code>Kimásolja a jobboldali részt <code><a cbot|strmid>strmid</a> </code>Kimásolja a középső részt <code><a cbot|strfind>strfind</a> </code>Megkeres egy rész-sztringet <code><a cbot|strval>strval</a> </code>Számmá alakítja a sztringet <code><a cbot|strupper>strupper</a> </code>Nagybetűssé alakít <code><a cbot|strlower>strlower</a> </code>Kisbetűssé alapkít

source: Specific instructions for files:
hu: Állományokra vonatkozó utasítások:

source: <code><a cbot|open>open</a> </code>Opens a file <code><a cbot|close>close</a> </code>Closes a file <code><a cbot|writeln>writeln</a> </code>Writes line to a file <code><a cbot|readln>readln</a> </code>Reads line from a file <code><a cbot|eof>eof</a> </code>Tests if end of file <code><a cbot|deletef>deletefile</a> </code>Deletes a file
hu: <code><a cbot|open>open</a> </code>Megnyit el fájlt <code><a cbot|close>close</a> </code>Bezár egy fájlt <code><a cbot|writeln>writeln</a> </code>Fájlba ír egy sort <code><a cbot|readln>readln</a> </code>Fájlból olvas egy sort <code><a cbot|eof>eof</a> </code>Megnézi, hogy a fájl végén járunk-e <code><a cbot|deletef>deletefile</a> </code>Letöröl egy fájlt

source: See also
hu: Lásd még

source: <a cbot|type>Types</a> and <a cbot|category>categories</a>.
hu: <a cbot|type>Típusok</a> és <a cbot|category>kategóriák</a>.

source: Controls
hu: Irányítás

source: You are advised to play with one hand on the arrow keys and the other hand on the mouse.
hu: Az javasoljuk, hogy egyik kezedet a nyílbillentyűkön, a másik kezedet pedig az egéren tartva játssz.

source: Bots
hu: Botok

source: <format key><key left/></format> = turn left <format key><key right/></format> = turn right <format key><key up/></format> = move forward <format key><key down/></format> = move back These controls are unavailable when working with the <a object|bottr>practice bots</a>.
hu: <format key><key left/></format> = balra fordul <format key><key right/></format> = jobbra fordul <format key><key up/></format> = előre megy <format key><key down/></format> = tolat Ezek az iránybillentyűk a <a object|bottr>gyakorló botokon</a> nem működnek.

source: <format key><key gup/></format> = take off and climb <button 28/> <format key><key gdown/></format> = descend and land <button 29/> These controls are of course restricted to the <a object|human>astronaut</a> as well as the various <a object|botgj>winged bots</a> and in selected missions only.
hu: <format key><key gup/></format> = felszáll és emelkedik <button 28/> <format key><key gdown/></format> = ereszkedik és leszáll <button 29/> Természetesen ezek az iránybillentyűk csak az <a object|human>űrhajós</a> továbbá a különféle <a object|botgj>szárnyas bot</a>ok számra, és csak bizonyos küldetéseken használhatóak.

source: mouse forward = higher aim mouse backward = lower aim mouse right = aim right mouse left = aim left These controls are only available to the <a object|botfr>shooters</a>, the <a object|botor>orga shooters</a> and the <a object|botphaz>phazer shooter</a>.
hu: mouse előre = magasabbra céloz mouse hátra = lalacsonyabbra céloz mouse right = jobbra céloz mouse left = balra céloz Ezek az irányítások csak a <a object|botfr>lövegek</a>, az <a object|botor>orgavető</a> és a <a object|botphaz>pfézervető</a> számára lehetségesek.

source: <format key><key action/></format> = main action for a given selection (human or bot) This control will for example operate the arm of a <a object|botgr>grabber</a> or fire a <a object|botfr>shooter</a> <button 42/>.
hu: <format key><key action/></format> = elsődleges művelet a kiválasztott szereplő számára (ember vagy bot) Ez az irányítás tudja például működtetni a <a object|botgr>marok</a> karját, vagy tüzelni egy <a object|botfr>löveg</a>gel <button 42/>.

source: Selections
hu: Kiválasztás

source: <format key><key next/></format> = selects next object <format key><key human/></format> = selects astronaut <format key><key desel/></format> = previous selection <button 10/>
hu: <format key><key next/></format> = a következő tágy kiválsztása <format key><key human/></format> = az űrhajós kiválasztása <format key><key desel/></format> = előző kiválasztás <button 10/>

source: Camera
hu: Kamera

source: <format key><key camera/></format> = shifts between onboard and following cameras <button 13/> <format key><key near/></format> = zoom in <format key><key away/></format> = zoom out <format key><key visit/></format> = pauses the game and shows where the latest message originated. Press again to show origin of previous message.
hu: <format key><key camera/></format> = vált a fedélzeti és a követő kamera közt<button 13/> <format key><key near/></format> = közelít <format key><key away/></format> = távolít <format key><key visit/></format> = szünetelteti a játékot, és megmutatja honnan jött az utolsó üzenet. Ha ismét megnyomod, akkor az előző üzenet helyét mutatja.

source: Help
hu: Sugó

source: <format key><key help/></format> = mission instructions <format key><key prog/></format> = programming help
hu: <format key><key help/></format> = küldetés útmutatója <format key><key prog/></format> = programozási útmutató

source: Game
hu: Játék

source: All these commands can be redefined in the options/controls menu.
hu: Ezek az parancsok mind átállíthatóak a beállítások/irányítás menüben.

source: Objective
hu: Célkitűzés

source: Here you can play around without any definite objective. You can do whatever you want, explore the region, build a base camp and several bots, run various research programs, kill the insects if you find some, etc.
hu: Itt bármilyen előre meghatározott cél nélkül játszhatsz. Azt csinálhatsz, amit csak akarsz: felderítheted a területet, építhetsz egy alaptábort valamint botokat, különféle kutatási programokat futtathatsz, kiirthatod a rovarokat (ha találsz), stb.

source: <a command>Controls</a>.
hu: <a command>Irányítás</a>.

source: The photograph of the nebula NGC3606 illuminating the sky on Orpheon and the installation program was taken with the Hubble space telescope. It is used with the permission of the authors Wolfgang Brandner (JPL/IPAC), Eva K. Grebel (Washington University), You-Hua Chu (Illinois Urbana-Champaign University) and NASA.
hu: Az Orpheon égboltját megvilágító NGC3606 köd fényképe és a telepítési program a Hubble űrteleszkóppal készült. A szerzők Wolfgang Brandner (JPL/IPAC), Eva K. Grebel (Washington Egyetem), You-Hua Chu (Illinois Urbana-Champaign Egyetem) és a NASA engedélyével használják.

source: The thunder sound on Orpheon is used by limited permission from CREATIVE.
hu: Az Orpheon mennydörgés hangját a CREATIVE korlátozott engedélyével használjuk.

source: Navigation
hu: Navigáció

source: The three buttons on the upper left-hand corner of the screen allow you to navigate in the different texts of the help file:
hu: A képernyő bal felső sarkában található három gomb segítségével navigálhatsz a súgófájl különböző szövegei között:

source: <button 30/> Home Get back to the home page, i.e. the first page that was displayed, for example when you hit the <format key><key help/></format> or <format key><key prog/></format> key.
hu: <button 30/> Kezdőlap Visszatér a kezdőlapra, azaz az első megjelenített oldalra, például amikor megnyomod a <format key><key help/></format> vagy a <format key><key prog/></format> gombot.

source: <button 55/> Previous Get back to the previous page, i.e. the page that was displayed before you clicked on a link.
hu: <button 55/> Előző Visszatér az előző oldalra, vagyis arra az oldalra, amely a hivatkozásra kattintás előtt megjelent.

source: <button 48/> Next Get again to the next page, after you used the "Home" or "Previous" button.
hu: <gomb 48/> Következő Újra a következő oldalra visz, a "Kezdőlap" vagy az "Előző" gomb használata után.

source: Remark
hu: Megjegyzés

source: When a button is gray, this means that it can not be used at this precise moment. For example, when you are in the home page, the "Home" button is gray, because it does not make sense to use it. This remark is valid for all buttons in COLOBOT.
hu: Ha egy gomb szürke, az azt jelenti, hogy az adott pillanatban nem használható. Például, amikor a kezdőlapon vagy, a "Kezdőlap" gomb szürke, mert nincs értelme használni. Ez a megjegyzés a COLOBOT összes gombjára érvényes.

source: Text scrolling
hu: Szöveg görgetése

source: If your mouse is equipped with a wheel, you can use it to scroll the text up and down. Otherwise, use the arrow keys and the scroll bar on the right-hand side of the screen.
hu: Ha az egerednek van kereke, akkor azzal görgetheted a szöveget fel és le. Egyébként pedig használd a nyílbillentyűket és a képernyő jobb oldalán található görgetősávot.

source: Font size
hu: Betűméret

source: The cursor on the upper side of the screen allows you to change the font size of the text.
hu: A képernyő felső részén található kurzor segítségével állíthatod a szöveg betűméretét.

source: Houston congratulates you in the name of mankind for the success of your mission. The Great Migration to Terra Nova will start very soon.
hu: Houston az emberiség nevében gratulál küldetésed sikeréhez. Hamarosan megkezdődik a "Nagy Költözés a Terra Novára".

source: Developers and internal betatesters of Original COLOBOT game from EPSITEC
hu: Az EPSITEC eredeti COLOBOT játékának fejlesztői és belső betateszterei

source: Colobot: Gold Edition developers
hu: Colobot: Gold Edition fejlesztői

source: Code battles
hu: Kódcsaták

source: Code battle is a completely new game mode featured in Colobot: Gold Edition. The idea is that you set up two programs (yours and the opponent's) to fight with each other. The player can't interact with the world manually.
hu: A kódcsata egy teljesen új játékmód a Colobot: Gold Edition játékban. Az ötlet az, hogy két programot állítasz fel (a tiédet és az ellenfélét), hogy harcoljanak egymással. A játékos nem avatkozhat be a világba közvetlenül.

source: With the new functions provided in the Gold Edition, you can create a fully automatised base, which does not need any influence from <a object|human>human</a>. All of them are described in the <a cbot>CBOT documentation</a>.
hu: A Gold Edition új funkcióival teljesen automatizált bázist hozhatsz létre, amelynek egyáltalán nincs szüksége <a object|human>ember</a>i befolyásra. Mindegyikről találsz leírást a <a cbot>CBOT-dokumentációban</a>.

source: Production line is explained in Missions and Exercises, but you may want to jump into code battles right away without beating the whole game. So here is a brief description of how the things works in Colobot.
hu: A gyártási sort a Küldetések és Gyakorlatok során magyarázzuk el, de belevághatsz a kódcsatákba anélkül is, hogy a teljes játékod végigjátszanád. Ezért íme egy rövid leírás a Colobot működéséről.

source: What you want to achieve
hu: Amit el szeretnél érni

source: Basically, you want to destroy the opponent. To do that, you will need something lethal, for example, a robot, specifically, a <a object|botfr>shooter</a>. But you will probably be losing them quite often, so maybe you should keep the production going on. For example, more <a object|botgr>grabbers</a> or more <a object|factory>factories</a>, <a object|convert>converters</a> and so on would be helpful in that. Remember that robots needs <a object|power>batteries</a>. Anyway, before you can start, you must also do some <a object|research>researches</a> to get better technologies. And here we are at the beginning, with a single <a object|botgr>robot</a> and a <a object|titan>Titanium</a>.
hu: Alapvetően az ellenfelet kell elpusztítani. Ehhez szükség van valami halálos dologra, például egy robotra, konkrétan egy <a object|botfr>lövegre</a>. De mivel várhatóan sokat fogsz belőlük elveszíteni, ezért fenntartani a gyártásukat. Például több <a object|botgr>marok</a> vagy több <a object|factory>gyár</a>, <a object|convert>konverter</a> és így tovább hasznodra lenne ebben. Ne feledd, hogy a robotoknak <a object|power>energia cellá</a>kra van szükségük. Épp ezért, mielőtt belevágsz, végre kell hajtanod pár <a object|research>kutatást</a>, hogy fejlettebb technológiákra tehess szert. És ezzel el is érkeztünk a kiinduló ponthoz, egyetlen <a object|botgr>robottal</a> és egy <a object|titan>titánnal</a>.

source: Titanium production
hu: Titánium termelés

source: 1. <a cbot|radar>Find</a> a <a object|titan>Titanium</a>. 2. <a cbot|build>Build</a> a <a object|convert>Converter</a>. 3. Find a <a object|titanore>TitaniumOre</a>. 4. Place it in the converter. Move back and wait until the converter is done. 5. Use or move somewhere your new Titanium. Repeat steps 3-5 in order to keep your production going.
hu: 1. <a cbot|radar>Keress</a> egy <a object|titan>Titánium</a>ot. 2. <a cbot|build>Építs</a> egy <a object|convert>Konverter</a>t. 3. Keress egy <a object|titanore>TitániumÉrc</a>et. 4. Helyezd a konverterbe. Lépj hátra, és várj amíg a konverter nem készül. 5. Hasznosítsd vagy helyezd el valahol az új Titnániumodat. Ismételgesd a 3-5. lépést a termelés fenntartásához.

source: Researches
hu: Kutatások

source: 1. <a cbot|build>Build</a> a <a object|research>ResearchCenter</a>. 2. Power it with a <a object|power>PowerCell</a>. 3. <a cbot|research>Request</a> a <a cbot|researches>research</a> and wait until the research center is done.
hu: 1. <a cbot|build>Építs</a> egy <a object|research>KutatóKözpont</a>ot. 2. Lásd el árammal egy <a object|power>EnergiaCellával</a>. 3. <a cbot|research>Indíts</a> egy <a cbot|researches>kutatást</a>, és várd ki amíg a kutató központ elkészül.

source: Robot production
hu: Robot termelés

source: 1. <a cbot|build>Build</a> a <a object|factory>BotFactory</a>. 2. Place a <a object|titan>Titanium</a> inside and move back. 3. <a cbot|factory>Request</a> a construction of a robot and wait until the bot factory is done. 4. Power the robot with a <a object|power>PowerCell</a>.
hu: 1. <a cbot|build>Építs</a> egy <a object|factory>BotGyár</a>at. 2. Helyezz bele egy <a object|titan>Titánium</a>ot és lépj hátra. 3. <a cbot|factory>Indítsd el</a> a egy robot gyártását, és várj amíg elkészül. 4. Lásd el a robot árammal egy <a object|power>energia cella</a> behelyezésével.

source: Power cell production
hu: Energia cella termelés

source: 1. <a cbot|build>Build</a> a <a object|energy>PowerPlant</a>. 2. Place a <a object|titan>Titanium</a> in it and wait until the power plant is done.
hu: 1. <a cbot|build>Építs</a> egy <a object|energy>Erőművet</a>. 2. Helyezz bele egy <a object|titan>Titánium</a>ot, és várj amíg a cella el nem készül.

source: There is more
hu: Tovább is van

source: There is much more options, but this is the basis. Read documentation, play the game and think creatively to come up with new ideas. Good luck and have fun!
hu: Ennél jóval több lehetőség van, de ez az alap. Olvasd el a dokumentációt, játssz a játékkal, és gondolkodj kreatívan, állj elő új ötletekkel. Sok sikert, és jó szórakozást!

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
hu: <a cbot>Programozás</a>, <a cbot|type>típusok</a> és <a cbot|category>kategóriák</a>.

source: <code><a cbot|extern>extern</a> </code>Indicate the main function <code><a cbot|if>if</a> </code>Choice structure <code><a cbot|if>else</a> </code>Alternative choice structure <code><a cbot|switch>switch</a> </code>Multiple choice structure <code><a cbot|switch>case</a> </code>One choice <code><a cbot|switch>default</a> </code>Default choice <code><a cbot|for>for</a> </code>Loop structure <code><a cbot|while>while</a> </code>Control structure <code><a cbot|do>do</a> </code>Control structure <code><a cbot|break>break</a> </code>Exit from a loop <code><a cbot|continue>continue</a> </code>Continues the loop <code><a cbot|return>return</a> </code>Exit from a function <code><a cbot|sizeof>sizeof</a> </code>Size of an array
hu: <code><a cbot|extern>extern</a> </code>A main függvényt jelöli <code><a cbot|if>if</a> </code>Feltételes utasítás <code><a cbot|if>else</a> </code>A másik lehetőség <code><a cbot|switch>switch</a> </code>Többválasztós szerkezet <code><a cbot|switch>case</a> </code>Az egyik választás <code><a cbot|switch>default</a> </code>Alapértelmezett választás <code><a cbot|for>for</a> </code>Előírt ciklus <code><a cbot|while>while</a> </code>Ciklus feltétel <code><a cbot|do>do</a> </code>Ciklus <code><a cbot|break>break</a> </code>Kitörés a ciklusból <code><a cbot|continue>continue</a> </code>Ciklus folytatása <code><a cbot|return>return</a> </code>Visszatérés a függvényből <code><a cbot|sizeof>sizeof</a> </code>Tömb mérete

source: <code><a cbot|space>space</a> </code>Calculates a free space <code><a cbot|flatspace>flatspace</a> </code>Calculates a free, flat space <code><a cbot|topo>topo</a> </code>Returns the altitude of a point <code><a cbot|flatgrnd>flatground</a> </code>Returns radius of a flat area
hu: <code><a cbot|space>space</a> </code>Szabad hely kiszámítása <code><a cbot|flatspace>flatspace</a> </code>Szabad, lapos hely kiszámítása <code><a cbot|topo>topo</a> </code>Visszadja egy adott pont magasságát <code><a cbot|flatgrnd>flatground</a> </code>Visszadja a lapos terület sugarát

source: Mathematical functions:
hu: Matematikai függvények:

source: <code><a cbot|rand>rand</a> </code>Returns a random value <code><a cbot|pow>pow</a> </code>Returns a power <code><a cbot|sqrt>sqrt</a> </code>Returns a square root <code><a cbot|floor>floor</a> </code>Returns the largest previous integer <code><a cbot|ceil>ceil</a> </code>Returns the smallest following integer <code><a cbot|round>round</a> </code>Returns a rounded number <code><a cbot|trunc>trunc</a> </code>Returns a truncated number <code><a cbot|sin>sin</a> </code>Returns a sine <code><a cbot|cos>cos</a> </code>Returns a cosine <code><a cbot|tan>tan</a> </code>Returns a tangent <code><a cbot|asin>asin</a> </code>Returns an arcus sine <code><a cbot|acos>acos</a> </code>Returns an arcus cosine <code><a cbot|atan>atan</a> </code>Returns an arcus tangent <code><a cbot|atan2>atan2</a> </code>Returns an arcus tangent, has two arguments
hu: <code><a cbot|rand>rand</a> </code>Véltlen szám <code><a cbot|pow>pow</a> </code>Hatványozás <code><a cbot|sqrt>sqrt</a> </code>Négyzetgyök vonás <code><a cbot|floor>floor</a> </code>Legnagyobb megelőző egész <code><a cbot|ceil>ceil</a> </code>Legkissebb rákövetkező egész <code><a cbot|round>round</a> </code>Kerekítés <code><a cbot|trunc>trunc</a> </code>Csonkítás <code><a cbot|sin>sin</a> </code>Szinusz <code><a cbot|cos>cos</a> </code>Koszinusz <code><a cbot|tan>tan</a> </code>Tangens <code><a cbot|asin>asin</a> </code>Arkusz szinusz <code><a cbot|acos>acos</a> </code>Arkusz koszinusz <code><a cbot|atan>atan</a> </code>Arkusz tangens <code><a cbot|atan2>atan2</a> </code>Arkusz tangens, két argumentumos

source: The <a cbot|type>type</a> of a variable appears like that: <format type>type</format>.
hu: Egy változó <a cbot|type>típusa</a> így jelenik meg: <format type>típus</format>.

source: Constants like <a cbot|category>categories</a> are displayed like that: <format const>constant</format>.
hu: A konstansok, mint pl. a <a cbot|category>kategóriák</a> így jelennek meg: <format const>konstans</format>.

source: <a cheats>o</a> |c;<format token>Instructions</format><n/> In the program editor, an instruction in the CBOT language is always displayed like that: <format token>instruction</format>. If an instruction is not highlighted, this means that it has been misspelled. Instruction names are always written in lower case.
hu: <a cheats>o</a> |c;<format token>Utasítások</format><n/> A program szerkesztőben, egy CBOT utasítás mindig így jelenik meg: <format token>utasítás</format>. Ha egy utasítás nincs kiemelve, az azt jelenti hogy elírtad. Az utasítás neveket mindig kisbetűvel írjuk.

source: Cheats
hu: Csalások

source: Great, you have found this secret page. We hope you will use informations contained here only for other than cheating purposes. Like testing the game or recording a cool video about Colobot.
hu: Remek, megtaláltad ezt a titkos oldalt. Reméljük, hogy az itt található információkat nem csalásra fogod használni, hanem pl. a játék tesztelése vagy egy klassz videó rögzítése a Colobotról.

source: Console
hu: Konzol

source: You can open the console by pressing the <key/><code>~</code><norm/> button on your keyboard. Press <key/><code>ENTER</code><norm/> to hide it or pass one of the commands below.
hu: A konzolt a <key/><code>~</code><norm/> gomb megnyomásával hívhatod elő. Az <key/><code>ENTER</code><norm/> eltüntetheted, vagy beadhatod az alábbi parancsok valamelyikét.

source: Missions
hu: Küldetések

source: Gameplay
hu: Játékmenet

source: Debug
hu: Hibakeresés

source: Aesthetic
hu: Esztétika
