Repository: muudry/colobot-data
Catalog: help/generic/po/*.po
Languages: hu

source: <code><a cbot|produce>produce</a> </code>Immediately creates an object
hu: <code><a cbot|produce>produce</a> </code>Azonnal létrehoz egy tárgyat

source: <code>winmission </code>Immediately win the current mission
hu: <code>winmission </code>Azonnal megnyeri az aktuális küldetést

source: <code>lostmission </code>Immediately lose the current mission
hu: <code>lostmission </code>Azonnal elveszíti az aktuális küldetést

source: <code>allresearch </code>All researches are done
hu: <code>allresearch </code>Minden kutatást készre állít

source: <code>allbuildings </code>All buildings are enabled
hu: <code>allbuildings </code>Minden épületet engedélyez

source: <code>fullenergy </code>Restore energy in the currently selected bot
hu: <code>fullenergy </code>Feltölti energiával az éppen kijelölt botot

source: <code>fullshield </code>Restore shield in the currently selected object
hu: <code>fullshield </code>Helyreállítja az épp kiválasztott bot pajzsát

source: <code>fullrange </code>Flying reactor is cold
hu: <code>fullrange </code>A repülő reaktora lehűl

source: <code>fly </code>You can fly even if flying is disabled in the current mission
hu: <code>fly </code>Akkor is repülhetsz, ha az le van tiltva az aktuális küldetésen

source: <code>addfreezer </code>Flying reactor heats more slowly
hu: <code>addfreezer </code>A repülő reaktora lassabban melegszik

source: <code>addhusky </code>You take less damage than usual
hu: <code>addhusky </code>A szokásosnál kevésbé sebződsz

source: <code>nolimit </code>You can fly higher
hu: <code>nolimit </code>Magasabbra repülhetsz

source: <code>trainerpilot </code>You can drive robots which could be previously controlled only by programs
hu: <code>trainerpilot </code>Azokat a robotokat is irányíthatod, amiket csak programokkal lehet vezérelni

source: <code>photo1 </code>Free camera, you can change angle with <key/><code>+</code><norm/> and <key/><code>-</code><norm/> keys, type again to set it off
hu: <code>photo1 </code>Szabad kamera, a szöget a <key/><code>+</code><norm/> és <key/><code>-</code><norm/> gombokkal állíthatod. Ha újra kiadod, kikapcsol.

source: <code>photo2 </code>Same as <code>photo1</code>, except it hides interface, type again to set it off
hu: <code>photo2 </code>Ugyan az mint <code>photo1</code>, de felületet is elrejti. Ha újra kiadod, kikapcsol.

source: <code>delete </code>Damages the object, <code>1</code>: object's ID, <code>2</code>: magnifyDamage multiplier, without <code>2</code> the object explodes
hu: <code>delete </code>Megsebzi a tárgyat, <code>1</code>: objektum azonosítója, <code>2</code>: magnifyDamage szorzó, a <code>2</code>-es nélkül a tárgy felrobban

source: <code>setbuild </code>Sets buildings bitmask, <code>1</code>: new bitmask
hu: <code>setbuild </code>Beállítja az épület bitmaszkot, <code>1</code>: új bitmaszk

source: <code>setresearchenable </code>Sets researches bitmask, <code>1</code>: new bitmask
hu: <code>setresearchenable </code>Beállítja a kutatások bitmaszkot, <code>1</code>: új bitmaszk

source: <code>setresearchdone </code>Sets done researches bitmask, <code>1</code>: new bitmask
hu: <code>setresearchdone </code>Beállítja a kész kutatások bitmaszkját, <code>1</code>: új bitmaszk

source: <code>getbuild </code>Returns buildings bitmask
hu: <code>getbuild </code>Visszadja a épületek bitmszkját

source: <code>getresearchenable </code>Returns researches bitmask
hu: <code>getresearchenable </code>Visszaadja a kutatások bitmaszkját

source: <code>getresearchdone </code>Returns done researches bitmask
hu: <code>getresearchdone </code>Visszaadja a kész kutatások bitmaszkját

source: <code>playmusic </code>Plays music, <code>1</code>: file name, <code>2</code>: repeat
hu: <code>playmusic </code>Elindítja a zenét, <code>1</code>: fájl név, <code>2</code>: ismétlés

source: <code>stopmusic </code>Stops music
hu: <code>stopmusic </code>Megállítja a zenét

source: <code>allmission </code>All missions are unlocked, works also in main menu
hu: <code>allmission </code>Az összes küldetést engedélyezi. A főmenüben is működik.

source: <code>showsoluce </code>All solutions are unlocked, works also in main menu
hu: <code>showsoluce </code>Minden megoldást engedélyez. A főmenüben is működik.

source: <code>selectinsect </code>You can select and control aliens, works also in main menu, type again to disable
hu: <code>selectinsect </code>A rovarok kiválaszthatók és irányíthatók lesznek. A főmenüben is működik. Ha újra kiadod, kikapcsol.

source: <code>invradar </code>Mini-map works like you would have built a <a object|radar>radar</a>, works also in main menu, type again to disable
hu: <code>invradar </code>A mini-térkép úgy működik, mintha meg lenne építve a <a object|radar>radar</a>. A főmenüben is működik. Ha újra kiadod, kikapcsol.

source: <code>noclip </code>The currently selected object can pass through objects
hu: <code>noclip </code>A jelenleg kiválasztott tárgy át tud haladni más tárgyakon.

source: <code>clip </code>Disable <code>noclip</code> on the currently selected object
hu: <code>clip </code>Letiltja a <code>noclip</code>-et a jelenleg kiválasztott tágyon

source: <code>speed </code>Set the speed of the game to the given number, for example <code>speed 2</code> - two times faster, <code>speed 0.5</code> - two times slower, works also in main menu
hu: <code>speed </code>Adott számnak megfelelőre állítja a játék sebességét. Pl. a <code>speed 2</code> - kétszeres gyorsaság, <code>speed 0.5</code> - kétszer olyan lassú. A főmenüben is működik.

source: These commands work also in main menu. Type them again to set them off.
hu: Ezek a parancsok a főmenüben kiadva is működnek. Újra kiadva kikapcsolnak.

source: <code>showstat </code>Show debug statistics on the screen, <format key>F12</format> keyboard key has the same effect
hu: <code>showstat </code>Hibakeresési statisztikákat jelenít meg a képernyőn. A(z) <format key>F12</format> billentyűvel azonos hatású.

source: <code>debugmode </code>Enable debug mode (useful for the game developers): the verbose debugging of events and other things; make sure you run the game with <code>-loglevel trace</code> to see the effect; see also <code>-debug</code> commandline parameter
hu: <code>debugmode </code>A hibakeresési mód engedélyezése (hasznos a játékfejlesztők számára): események és egyéb dolgok részletes hibakeresése; győződj meg róla, hogy a <code>-loglevel trace</code> segítségével futtatod a játékot a hatás megtekintéséhez; lásd még a <code>-debug</code> parancssori paramétert

source: There are hidden commands in CBOT that are not even highlighted in the editor. They are considered cheating, so do not use them for "legal" programs. It should be fine to use them for level creation though if there is no other way. Numbers mean order of parameters.
hu: A CBOT-ban vannak olyan rejtett parancsok, amelyek nem kerülnek kiemelésre a szerkesztőben. Csalásnak minősülnek, ezért ne használd őket "rendes" programokhoz. Szint készítésnél nem gond a használatuk, ha nincs más lehetőség. A számok a paraméterek sorrendjét jelentik.

source: <code>ipf </code>Sets the number of instructions per frame, <code>1</code>: the number, default is <code>100</code>
hu: <code>ipf </code>Beállítja az utasítások számát képkockánként, <code>1</code>: a szám, alapértelmezés szerint <code>100</code>

source: Basics of production line\m production;
hu: A gyártósor alapjai\m termelés;

source: How to control the level
hu: A szint irányítása

source: Starting a code battle
hu: Kódcsata indítása

source: Controlling the spectator's view
hu: A néző nézetének szabályozása

source: After a code battle is started, the camera is put into a special mode:
hu: A kódcsata elindítása után a kamera speciális módba kerül:

source: In order to start a code battle you need to: 1. Run all the necessary programs for your/all team(s). 2. Press the <button 21/> button above the mini-map.
hu: A kódcsata elindításához a következőket kell tenned: 1. Futtasd az összes szükséges programot a csapat(aid) számára. 2. Nyomd meg a <button 21/> gombot a minitérkép felett.

source: One can select objects as a player normally would, but one will not see their interface and the camera does not rotate when the object rotates. One can also use numerical keyboard instead of mouse in order to rotate the object-centered camera.
hu: Az objektumokat úgy lehet kiválasztani, ahogy azt egy játékosok általában tenné, de a felületük nem jelenik meg, és a kamera sem forog, amikor az objektum elfordul. Az objektum-központú kamera forgatásához egér helyett a numerikus billentyűzetet is használhatjuk.

source: One can return to the normal view by pressing the <button 13/> button above the mini-map.
hu: A normál nézethez a minitérkép feletti <button 13/> megnyomásával lehet visszatérni.

source: One can also switch to the free camera view by clicking somewhere on the map. One can move around in this view by using the numerical keyboard and <format key>PageUp</format>/<format key>PageDown</format> keys.
hu: A térképre kattintva szabad kameranézetre is válthatsz. Ebben a nézetben a numerikus billentyűzet és a <format key>PageUp</format>/<format key>PageDown</format> billentyűkkel tudsz mozogni.

source: <code><a cbot|class>class</a> </code>Class declararion <code><a cbot|public>public</a> </code>Declares a public class member <code><a cbot|private>private</a> </code>Declares a private class member <code><a cbot|protected>protected</a> </code>Declares a protected class member <code><a cbot|static>static</a> </code>Declares a static class member <code><a cbot|synchro>synchronized</a> </code>Prevents simultaneous execution <code><a cbot|new>new</a> </code>Creates a new instance <code><a cbot|this>this</a> </code>Reference to the current instance <code><a cbot|extends>extends</a> </code>Extends a class <code><a cbot|super>super</a> </code>Grants access to the parent class
hu: <code><a cbot|class>class</a> </code>Osztály deklaráció <code><a cbot|public>public</a> </code>Nyilvános osztály-tag deklaráció <code><a cbot|private>private</a> </code>Magán osztály-tag deklaráció <code><a cbot|protected>protected</a> </code>Védett osztály-tag deklaráció <code><a cbot|static>static</a> </code>Statikus osztály-tag deklaráció <code><a cbot|synchro>synchronized</a> </code>Megakadályozza az egyidejű végrehajtást <code><a cbot|new>new</a> </code>Új példányt hoz létre <code><a cbot|this>this</a> </code>Az aktuális példányra hivatkozik <code><a cbot|extends>extends</a> </code>Kiegészít egy osztályt <code><a cbot|super>super</a> </code>A szülőosztályhoz nyújt hozzáférést

source: <format key><key speed_dec/></format> = slow down speed by half <format key><key speed_reset/></format> = normal speed x1 <format key><key speed_inc/></format> = increase speed twice <format key><key quicksave/></format> = quick save <format key><key quickload/></format> = quick load <format key><key quit/></format> = exits mission <button 11/>
hu: <format key><key speed_dec/></format> = felére lassít <format key><key speed_reset/></format> = normál sebesség x1 <format key><key speed_inc/></format> = kétszeresére gyorsít <format key><key quicksave/></format> = gyorsmentés <format key><key quickload/></format> = gyorstöltés <format key><key quit/></format> = kilép a küldetésből <button 11/>

source: <code><a cbot|detect>detect</a> </code>Simple object detection <code><a cbot|radar>radar</a> </code>Advanced object detection <code><a cbot|radarall>radarall</a> </code>Advanced multiple objects detection <code><a cbot|search>search</a> </code>Object detection from a specific point <code><a cbot|direct>direction</a> </code>Calculates a rotation angle <code><a cbot|dist>distance</a> </code>Calculates a distance <code><a cbot|dist2d>distance2d</a> </code>Calculates a distance <code><a cbot|wait>wait</a> </code>Waits <code><a cbot|move>move</a> </code>Moves forward or backward <code><a cbot|turn>turn</a> </code>Turns <code><a cbot|goto>goto</a> </code>Goes to a given position <code><a cbot|motor>motor</a> </code>Direct motor control <code><a cbot|jet>jet</a> </code>Direct jet engine control <code><a cbot|message>message</a> </code>Displays a message <code><a cbot|retobj>retobject</a> </code>Returns an object from a function <code><a cbot|errmode>errmode</a> </code>Error treatement control <code><a cbot|abstime>abstime</a> </code>Returns the absolute time <code><a cbot|pendown>pendown</a> </code>Starts drawing <code><a cbot|penup>penup</a> </code>Stops drawing <code><a cbot|pencolor>pencolor</a> </code>Changes the pen color <code><a cbot|penwidth>penwidth</a> </code>Changes the pen width <code><a cbot|factory>factory</a> </code>Starts construction of a bot <code><a cbot|research>research</a> </code>Starts a research <code><a cbot|takeoff>takeoff</a> </code>Launches a spaceship <code><a cbot|isbusy>isbusy</a> </code>Checks if object is busy <code><a cbot|canresearch>canresearch</a></code>Checks if a technology can be researched <code><a cbot|researched>researched</a> </code>Checks if a technology is researched <code><a cbot|canbuild>canbuild</a> </code>Checks if a building can be built <code><a cbot|buildingenabled>buildingenabled</a> </code>Checks if a building is available during current mission
hu: <code><a cbot|detect>detect</a> </code>Egyszerű tárgy észlelés <code><a cbot|radar>radar</a> </code>Haladó tárgy észlelés <code><a cbot|radarall>radarall</a> </code>Haladó, több tárgy észlelése <code><a cbot|search>search</a> </code>Tágy észlelése egy adott pontból <code><a cbot|direct>direction</a> </code>Kiszámítja a forgatás szögét <code><a cbot|dist>distance</a> </code>Kiszámítja a távolságot <code><a cbot|dist2d>distance2d</a> </code>Kiszámítja a távolságot <code><a cbot|wait>wait</a> </code>Várakozik <code><a cbot|move>move</a> </code>Előre vagy hátra mozog <code><a cbot|turn>turn</a> </code>Fordul <code><a cbot|goto>goto</a> </code>Egy adott pontra megy <code><a cbot|motor>motor</a> </code>Közvetlen motor vezérlés <code><a cbot|jet>jet</a> </code>Közvetlen sugárhajtómű vezérlés <code><a cbot|message>message</a> </code>Megjelenít egy üzenetet <code><a cbot|retobj>retobject</a> </code>Egy objektummal tér vissza a függvényből <code><a cbot|errmode>errmode</a> </code>Hibakezelés szabályozása <code><a cbot|abstime>abstime</a> </code>Az abszolút időt adja <code><a cbot|pendown>pendown</a> </code>Rajzolni kezd <code><a cbot|penup>penup</a> </code>Befejezi a rajzolást <code><a cbot|pencolor>pencolor</a> </code>Beállítja a toll színét <code><a cbot|penwidth>penwidth</a> </code>Beállítja a toll vastagságát <code><a cbot|factory>factory</a> </code>Elkezdi egy robot gyártását <code><a cbot|research>research</a> </code>Elkezd egy kutatást <code><a cbot|takeoff>takeoff</a> </code>Fellövi az űrhajót <code><a cbot|isbusy>isbusy</a> </code>Megnézi, hogy elfoglalt-e a tárgy <code><a cbot|canresearch>canresearch</a></code>Megnézi, hogy a technológia kutatható-e <code><a cbot|researched>researched</a> </code>Megnézi, hogy a technológia ki van-e kutatva <code><a cbot|canbuild>canbuild</a> </code>Megnézi, hogy egy épület építhető-e <code><a cbot|buildingenabled>buildingenabled</a> </code>Megnézi, hogy egy épület elérhető-e ebben a küldetésben

source: <code><a cbot|grab>grab</a> </code>Picks up an object <code><a cbot|drop>drop</a> </code>Puts down an object <code><a cbot|sniff>sniff</a> </code>Sounds the subsoil <code><a cbot|thump>thump</a> </code>Overturns alien insects <code><a cbot|recycle>recycle</a> </code>Recycles a derelict bot <code><a cbot|shield>shield</a> </code>Extends or withdraws the shield <code><a cbot|fire>fire</a> </code>Fires the cannon <code><a cbot|aim>aim</a> </code>Rotates the cannon <code><a cbot|build>build</a> </code>Builds a building <code><a cbot|flag>flag</a> </code>Plants a flag <code><a cbot|deflag>deflag</a> </code>Removes a flag
hu: <code><a cbot|grab>grab</a> </code>Megragad egy tárgyat <code><a cbot|drop>drop</a> </code>Leteszi a tárgyat <code><a cbot|sniff>sniff</a> </code>Megszondázza az altalajt <code><a cbot|thump>thump</a> </code>Felborítja az idegen rovarokat <code><a cbot|recycle>recycle</a> </code>Újrahsznosít egy elhagyott botot <code><a cbot|shield>shield</a> </code>Kinyitja vagy bevonja a pajzsot <code><a cbot|fire>fire</a> </code>Tüzel az ágyúval <code><a cbot|aim>aim</a> </code>Forgatja az ágyút <code><a cbot|build>build</a> </code>Felhúz egy épületet <code><a cbot|flag>flag</a> </code>Leszúr egy zászlót <code><a cbot|deflag>deflag</a> </code>Eltávolít egy zászlót
