Repository: muudry/colobot-data
Catalog: levels/exercises/chapter003/level003/po/*.po
Languages: hu

source: Massacre
hu: Mészárlás

source: Use a loop in order to destroy six targets.
hu: Pusztíts el hat célpontot ciklus segítségével.

source: Go
hu: Menj

source: Exercise
hu: Gyakorlat

source: Destroy the six <a object|bottarg>targets</a> with a program using a loop. The bot must move 5m forward to get from one target to the next.
hu: Pusztítsd el a hat <a object|bottarg>céltárgyat</a> egy ciklust használó programmal. A botnak 5m-ert kell előre mennie az egyik célponttól a másikig.

source: General principle
hu: Alapelv

source: move 5m forward
hu: mozogj 5m-t előre

source: turn 90 degrees left
hu: fordulj 90 fokot balra

source: shoot
hu: lőj

source: turn 90 degrees right
hu: fordulj 90 fokot jobbra

source: Instruction <code>for ( )</code>
hu: A <code>for ( )</code> utasítás

source: Initialize the counting variable.
hu: A ciklusszámláló inicializálása (induló helyzetbe állítása).

source: The end <a cbot|cond>condition</a>.
hu: A <a cbot|cond>végfeltétel</a>.

source: The counting <a cbot|expr>expression</a>.
hu: A léptető <a cbot|expr>kifejezés</a>.

source: Here is the loop once it is integrated into the program frame:
hu: Így fog kinézni a ciklus, miután beépítetted a program keretbe:

source: <c/>extern void object::Massacre( ) { for ( int i=0 ; i<6 ; i=i+1 ) { <n/>instructions repeated 6 times ...<c/> } }
hu: <c/>extern void object::Mészárlás( ) { for ( int i=0 ; i<6 ; i=i+1 ) { <n/>A hatszor ismétlendő utasítások ...<c/> } }

source: ATTENTION: The line <code>for ( )</code> must not be followed by a <a cbot|term>semicolon</a> !
hu: FIGYELEM: A <code>for ( )</code> sor végére nem szabad <a cbot|term>pontosvesszőt</a> írni !

source: Explanation of the instruction <code>for ( )</code>
hu: A <code>for ( )</code> utasítás magyarázata

source: The <a cbot|var>variable</a> i is set to zero before the beginning of the loop.
hu: Az i <a cbot|var>változót</a> nullára állítjuk a ciklus megkezdése előtt.

source: The loop will be executed as long as i is smaller than 6.
hu: A ciklus addig fog futni, amíg az i értéke kisebb mint 6.

source: At the end of every loop, add 1 to the variable i.
hu: Minden ciklus végén egyet kell hozzáadni az i változó értékéhez.

source: Blocks
hu: Blokkok

source: Use braces <code>{ }</code> in order to create a <a cbot|bloc>block</a>. All the instructions that must be executed in the <code>for</code> loop are held together by a block. The whole program itself is made up of a block:
hu: A kapcsos zárójelek <code>{ }</code> segítségével lehet <a cbot|bloc>blokkokat</a> csinálni. A <code>for</code> ciklus által végrehajtandó összes utasítást egy blokk "tartja egyben". Maga a teljes program is egy blokk:

source: extern void object::massacre( ) { <n/>fill in here ...<c/> }
hu: extern void object::Mészárlás( ) { <n/>Ide írhatsz ...<c/> }

source: Never change these characters. Just add the instructions of the program between the braces. You can fit several blocks one into the other. For example the <code>for</code> block is fitted into the block of the whole program. In order to improve readability, the editor lines up the braces belonging to the different blocks.
hu: Magán a kereten sosem kell változtatod a gyakorlatok során. Egyszerűen csak be kell írnod a programod utasításait a kapcsok közé. A blokkokat egymásba is lehet rakni. Tehát egy blokk tartalmazhat további blokkokat. Például a <code>for</code> blokk is a teljes program blokkjában van. A jobb olvashatóság érdekében a szerkesztő egy vonalba húzza az adott blokkhoz tartozó sorokat.

source: Remember
hu: Ne feledd

source: The instruction used to move forward is <c/><a cbot|move>move</a>();<n/>. The instruction used to turn the bot is <c/><a cbot|turn>turn</a>();<n/>. A positive angle turns left. The instruction used to fire the cannon is <c/><a cbot|fire>fire</a>(1);<n/>. A one-second burst allows to destroy all six <a object|bottarg>targets</a>.
hu: A <c/><a cbot|move>move</a>();<n/> utasítással megy előre. A <c/><a cbot|turn>turn</a>();<n/> utasítás fordul. A pozitív szög fordul balra. A <c/><a cbot|fire>fire</a>(1);<n/> lő az ágyúval. Az egy másodperces sorozat elég lesz mindhárom <a object|bottarg>céltárgy</a> esetében.

source: See also
hu: Lásd még

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
hu: <a cbot>Programozás</a>, <a cbot|type>típusok</a> és <a cbot|category>kategóriák</a>.

source: The program must execute the following scheme: Repeat 6 times :
hu: A programnak a következők alapján kell működnie: Ismételd meg 6 alkalommal azt hogy :

source: The instruction <code><a cbot|for>for</a></code> asks for 3 expressions:
hu: A <code><a cbot|for>for</a></code> utasításnak három kifejezésre van szüksége:
