Repository: muudry/colobot-data
Catalog: levels/missions/chapter001/level002/po/*.po
Languages: hu

source: Building
hu: Építés

source: Learn how to construct buildings.
hu: Tanuld meg, hogyan kell épületeket felhúzni.

source: From Mission Control
hu: Az irányítóközponttól

source: This is your second drill. <a object|human>You</a> should now familiarize yourself with the handling of basic equipment. This could turn out to be your best ally during the course of this expedition.
hu: Ez lesz a második gyakorlatod. <a object|human>Neked</a> most az a feladatod, hogy megismerkedj az alapvető felszerelések kezelésével. Könnyen lehet, hogy ez lesz a legfontosabb szövetségesed az expedíció során.

source: The construction of buildings and the manufacturing of bots all require the use of <a object|titan>titanium</a>. Titanium is a mineral found in most solar systems in the universe.
hu: Az épületek felhúzása és a botok gyártása <a object|titan>titán</a> felhasználásával történik. A titán az univerzum legtöbb naprendszerében megtalálható ásvány.

source: Procedure
hu: Eljárás

source: Position yourself close to the first <a object|titan>titanium cube</a>.
hu: Állj az első <a object|titan>titán kocka</a> közelébe.

source: Build a <a object|research>research center</a> <button 163/>. Note that only <a object|human>you</a> can accomplish the task of building; no bot can be substituted.
hu: Építs egy <a object|research>kutatóközpontot</a> <button 163/>. Vedd figyelembe, hogy csak <a object|human>te</a> tudod végrehajtani az építési műveletet; egyetlen bot sem teheti meg helyetted.

source: With a second <a object|titan>titanium cube</a>, build a <a object|factory>bot factory</a> <button 160/>.
hu: A második <a object|titan>titánium kockából</a> építs egy <a object|factory>bot gyárat</a> <button 160/>.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
hu: A(z) <format key><key help/></format> gomb segítségével bármikor visszanézheted ezeket az utasításokat a személyi SatCom-odon <button 63/>.

source: See also
hu: Lásd még

source: <a command>Controls</a>
hu: <a command>Irányítás</a>

source: Walkthrough
hu: Megoldás

source: Walk down the street that runs beside <a object|Huston>Mission Control</a>. You will find a <a object|titan>titanium cube</a> on the left hand side of the road, right after the <a object|botgr>grabber bot</a>.
hu: Indulj el az <a object|Huston>Irányító központ</a> mellett futó utcán. Az út bal oldalán találsz egy <a object|titan>titán kockát</a>, közvetlenül a <a object|botgr>markoló bot</a> után.

source: Face the cube. Click on the first button at the bottom left of your screen: <button 163/> <build a <a object|research>research center</a>>.
hu: Fordulj a kocka felé. Kattints az első gombra a képernyő bal alsó sarkában: <button 163/> <a object|research>kutató központ</a> építés.

source: Walk further down the road. The second cube is on the right past the four green <a object|power>power cells</a>.
hu: Sétálj tovább az úton. A második kocka a jobb oldalon található a négy zöld <a object|power>energiacella</a> mellett.

source: Repeat 1) but click on the second button: <button 160/> <build a <a object|factory>bot factory</a>>.
hu: Ismételd meg az 1) pontot, de a második gombra kattints: <button 160/> <a object|factory>bot gyár</a> építés.

source: As soon as both buildings are completed, the mission is at an end.
hu: A küldetés véget ér mihelyst kész mindkét épület.
