Repository: muudry/colobot-data
Catalog: levels/exercises/chapter003/level004/po/*.po
Languages: hu

source: Exchange posts 1
hu: Csereállomás 1

source: Collect valuable information from information exchange posts.
hu: Gyűjts be értékes adatokat a csereállomáson.

source: Info
hu: Infó

source: Exercise
hu: Gyakorlat

source: Several <a object|exchange>information exchange posts</a> stand in the middle of a <a object|mine>mine</a> field. When the bot is close enough to an exchange post, it can read the information that it contains. Every exchange post contains the angle of the rotation that must be performed in order to reach the next exchange post, without touching a <a object|mine>mine</a>. The exchange posts are distant 20m from each other.
hu: Több <a object|exchange>információ csere állomás</a> áll egy <a object|mine>akna</a> mező közepén. Ha a bot elég közel van egy csereállomáshoz, akkor tud információkat olvasni belőle. Mindegyik állomás az éppen szükséges fordulat szögét tartalmazza. Ennyit kell fordulni ahhoz, hogy elérhesd a következő állomást, a nélkül hogy <a object|mine>aknára</a> futnál. A csereállomások 20m távolságra vannak egymástól.

source: General principe
hu: Alapelv

source: Move 20m forward.
hu: Menj előre 20m-t.

source: Read the direction of the next <a object|exchange>information exchange post</a>.
hu: Olvasd ki az irányt a következő <a object|exchange>információ csere állomásból</a>.

source: Execute the necessary rotation.
hu: Hajtsd végre a szükséges fordulatot.

source: In order to repeat the steps above, use a <code><a cbot|for>for</a></code> loop, as we saw it before.
hu: A fenti lépések végrehajtásához használj egy <code><a cbot|for>for</a></code> ciklust, az eddigiekhez hasonlóan.

source: Move forward with the instruction <c/>move(20);<n/>.
hu: Menj előre a <c/>move(20);<n/> utasítással.

source: Use the instruction <c/><a cbot|receive>receive</a>("Direction");<n/> in order to read the information contained in the <a object|exchange>exchange post</a>. This is of course possible only when the bot is close enough to the exchange post. You will need a <a cbot|var>variable</a> to contain the value retrieved from the exchange post. Let us call it <code>dir</code>; you must declare it with the following line:
hu: A <c/><a cbot|receive>receive</a>("Direction");<n/> utasítás segítségével tudod kiolvasni a <a object|exchange>csereállomás</a> által tárolt informácót, persze csak akkor, ha elég közel vagy hozzá. Szükséged lesz egy <a cbot|var>változóra</a> ami tárolja majd az állomástól kapott információt. Ennek legyen a neve <code>irány</code>. Ezt az alábbi sorral kell deklarálni:

source: <c/> float dir;
hu: <c/> float irány;

source: Then retrieve the rotation angle from the exchange post, and put it into the variable:
hu: Ezután kérd le a fordulat szögét a cserállomástól, és tedd bele a változóba:

source: <c/> dir = receive(...);
hu: <c/> irány = receive(...);

source: Then you can execute the rotation:
hu: Ezután már végrehajthatod az elfordulást:

source: <c/> turn(dir);
hu: <c/> turn(irány);

source: Remark
hu: Megjegyzés

source: You can click on an <a object|exchange>information exchange post</a> in order to read what information it contains. In this exercise, every exchange post contains only one value called <code>"Direction"</code>, but it can contain up to 10 different values, as you will see in some of the following exercises.
hu: Ha rákattintasz az <a object|exchange>információ csere állomásra</a> akkor láthatod milyen információt tartalmaz. Ebben a gyakorlatban minden állomás egyetlen <code>"Direction"</code> (irány) nevű értéket tartalmaz, de maga az állomás képes több, de legfeljebb 10, különböző érték tárolására, mint azt későbbi gyakorlatokban látni fogjuk.

source: See also
hu: Lásd még

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
hu: <a cbot>Programozás</a>, <a cbot|type>típusok</a> and <a cbot|category>kategóriák</a>.

source: Repeat 5 times :
hu: Ismételd 5 alkalommal:
