Repository: muudry/colobot-data
Catalog: */levels/missions/po/*.po
Languages: hu

source: Leaving Earth
hu: Elhagyjuk a földet

source: Earth
hu: Föld

source: On the Moon
hu: A holdon

source: Moon
hu: Hold

source: On Tropica
hu: Trópikán

source: Tropica
hu: Trópika

source: On Crystalium
hu: Kristályságon

source: Crystalium
hu: Kristályság

source: On Saari
hu: Szigetségen

source: Saari
hu: Szigetség

source: On Volcano
hu: Vulkánián

source: Volcano
hu: Vulkánia

source: On Centaury
hu: Kentaurin

source: Centaury
hu: Kentauri

source: On Orpheon
hu: Orfeonon

source: Orpheon
hu: Orfeon

source: On Terranova
hu: Terranován
