Repository: muudry/colobot-data
Catalog: levels/exercises/chapter002/level001/po/*.po
Languages: hu

source: Barrage Fire
hu: Zárótűz

source: Set the power of the different motors in order to achieve a barrage fire.
hu: Szabályozd úgy a különböző motorok teljesítményét, hogy zárótűz jöjjön létre.

source: Move
hu: Mozgás

source: Objective
hu: A feladat

source: As a defense against several giant ants attacking from the north, rotate the bot when shooting in order to perform barrage fire.
hu: Védekezz az északról érkező óriáshangyák ellen úgy, hogy tüzelés közben elforgatod a botot, zárótüzet hozva ezzel létre.

source: When you are radio-guiding a bot, you can rotate the cannon during the burst in order to sweep a whole zone. You can also do this when programming the bot, but you have to turn the whole bot with the instruction <code><a cbot|motor>motor</a>( , )</code>. This instruction asks for two numbers: the speed of the left-hand motor, and the speed of the right-hand motor. These numbers must range between -1 and +1.<c/> motor(1,1);<n/> moves the bot forward with maximum speed (both motors at full power).<c/> motor(-1,-1);<n/> moves the bot backward with maximum speed.<c/> motor(1,0.9);<n/> moves the bot forward with a slight turn to the right: the left-hand motor turns a little faster than the right-hand motor. And <c/>motor(1,-1);<n/> will turn the bot clockwise on the spot: the left-hand motor moves forward, the right-hand motor moves backward.
hu: Amikor rádió-vezérelsz egy botot, akkor sorozatlövés közben elfordíthatva az ágyút, be tudsz teríteni egy egész területet. Ezt a bot programozással is meg tudod tenni, de az egész botot el kell forgatnod a <code><a cbot|motor>motor</a>( , )</code> utasítással. Ez az utasítás két számot vár: a bal oldali motor fordulatszámát és a jobb oldali motor fordulatszámát. Ezeknek a számoknak -1 és +1 között kell lenniük. A <c/> motor(1,1);<n/> maximális sebességgel mozgatja előre a botot (mindkét motort teljes teljesítményre kapcsolva). A <c/> motor(-1, -1);<n/> maximális sebességgel hátrafelé mozgatja a botot. <c/> motor(1,0.9);<n/> előre mozgatja a botot enyhe jobb fordulattal, mivel a bal oldali motor egy kicsit nagyobb fordulatszámon van mint a jobb oldali motor. És a <c/>motor(1,-1);<n/> a botot az óramutató járásával megegyező irányban helyben körbeforgatja, mivel a bal oldali motor előre, a jobb oldali motor pedig hátrafelé megy.

source: After a <a cbot|motor>motor</a> instruction the motors will keep this speed until the next <code>motor</code>, <code><a cbot|move>move</a></code>, <code><a cbot|turn>turn</a></code> or <code><a cbot|goto>goto</a></code> instruction. For example, if you perform a rotation on the spot with <c/>motor(1,-1);<n/> and afterward you shoot with <c/>fire(1);<n/>, the bot will continue to turn during the burst, and will sweep a whole zone.
hu: Egy <a cbot|motor>motor</a> utasítás után a motorok megtartják a sebességüket a következő <code>motor</code>, <code><a cbot|move>move</a></code> , <code><a cbot|turn>turn</a></code> vagy <code><a cbot|goto>goto</a></code> utasításig. Például, ha a helyben forogsz egy <c/>motor(1,-1);<n/> hatására, majd a tüzelsz a <c/>fire(1);<n/> utasítással, akkor a bot tovább forog a sorozat alatt, és így végig söpri a teljes területet maga körül.

source: rotate clockwise with <c/>motor(1,-1);<n/>
hu: forogj az óramutató járásával megegyező irányban: <c/>motor(1,-1);<n/>

source: a 2 seconds burst with <c/>fire(2);<n/>
hu: tüzelj egy 2 másodperces sorozatot: <c/>fire(2);<n/>

source: rotate counter-clockwise with <c/>motor(-1,1);<n/>
hu: forogj az óramutató járásával ellenkező irányban: <c/>motor(1,-1);<n/>

source: a 2 seconds burst.
hu: két másodperces sorozat.

source: See also
hu: Lásd még

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
hu: <a cbot>Programozás</a>, <a cbot|type>típusok</a> és <a cbot|category>kategóriák</a>.

source: The ants attack from the north. In order to sweep the whole zone north of the bot, first turn 90 degrees left with <c/>turn(90);<n/>, then repeat always with <code><a cbot|while>while</a> (true)</code> the following instructions:
hu: A hangyák északról támadnak. A bottól északra lévő teljes zóna végigsöpréséhez először fordulj 90 fokot balra a <c/>turn(90);<n/> utasítással, majd ismételd (feltétel nélkül) a <code><a cbot|while>while</a> (true)</code> blokkal a következő utasításokat:
