Repository: muudry/colobot-data
Catalog: levels/exercises/chapter001/level001/po/*.po
Languages: hu

source: Spiders 1
hu: Pókok 1

source: Kill three spiders with a small program.
hu: Ölj meg három pókot egy rövid programmal.

source: Spider1
hu: Pók1

source: Objective
hu: Célkitűzés

source: Write a small program to kill three spiders.
hu: Írj egy rövid programot ami megöl három pókot.

source: Procedure
hu: Eljárás

source: In order to program the bot, select it.
hu: Hogy programozhasd a robotot, előbb jelöld ki.

source: The numbers 1 to 4 corresponding to the programs contained in the bot appear on the lower left-hand corner of your screen. Select the first line.
hu: A botban található programoknak megfelelő számok (1-től 4-ig) megjelennek a képernyő bal alsó sarkában. Válaszd ki az első sort.

source: Click the button with the braces <button 22/>, and you will arrive in an editor where you can write the program.
hu: Kattints a kapcsos-zárójeles <button 22/> gombra, és megjelenik a szerkesztő, amelyben a programokat lehet írni.

source: While you are writing the program, the key <format key><key help/></format> will display the text you are reading right now. When you have finished writing the program, click the "OK" button.
hu: A program írása közben a <format key><key help/></format> gomb előhozza a szöveget amit most olvasol. Ha befejezted a program írását, kattints az "OK" gombra.

source: In order to execute the program, click the arrow button <button 21/>.
hu: A programot anyíl gomb <button 21/> megnyomásával lehet lefuttatni.

source: You must tell the bot exactly step by step what it must do in order to kill the three spiders. The bot understands only precise instructions, which it will execute one after another.
hu: Pontosan, lépésről lépésre kell megmondanod a botnak, hogy mit kell tennie ahhoz hogy megölje a három pókot. A bot csak a pontos utasításokat érti, amelyeket egymás után hajt végre.

source: When you click the braces button <button 22/> in order to write the program, a part of the program will already be there:
hu: Mikor megnyomod a kapcsos-zárójeles gombot <button 22/> hogy megírhasd a programot, a program egy része már ott lesz:

source: extern void object::Spider1( ) { <n/>write your program here ...<c/> }
hu: extern void object::Spider1( ) { <n/>ide írd a programodat ...<c/> }

source: Everything that is already written when you arrive in the editor must not be altered. Just introduce the necessary instructions at the cursor.
hu: Semmit nem szabad átírni ami már benn volt a szerkesztő megnyitásakor. Csak írd be a szükséges utasításokat oda ahol a kurzor van.

source: You will need the following instructions:
hu: A következő utasításokra lesz szükség:

source: <n/>Puts the cannon straight.
hu: <n/>Egyenesbe állítja az ágyút.

source: <n/>Executes a rotation of a certain angle, given in brackets in degrees. For example <c/>turn(90);<n/> will turn the bot 90 degrees to the left, i.e. a quarter turn to the left. <c/>turn(-90);<n/> will turn the bot 90 degrees to the right (quarter turn right). Positive values turn left, negative values turn right. <c/>turn(180);<n/> will make the bot face in the opposite direction.
hu: <n/>Elfordul adott szögben. A szöget a zárójelben kell megadni fokban. Például a <c/>turn(90);<n/> a botot 90 fokkal balra fordítja, azaz végrehajt egy negyed fordulatot balra. A <c/>turn(-90);<n/> a botot 90 fokkal jobbra fordítja (negyedfordulat jobbra). A pozitív értékek balra, a negatív értékek jobbra fordulnak. A <c/>turn(180);<n/> a botot az ellenkező irányba fordítja.

source: <n/>Shoots the cannon. The number in brackets indicates the duration of the burst. In most cases, shoot a burst of 1 second.
hu: <n/>Lő az ágyúval. A zárójelben lévő szám a sorozatlövés időtartamát jelzi. Általában elegendő egy 1 másodperces sorozat.

source: put the cannon straight with <c/>aim(0);<n/>
hu: állítsuk az ágyút egyenesen előre: <c/>aim(0);<n/>

source: shoot the spider straight ahead with <c/>fire(1);<n/>
hu: lőjük le az egyenesen előttünk lévő pókot: <c/>fire(1);<n/>

source: turn 90 degrees left with <code>turn(90)</code>
hu: forduljunk 90 fokot balra: <code>turn(90)</code>

source: shoot with <c/>fire(1);<n/>
hu: lőjünk: <c/>fire(1);<n/>

source: etc.
hu: stb.

source: Here is the program that does all this :
hu: Így néz ki a program ami mindezt megteszi:

source: extern void object::Spider1( ) { aim(0); fire(1); turn(90); fire(1); }
hu: extern void object::Pók1( ) { aim(0); fire(1); turn(90); fire(1); }

source: It is up to you now to write the rest of the program!
hu: A program további részét neked kell megírnod!

source: If you have got a problem, you can always look at the solution: select the <code>Solution</code> program on the lower left-hand corner of the screen, and click the braces button <button 22/>. You can even execute the solution program with the arrow button <button 21/>.
hu: Ha elakadsz, bármikor megnézheted a megoldást: válaszd ki a <code>Megoldás</code> programot a képernyő bal alsó sarkában, és kattints a kapcsos zárójelre <button 22/>. A <button 21/> nyílgombbal akár le is futtathatod a megoldást jelentő programot.

source: Remarks
hu: Megjegyzések

source: Be careful to write the instructions precisely, respecting lower and upper case letters.
hu: Figyelj oda arra, hogy az utasításokat pontosan másold, megtartva a kis- és nagybetűket.

source: Always write one instruction per line, finishing each line with a semicolon.
hu: Egy sorba mindig egy utasítás kerül, minden sort egy pontosvesszővel zárunk.

source: In case your program does not do exactly what you wanted, you can put the bot back at the starting point with the <button 59/> button. You can also start over again from the beginning (hit the "Esc" key, then click "Restart"). The program you have written will not be lost.
hu: Abban az esetben, ha a programod nem azt csinálja, amit akartál, a <button 59/> gombbal visszahelyezheted a botot a kiindulási pontra. Az egészet is elölről is kezdheted (nyomd meg az "Esc" billentyűt, majd kattints az "Újraindítás" gombra). Az általad írt program így sem vész el.

source: <format key><key help/></format> allows you to review these instructions at all times.
hu: A(z) <format key><key help/></format> gombbal bármikor visszanézheted ezeket az útmutatásokat.

source: Let us see the beginning of the program:
hu: Lássuk a program elejét:
