Repository: muudry/colobot-data
Catalog: levels/exercises/chapter003/level002/po/*.po
Languages: hu

source: Follow with variables
hu: Követés változókkal

source: Use variables in order to store the parameters of the path.
hu: Tárold az út paramétereit változókban.

source: Move
hu: Követés

source: Exercise
hu: Gyakorlat

source: This exercise is very similar to the previous one. The bot must move exactly in the same way, but when writing the program, you must use a new concept that is extremely important in programming: <a cbot|var>variables</a>. We saw that all the pads are at a distance form each other of 20 meters. And all the rotations performed consist in 90 degree angles. Instead of rewriting the same values over and over again in the program, we can store them in a variable:
hu: Ez a feladat nagyon hasonlít az előzőre. A botnak pontosan ugyanúgy kell mozognia, de most úgy kell megírnod a programot, hogy egy, a programozásban rendkívül fontos dolgot kell használnod: <a cbot|var>változókat</a>. A mezők itt is 20 méterre vannak egymástól, mint az előbb. És az összes fordulat 90 fokos. Ahelyett, hogy ezeket az értékeket újra és újra leírnád a programban, tedd inkább őket egy-egy változóba:

source: Instead of: <c/><s/> move(20);
hu: E helyett: <c/><s/> move(20);

source: We write : <c/><s/> dist = 20;
hu: Ezt írd: <c/><s/> táv = 20;

source: dir = 90; move(dist); turn(dir); move(dist); turn(-dir); ...
hu: irány = 90; move(táv); turn(irány); move(táv); turn(-irány); ...

source: Variables
hu: Változók

source: The name,
hu: A neve,

source: The type of the content,
hu: A tartalom típusa,

source: The content.
hu: A tartalom.

source: The name
hu: A név

source: Use the name to refer to a variable. For example, instead of writing <c/>move(20);<n/>, write <c/>move(dist);<n/>: "dist" is the name of the variable. You can choose almost any name for a variable, for example <code>dist</code>, <code>dir</code>, <code>p2</code>, <code>a</code>, <code>x</code>, <code>nothing_2_grab</code>, etc.
hu: A név segítségével tudunk a változóra hivatkozni. Például, e helyett <c/>move(20);<n/>, azt írjuk, hogy <c/>move(táv);<n/>: Ahol a "táv" a változó neve. Szinte bármilyen nevet adhatsz egy változónak, mint pl. <code>táv</code>, <code>irány</code>, <code>p2</code>, <code>a</code>, <code>x</code>, <code>nincsmit_felvenni</code>, stb.

source: The type
hu: A típus

source: <code><a cbot|int>int</a></code> for a whole number (12, -500, etc.)
hu: Az <code><a cbot|int>int</a></code> egy egész szám (12, -500, stb.)

source: <code><a cbot|float>float</a></code> for a real number (3.14, 0.2, -99.98, etc.)
hu: A <code><a cbot|float>float</a></code> egy valós szám (3.14, 0.2, -99.98, stb.)

source: <code><a cbot|string>string</a></code> for a character string ("Hello!", "Nothing to grab", etc.)
hu: A <code><a cbot|string>string</a></code> egy karakter lánc (betűkből, számokból, jelekből, stb. álló szöveg, pl. "Helló!", "Nincs mint felvenni", stb.)

source: <code><a cbot|point>point</a></code> for the x,y,z-coordinates of a point in space
hu: A <code><a cbot|point>point</a></code> egy térbeli pont x,y,z koordinátái

source: <code><a cbot|object>object</a></code> for the information about an object (bot, building, etc.)
hu: A <code><a cbot|object>object</a></code> információk egy tárgyról (bot, épület, stb.)

source: The content
hu: A tartalom

source: The content of a variable can be a number, a string, coordinates, etc., according to the type of the variable. The content of a variable can change many times during the execution of a program.
hu: A változó tartalma lehet szám, szöveg, koordináták, stb., a változó típusa szerint. A változó tartalma a program végrehajtása során sokszor meg tud változni.

source: Before you can use a variable, you have to declare it. For example, before you can use the two variables <code>dist</code> and <code>dir</code>, you must declare them with the following lines:
hu: A változókat használat előtt deklarálni kell. Tehát ezt két változót: <code>táv</code> és <code>irány</code>, csak azután használhatod, hogy deklaráltad őket az alábbi sorok segítségével:

source: float dist; float dir;
hu: float táv; float irány;

source: Now you can use the two variables. To put the value 20 into <code>dist</code> and 90 into <code>dir</code>, write:
hu: Most már használhatod a két változót. Ahhoz, hogy 20-at tegyünk a <code>táv</code>-ba, és 90-et az <code>irány</code>-ba, ezt kell írni:

source: dist = 20; dir = 90;
hu: táv = 20; irány = 90;

source: Now you can move and turn the bot with the instructions <code><a cbot|move>move</a></code> and <code><a cbot|turn>turn</code></a>:
hu: Így már mozgathatod és forgathatod a botot a <code><a cbot|move>move</a></code> és <code><a cbot|turn>turn</code></a> utasításokkal a változókat használva:

source: move(dist); turn(dir);
hu: move(táv); turn(irány);

source: You can also use a whole <a cbot|expr>mathematical expression</a> instead of just the variable:
hu: Természetesen összetettebb <a cbot|expr>matematikai kifejezéseket</a> is használhatsz simán csak a változó helyett:

source: move(dist+100); turn(-dir);
hu: move(táv+100); turn(-irány);

source: The latter instruction will be needed to turn the bot right.
hu: Az utóbbi utasításra szükséged lesz, hogy jobbra fordítsd a botot.

source: Now, rewrite the program of the previous exercise, but use a variable for the distance and another variable for the angle of the rotation.
hu: Most pedig, írd át az előző feladat programját olyanra hogy a távolsághoz egy változót használjon, a forgás szögéhez pedig még egy változót.

source: See also
hu: Lásd még

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
hu: <a cbot>Programozás</a>, <a cbot|type>típusok</a> and <a cbot|category>kategóriák</a>.

source: A <a cbot|var>variable</a> is composed of three elements:
hu: Egy <a cbot|var>változó</a> három dologból áll:

source: The type of a variable determines what kind of information the variable can contain. According to the type, a variable can contain a whole number, a real number, a character string, the coordinates of a point, etc. Here is a list with the most common variable types:
hu: A változó típusa határozza meg hogy milyen jellegű információt tud a változó tárolni. A típusa szerint, egy változó tartalmazhat egy egész számot, egy valós számot, egy karakterláncot (szöveget), egy pont koordinátáit, stb. Ime egy lista a leggyakoribb változó típusokról:
