Repository: muudry/colobot-data
Catalog: levels/exercises/chapter003/level001/po/*.po
Languages: hu

source: Follow a path
hu: Kövesd az utat

source: Move the bot along a given path.
hu: Vidd végig a botot az adott útvonalon.

source: Move
hu: Útvonal

source: Exercise
hu: Gyakorlat

source: Program the robot in such a way that it arrives on the finishing pad, after having passed by the three blue crosses.
hu: Programozd be úgy a robotot, hogy a célmezőre érkezzen, miután végighaladt a két keresztekkel kijelölt úton.

source: Procedure
hu: Eljárás

source: Take the power cell and put it on the rear of the bot.
hu: Fogd az energiacellát és tedd a robot hátuljába.

source: Walk around on reconnaissance to understand what the bot must do.
hu: Tégy egy felderítő sétát, hogy átlásd mit kell a robotnak csinálnia.

source: Program the bot. To do so, you must select it, and then click on the braces button <button 22/>; you will get into the program editor.
hu: Programozd be a botot. Ehhez jelöld ki, majd kattints a kapcsos zárójeles gombra <button 22/>, hogy megnyíljon a program szerkesztő.

source: Once you finished writing the program, click "OK", and execute the program with the arrow key <button 21/>.
hu: Ha elkészült a program, kattints az "OK"-ra, és futtasd a programot a nyilas gombbal <button 21/>.

source: The pads are at a distance of 20 meters from each other. The instruction <c/>move(20);<n/> moves 20 meters forward. The instruction <c/>turn(90);<n/> turns left with an angle of 90 degrees. The instruction <c/>turn(-90);<n/> turns right with an angle of 90 degrees.
hu: A mezők 20 méter távolságra vannak egymástól. A <c/>move(20);<n/> utasítás 20 métert megy előre. A <c/>turn(90);<n/> utasítás 90 fokkal balra fordul. A <c/>turn(-90);<n/> utasítás 90 fokkal jobbra fordul.

source: The frame of the program consists in:
hu: A program kerete a következőképpen néz ki:

source: extern void object::MoveBot( ) { <n/>\\write the necessary instructions here ...<c/> }
hu: extern void object::Útvonal( ) { <n/>\\írd ide a szükséges utasításokat ...<c/> }

source: For now, you must not change the frame of the program. Just insert the instructions you need to move the bot around between the braces <code>{ }</code>.
hu: Most még ne változtassa a program keretén. Egyszerűen csak írd a kapcsok <code>{ }</code> közé a megfelelő utasításokat.

source: Attention
hu: Figyelem

source: Be very careful about upper case and lower case letters! Every instruction must be terminated with a semicolon.
hu: Figyelj oda a kis- és nagybetűkre! Minden utasítást pontosvesszővel kell lezárni.

source: Helpful trick
hu: Hasznos trükk

source: When you write the program, you can watch the scene by clicking on the button <Reduce> <button 51/>, and by moving the mouse to the edges of the window to turn the camera.
hu: Programozás közben a <Reduce> <button 51/> gombra kattintva figyelheted a helyszínt, és a képernyő szélére húzva az egeret a kamerát is forgathatod.

source: See also
hu: Lásd még

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
hu: <a cbot>Programozás</a>, <a cbot|type>típusok</a> és <a cbot|category>kategóriák</a>.
