Repository: muudry/colobot-data
Catalog: levels/exercises/chapter002/level003/po/*.po
Languages: hu

source: Flying Tower 2
hu: Replülő torony 2

source: Program a flying tower that wastes less energy.
hu: Programozd be úgy a repülő tornyot, hogy kevesebb energiát fogyasszon.

source: Move
hu: Útvonal

source: Objective
hu: Célkitűzés

source: Adapt the program <code>Tower1</code> in order to avoid wasting energy when shooting at ants that are out of range.
hu: Alakítsd át a <code>Torony1</code> programot, úgy hogy elkerülje a hatótávon kívüli hangyákra való tüzelésből adódó energia pazarlást.

source: The program <code>Tower1</code> shoots in the direction of the closest ant, even if it is still out of range:
hu: A <code>Torony1</code> a legközelebbi hangya irányába lő, akkor is ha a hangya még hatótávon kívül van:

source: extern void object::Tour1() { object item; jet(0.2); while(position.z < 20) { wait(0.2); } jet(0); while(true) { item = radar(AlienAnt); turn(direction(item.position)); fire(1); } }
hu: extern void object::Torony1() { object item; jet(0.2); while(position.z < 20) { wait(0.2); } jet(0); while(true) { item = radar(AlienAnt); turn(direction(item.position)); fire(1); } }

source: If the bot must perform the same task than before with only a <a object|power>regular power cell</a>, you can insert a loop that waits until the ant is close enough, i.e. until the ant is at less than 40 meters. Only one burst will be needed for every ant then.
hu: Ha a botnak ugyanazt a feladatot kell végrehajtania, mint korábban, csak egy <a object|power>hagyományos energia cellával</a>, akkor berakhatsz egy hurkot, amely megvárja, amíg a hangya elég közel kerül, azaz amíg a hangya 40 méteren belülre kerül. Így minden hangyához elegendő lesz csupán egyetlen sorozat.

source: You can give the instruction <code><a cbot|radar()>radar</a></code> more parameters (numbers) indicating where the radar should look for the ants. For example <c/>radar(AlienAnt,0,360,0,40);<n/> will only look for ants that are closer than 40 meters. The two first numbers tell the radar to search in all directions, the two last numbers tell the radar to detect only ants that are at a distance between 0 and 40 meters. If no ant is found that is closer than 40 meters, the instruction <code><a cbot|radar()>radar</a></code> returns the value <code>null</code>. We can then write a conditional loop similar to the one written in the last exercise that waits as long as there is no ant closer than 40 meters:
hu: A <code><a cbot|radar()>radar</a></code> utasításnak további paramétereket (számokat) adhatsz meg, amelyek jelzik, hogy a radar hol keresse a hangyákat. Például a <c/>radar(AlienAnt,0,360,0,40);<n/> csak azokat a hangyákat keresi, amelyek 40 méternél közelebb vannak. Az első két szám azt jelzi, hogy a radar minden irányban keressen, a két utolsó szám pedig azt, hogy csak a 0 és 40 méteres távolságra lévő hangyákat észlelje. Ha nem található hangya 40 méternél közelebb, a <code><a cbot|radar()>radar</a></code> utasítás a <code>null</code> értéket adja vissza. Ezután írhatunk egy feltételes ciklust, amely hasonló az előző gyakorlatban írthoz, és kivárja, hogy 40 méternél közelebb kerüljön egy hangya:

source: Notice that two equal signs "==" are needed to perform a comparison of equality.
hu: Vedd észre, hogy két egyenlőségjelre "==" van szükség az egyenlőség vizsgálathoz.

source: Just insert these lines before the instruction <c/>fire(0);<n/>, and the bot will wait before shooting until the ant is closer than 40 meters. Like this a regular power cell is enough to kill all ants.
hu: Egyszerűen csak illesszd be ezeket a sorokat a <c/>fire(0);<n/> utasítás elé, és így a bot tüzelés előtt várni fog amíg a hangya közelebb nem kerül 40 méternél. Így egy hagyományos energiacella is elég ahhoz, hogy minden hangyát kiirtson.

source: See also
hu: Lásd még

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
hu: <a cbot>Programozás</a>, <a cbot|type>típusok</a> és <a cbot|category>kategóriák</a>.
